pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// bl602_demo_wifi_text_0000.c
// Generated by decompiling bl602_demo_wifi.elf
// using Reko decompiler version 0.9.3.0.

#include "bl602_demo_wifi.h"

// 23000300: void cb_httpc_headers_done_fn(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void cb_httpc_headers_done_fn(Eq_2 ra, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	word32 s1_45;
	word32 a0_46;
	word32 a1_47;
	word32 a2_48;
	word32 a3_49;
	word32 a4_50;
	word32 a5_51;
	word32 a7_52;
	word32 s2_53;
	word32 s3_54;
	word32 s4_55;
	word32 s5_56;
	word32 s6_57;
	word32 s7_58;
	word32 s8_59;
	word32 s9_60;
	word32 s10_61;
	word32 s11_62;
	word32 t4_63;
	printf(ra, &g_t23072668, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_45, out a0_46, out a1_47, out a2_48, out a3_49, out a4_50, out a5_51, out a7_52, out s2_53, out s3_54, out s4_55, out s5_56, out s6_57, out s7_58, out s8_59, out s9_60, out s10_61, out s11_62, out t4_63);
}

// 2300031C: void cb_httpc_result(Register Eq_2 ra, Register (ptr32 word32) a0, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void cb_httpc_result(Eq_2 ra, word32 * a0, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	word32 s1_50;
	word32 a0_51;
	word32 a1_52;
	word32 a2_53;
	word32 a3_54;
	word32 a4_55;
	word32 a5_56;
	word32 a7_57;
	word32 s2_58;
	word32 s3_59;
	word32 s4_60;
	word32 s5_61;
	word32 s6_62;
	word32 s7_63;
	word32 s8_64;
	word32 s9_65;
	word32 s10_66;
	word32 s11_67;
	word32 t4_68;
	printf(ra, &g_t23072694, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_50, out a0_51, out a1_52, out a2_53, out a3_54, out a4_55, out a5_56, out a7_57, out s2_58, out s3_59, out s4_60, out s5_61, out s6_62, out s7_63, out s8_64, out s9_65, out s10_66, out s11_67, out t4_68);
	*a0 = 0x00;
}

// 2300033E: void cb_altcp_recv_fn(Register Eq_2 ra, Register Eq_2 a2, Register ptr32 mstatus, Stack Eq_2 dwArg0118)
void cb_altcp_recv_fn(Eq_2 ra, Eq_2 a2, ptr32 mstatus, Eq_2 dwArg0118)
{
	struct Eq_381 * a5_18;
	word32 a2_102;
	word32 a4_103;
	word32 a1_101;
	word32 a0_100;
	word32 s8_104;
	Eq_2 s4_23;
	Eq_2 s1_22 = puts(587770668, out a0_100, out a1_101, out a2_102, out a4_103, out a5_18, out s4_23, out s8_104);
	Eq_2 a4_27 = a5_18->t0000;
	a5_18->t0001 = a4_27;
	struct Eq_415 * a5_30 = a5_18 & 63;
	if ((a5_18 & 63) == 0x00)
	{
		word32 a0_122;
		word32 a1_123;
		word32 a2_124;
		word32 s8_125;
		s1_22 = puts(0x230727FC, out a0_122, out a1_123, out a2_124, out a4_27, out a5_30, out s4_23, out s8_125);
	}
	word32 a5_105;
	altcp_recved(s1_22, a5_30, out a5_105);
	word32 s0_106;
	word32 s1_107;
	word32 a0_108;
	word32 a1_109;
	word32 a2_110;
	word32 a3_111;
	word32 a4_112;
	word32 a5_113;
	word32 a7_114;
	word32 s2_115;
	word32 s3_116;
	word32 s4_117;
	word32 s5_118;
	word32 s6_119;
	word32 s8_120;
	word32 mstatus_121;
	pbuf_free(ra, a2, &a5_18->t0001, a4_27, s4_23, mstatus, dwArg0118, out s0_106, out s1_107, out a0_108, out a1_109, out a2_110, out a3_111, out a4_112, out a5_113, out a7_114, out s2_115, out s3_116, out s4_117, out s5_118, out s6_119, out s8_120, out mstatus_121);
}

// 23000394: Register Eq_2 cmd_stack_wifi(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0194, Register out ptr32 a0Out, Register out ptr32 a1Out)
// Called from:
//      aos_loop_proc
Eq_2 cmd_stack_wifi(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArg0194, ptr32 & a0Out, ptr32 & a1Out)
{
	if ((word32) g_b4200DC88 != 0x01)
	{
		g_b4200DC88 = 0x01;
		Eq_2 a3_18;
		word32 a1_197;
		word32 a2_198;
		word32 a4_199;
		word32 a5_200;
		bl_timer_now_us(out a1_197, out a2_198, out a3_18, out a4_199, out a5_200);
		word32 s1_201;
		word32 a0_202;
		word32 a1_203;
		word32 a2_204;
		word32 a3_205;
		word32 a4_206;
		word32 a5_207;
		word32 a7_208;
		word32 s2_209;
		word32 s3_210;
		word32 s4_211;
		word32 s5_212;
		word32 s6_213;
		word32 s7_214;
		word32 s8_215;
		word32 s9_216;
		word32 s10_217;
		word32 s11_218;
		word32 t4_219;
		Eq_2 ra_61 = hal_wifi_start_firmware_task(printf(ra, &g_t23072880, a3_18, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_201, out a0_202, out a1_203, out a2_204, out a3_205, out a4_206, out a5_207, out a7_208, out s2_209, out s3_210, out s4_211, out s5_212, out s6_213, out s7_214, out s8_215, out s9_216, out s10_217, out s11_218, out t4_219), mstatus, dwArg04, dwArgC8, dwArg0194);
		Eq_2 a3_78;
		word32 a1_220;
		word32 a2_221;
		word32 a4_222;
		word32 a5_223;
		bl_timer_now_us(out a1_220, out a2_221, out a3_78, out a4_222, out a5_223);
		struct Eq_604 * a4_96;
		word32 s1_224;
		word32 a0_225;
		word32 a1_226;
		word32 a2_227;
		word32 a3_228;
		word32 a5_229;
		word32 a7_230;
		word32 s2_231;
		word32 s3_232;
		word32 s4_233;
		word32 s5_234;
		word32 s6_235;
		word32 s7_236;
		word32 s8_237;
		word32 s9_238;
		word32 s10_239;
		word32 s11_240;
		word32 t4_241;
		Eq_2 ra_98 = printf(ra_61, &g_t23072898, a3_78, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_224, out a0_225, out a1_226, out a2_227, out a3_228, out a4_96, out a5_229, out a7_230, out s2_231, out s3_232, out s4_233, out s5_234, out s6_235, out s7_236, out s8_237, out s9_238, out s10_239, out s11_240, out t4_241);
		ptr32 a0_118;
		ptr32 a1_119;
		word32 s0_247;
		word32 a3_248;
		Eq_2 ra_124 = aos_post_event(ra_98, 0x02, a4_96, dwArg24, out s0_247, out a0_118, out a1_119, out a3_248);
		a0Out = a0_118;
		a1Out = a1_119;
		return ra_124;
	}
	else
	{
		ptr32 a0_130;
		ptr32 a1_134;
		word32 a2_242;
		word32 a4_243;
		word32 a5_244;
		word32 s4_245;
		word32 s8_246;
		puts(587671644, out a0_130, out a1_134, out a2_242, out a4_243, out a5_244, out s4_245, out s8_246);
		a0Out = a0_130;
		a1Out = a1_134;
		return ra;
	}
}

// 230003FC: void cmd_exception_illegal_ins(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void cmd_exception_illegal_ins(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	bl_irq_exception_trigger(ra, 0x03, 0x22008001, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC);
}

// 23000408: void cmd_exception_store(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void cmd_exception_store(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	bl_irq_exception_trigger(ra, 0x01, 0x22008001, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC);
}

// 23000414: void cmd_exception_l_illegal(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void cmd_exception_l_illegal(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	bl_irq_exception_trigger(ra, 0x02, 0x00200000, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC);
}

// 2300041E: void cmd_exception_load(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void cmd_exception_load(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	bl_irq_exception_trigger(ra, 0x00, 0x22008001, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC);
}

// 2300042A: void cmd_dma(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack word32 dwArg38, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188, Stack Eq_2 dwArg0198)
void cmd_dma(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg30, Eq_2 dwArg34, word32 dwArg38, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0188, Eq_2 dwArg0198)
{
	bl_dma_test(ra, s1, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg18, dwArg30, dwArg34, dwArg38, dwArg60, dwArg64, dwArg7C, dwArg88, dwArgAC, dwArg0128, dwArg0148, dwArg0158, dwArg0168, dwArg0188, dwArg0198);
}

// 2300042E: void cmd_cks(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8)
void cmd_cks(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArgB8, Eq_2 dwArgF8)
{
	bl_cks_test(ra, mstatus, dwArg18, dwArgB8, dwArgF8);
}

