pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 23000432: void cmd_aes(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgAC)
void cmd_aes(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgAC)
{
	bl_sec_aes_test(ra, s0, s1, s2, dwArg18, dwArg1C, dwArg30, dwArg34, dwArg3C, dwArg40, dwArg44, dwArg60, dwArg64, dwArg68, dwArg7C, dwArg88, dwArg8C, dwArgAC);
}

// 23000436: void cmd_trng(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void cmd_trng(Eq_2 ra, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	word32 s1_34;
	word32 a3_35;
	word32 a4_36;
	word32 a5_37;
	bl_sec_test(ra, a3, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_34, out a3_35, out a4_36, out a5_37);
}

// 2300043A: void cmd_sha(Register Eq_2 ra, Register Eq_2 s2, Stack word32 dwArg08, Stack word32 dwArg38)
void cmd_sha(Eq_2 ra, Eq_2 s2, word32 dwArg08, word32 dwArg38)
{
	bl_sec_sha_test(ra, s2, dwArg08, dwArg38);
}

// 2300043E: void cmd_wifi(Register Eq_2 ra, Register Eq_2 s2, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack ui32 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg5C, Stack Eq_2 dwArgC8)
void cmd_wifi(Eq_2 ra, Eq_2 s2, Eq_2 dwArg10, Eq_2 dwArg14, ui32 dwArg28, Eq_2 dwArg38, Eq_2 dwArg5C, Eq_2 dwArgC8)
{
	mm_sec_keydump(ra, s2, dwArg10, dwArg14, dwArg28, dwArg38, dwArg5C, dwArgC8);
}

// 23000442: void cmd_pka(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Stack Eq_2 dwArg18, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgAC)
void cmd_pka(Eq_2 ra, Eq_2 s1, Eq_2 s2, Eq_2 dwArg18, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgAC)
{
	bl_pka_test(ra, s1, s2, dwArg18, dwArg30, dwArg34, dwArg40, dwArg44, dwArg60, dwArg64, dwArg68, dwArg7C, dwArg88, dwArg8C, dwArgAC);
}

// 23000446: void cmd_aws(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void cmd_aws(Eq_2 ra, Eq_2 s1, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	word32 a2_44;
	word32 a3_45;
	word32 a4_46;
	word32 a5_47;
	xTaskCreate(ra, s1, 0x01000000, 0x00, 0x0A, 0x00, s3, mstatus, dwArg10, dwArg14, dwArgF8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out a2_44, out a3_45, out a4_46, out a5_47);
}

// 23000462: void proc_hellow_entry(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void proc_hellow_entry(Eq_2 ra, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	word32 s1_35 = 0x23073000;
	word32 s4_115;
	word32 s3_114;
	word32 s2_113;
	word32 a5_112;
	word32 a4_111;
	word32 a2_110;
	word32 a1_109;
	word32 a0_108;
	word32 s1_107;
	word32 s8_116;
	Eq_2 a3_23;
	Eq_2 s0_36 = (word32) vTaskDelay(500, a2, a3, a4, a5, mstatus, dwArg14, dwArg18, dwArg0128, dwArg0168, out s1_107, out a0_108, out a1_109, out a2_110, out a3_23, out a4_111, out a5_112, out s2_113, out s3_114, out s4_115, out s8_116) + 1808;
	while (true)
	{
		Eq_2 a5_46;
		Eq_2 a2_49;
		Eq_2 a3_50;
		Eq_2 a4_51;
		word32 s1_117;
		word32 a0_118;
		word32 a1_119;
		word32 a7_120;
		word32 s2_121;
		word32 s3_122;
		word32 s4_123;
		word32 s5_124;
		word32 s6_125;
		word32 s7_126;
		word32 s8_127;
		word32 s9_128;
		word32 s10_129;
		word32 s11_130;
		word32 t4_131;
		ra = printf(ra, s1_35 + -0x0404, a3_23, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_117, out a0_118, out a1_119, out a2_49, out a3_50, out a4_51, out a5_46, out a7_120, out s2_121, out s3_122, out s4_123, out s5_124, out s6_125, out s7_126, out s8_127, out s9_128, out s10_129, out s11_130, out t4_131);
		word32 a0_132;
		word32 a1_133;
		word32 a2_134;
		word32 a4_135;
		word32 a5_136;
		word32 s2_137;
		word32 s3_138;
		word32 s4_139;
		word32 s8_140;
		s0_36 = vTaskDelay(s0_36, a2_49, a3_50, a4_51, a5_46, mstatus, dwArg14, dwArg18, dwArg0128, dwArg0168, out s1_35, out a0_132, out a1_133, out a2_134, out a3_23, out a4_135, out a5_136, out s2_137, out s3_138, out s4_139, out s8_140);
	}
}

// 23000496: Register uint32 char_to_hex(Register uint32 a0)
// Called from:
//      event_cb_wifi_event
uint32 char_to_hex(uint32 a0)
{
	uint32 a0_13 = a0 + -48 & 0x00FF;
	if (a0_13 <= 0x09)
		return a0_13;
	ui32 a5_14;
	if ((a0 + -97 & 0x00FF) <= 0x05)
		a5_14 = a0 + -87;
	else
	{
		a0_13 = 0x00;
		if ((a0 + -65 & 0x00FF) > 0x05)
			return a0_13;
		a5_14 = a0 + -55;
	}
	a0_13 = a5_14 & 0x00FF;
	return a0_13;
}

// 230004D2: void cmd_httpc_test(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register Eq_2 s9, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void cmd_httpc_test(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, Eq_2 s9, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	if (g_dw4200DC80 == 0x00)
	{
		word32 t1_186;
		word32 a0_187;
		word32 a1_188;
		word32 a2_189;
		word32 a3_190;
		word32 a4_191;
		word32 a5_192;
		Eq_2 ra_24 = memset(ra, 0x42010140, 0x00, 0x1C, out t1_186, out a0_187, out a1_188, out a2_189, out a3_190, out a4_191, out a5_192);
		g_dw42010154 = 0x2300031C;
		g_dw42010158 = 0x23000300;
		g_b42010146 = 0x00;
		0x00 = (uint16) dwArg38;
		httpc_get_file_dns(ra_24, s0, 0x23072848, 80, 587671588, &g_t42010140, 0x2300033E, 0x4200DC80, 0x42010140, s5, s6, s7, s8, s9, s10, mstatus, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg38, dwArg3C, dwArg48, dwArg4C, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158);
	}
	else
	{
		0x00 = (uint16) dwArg38;
		word32 s1_193;
		word32 a0_194;
		word32 a1_195;
		word32 a2_196;
		word32 a3_197;
		word32 a4_198;
		word32 a5_199;
		word32 a7_200;
		word32 s2_201;
		word32 s3_202;
		word32 s4_203;
		word32 s5_204;
		word32 s6_205;
		word32 s7_206;
		word32 s8_207;
		word32 s9_208;
		word32 s10_209;
		word32 s11_210;
		word32 t4_211;
		printf(ra, &g_t23072808, a3, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_193, out a0_194, out a1_195, out a2_196, out a3_197, out a4_198, out a5_199, out a7_200, out s2_201, out s3_202, out s4_203, out s5_204, out s6_205, out s7_206, out s8_207, out s9_208, out s10_209, out s11_210, out t4_211);
	}
}

// 23000562: Register Eq_2 get_dts_addr.part.2(Register Eq_2 ra, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      aos_loop_proc
Eq_2 get_dts_addr.part.2(Eq_2 ra, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s9Out, ptr32 & s10Out)
{
	if (g_t4200DE84 != 0x00)
	{
		word32 a5_85;
		xTaskGetTickCountFromISR(out a5_85);
	}
	else
	{
		word32 a5_84;
		xTaskGetTickCount(out a5_84);
	}
	ptr32 a5_31;
	ptr32 a3_36;
	ptr32 a4_37;
	ptr32 s10_41;
	ptr32 s2_43;
	ptr32 s3_44;
	ptr32 s4_45;
	ptr32 s6_47;
	ptr32 s9_50;
	word32 s1_86;
	word32 a0_87;
	word32 a1_88;
	word32 a2_89;
	word32 s5_90;
	word32 s7_91;
	word32 s8_92;
	word32 s11_93;
	Eq_2 ra_39 = bl_printk(ra, &g_t23072BDC, 587672516, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_86, out a0_87, out a1_88, out a2_89, out a3_36, out a4_37, out a5_31, out s2_43, out s3_44, out s4_45, out s5_90, out s6_47, out s7_91, out s8_92, out s9_50, out s10_41, out s11_93);
	a0Out = ~0x00;
	a3Out = a3_36;
	a4Out = a4_37;
	a5Out = a5_31;
	s2Out = s2_43;
	s3Out = s3_44;
	s4Out = s4_45;
	s6Out = s6_47;
	s9Out = s9_50;
	s10Out = s10_41;
	return ra_39;
}

