pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 230005AC: void client_demo.constprop.3(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58)
// Called from:
//      http_test_cmd
void client_demo.constprop.3(Eq_2 ra, Eq_2 s0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg58)
{
	struct Eq_274 * a0_285;
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg120 = <invalid>;
	Eq_2 stackArg184 = <invalid>;
	Eq_2 stackArg248 = <invalid>;
	Eq_2 stackArg264 = <invalid>;
	Eq_2 stackArg312 = <invalid>;
	Eq_2 stackArg328 = <invalid>;
	word32 a5_542;
	word32 a3_540;
	word32 a4_541;
	word32 s2_543;
	word32 s1_538;
	word32 a0_539;
	word32 s3_544;
	lwip_gethostbyname(ra, s0, a0, a3, mstatus, stackArg120, stackArg184, stackArg248, stackArg264, stackArg312, stackArg328, out s1_538, out a0_539, out a3_540, out a4_541, out a5_542, out s2_543, out s3_544);
	if (false)
		a0_285 = (struct Eq_274 *) &g_t230726C8;
	else
	{
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg52 = <invalid>;
		Eq_2 stackArg104 = <invalid>;
		Eq_2 stackArg168 = <invalid>;
		Eq_2 stackArg232 = <invalid>;
		Eq_2 stackArg248 = <invalid>;
		Eq_2 stackArg264 = <invalid>;
		Eq_2 stackArg296 = <invalid>;
		Eq_2 stackArg312 = <invalid>;
		Eq_2 stackArg328 = <invalid>;
		word32 s3_580;
		word32 s5_581;
		word32 a4_578;
		word32 s2_579;
		word32 a2_576;
		word32 a3_577;
		word32 a1_575;
		lwip_socket(ra, a1, a2, a3, mstatus, stackArg52, stackArg104, stackArg168, stackArg232, stackArg248, stackArg264, stackArg296, stackArg312, stackArg328, out a1_575, out a2_576, out a3_577, out a4_578, out s2_579, out s3_580, out s5_581);
		if (false)
			a0_285 = (struct Eq_274 *) &g_t230726E0;
		else
		{
			Eq_2 a3_37;
			word32 a4_586;
			word32 a5_587;
			word32 a1_584;
			word32 a2_585;
			word32 t1_582;
			word32 a0_583;
			Eq_2 ra_40 = memset(ra, fp + -304, 0x00, 0x10, out t1_582, out a0_583, out a1_584, out a2_585, out a3_37, out a4_586, out a5_587);
			word32 a5_588;
			lwip_htons(80, out a5_588);
			word32 a3_589;
			word32 a4_590;
			word32 a5_591;
			ip4addr_ntoa(out a3_589, out a4_590, out a5_591);
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			word32 s3_71;
			word32 s1_592;
			word32 a0_593;
			word32 a1_594;
			word32 a2_595;
			word32 a4_596;
			word32 a5_597;
			word32 a7_598;
			word32 s2_599;
			word32 s4_600;
			word32 s5_601;
			word32 s6_602;
			word32 s7_603;
			word32 s8_604;
			word32 s9_605;
			word32 s10_606;
			word32 s11_607;
			word32 t4_608;
			ra = printf(ra_40, &g_t230726F4, a3_37, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_592, out a0_593, out a1_594, out a2_595, out a3, out a4_596, out a5_597, out a7_598, out s2_599, out s3_71, out s4_600, out s5_601, out s6_602, out s7_603, out s8_604, out s9_605, out s10_606, out s11_607, out t4_608);
			Eq_2 stackArg52 = <invalid>;
			Eq_2 stackArg72 = <invalid>;
			Eq_2 stackArg136 = <invalid>;
			Eq_2 stackArg200 = <invalid>;
			word32 a0_613;
			word32 a1_614;
			word32 a2_615;
			word32 a3_616;
			word32 a4_617;
			word32 s2_618;
			word32 s3_619;
			word32 s4_620;
			lwip_connect(a0, a1, mstatus, stackArg52, stackArg72, stackArg136, stackArg200, out a0_613, out a1_614, out a2_615, out a3_616, out a4_617, out s2_618, out s3_619, out s4_620);
			if (s3_71 == 0x00)
			{
				word32 t1_621;
				word32 a0_622;
				word32 a1_623;
				word32 a2_624;
				word32 a3_625;
				word32 a4_626;
				word32 a5_627;
				Eq_2 ra_157 = memset(ra, fp + -0x00B0, 0x00, 0x0080, out t1_621, out a0_622, out a1_623, out a2_624, out a3_625, out a4_626, out a5_627);
				Eq_2 a4_100;
				Eq_2 a3_105;
				word32 a1_628;
				word32 a2_629;
				word32 a5_630;
				word32 a6_631;
				word32 a7_632;
				memcpy(fp + -288, 0x23072790, 111, out a1_628, out a2_629, out a3_105, out a4_100, out a5_630, out a6_631, out a7_632);
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				Eq_2 stackArg40 = <invalid>;
				Eq_2 stackArg104 = <invalid>;
				Eq_2 stackArg168 = <invalid>;
				word32 a3_636;
				word32 s8_637;
				lwip_write(a0, mstatus, stackArg40, stackArg104, stackArg168, out a3_636, out s8_637);
				Eq_2 a5_117;
				word32 a0_121;
				word32 s1_638;
				word32 a1_639;
				word32 a2_640;
				word32 a4_641;
				word32 a5_642;
				word32 a6_643;
				word32 s2_644;
				word32 s4_645;
				word32 s8_646;
				Eq_2 a3_124;
				int32 s3_131;
				pvPortMalloc(ra_157, xTaskGetTickCount(out a5_117), 0x03000000, a3_105, a4_100, a5_117, mstatus, dwLoc0100, dwLocFC, dwLocB4, s0, dwArg38, out s1_638, out a0_121, out a1_639, out a2_640, out a3_124, out a4_641, out a5_642, out a6_643, out s2_644, out s3_131, out s4_645, out s8_646);
				if (a0_121 != 0x00)
				{
					ui32 s4_138 = 0x00;
					int32 s0_139 = 0x00;
					word32 s8_140 = 0x23072000;
					int32 s6_141 = 82050000;
					while (true)
					{
						Eq_2 a2_217;
						Eq_2 a5_214;
						Eq_2 s5_228;
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						Eq_2 stackArg8 = <invalid>;
						Eq_2 stackArg20 = <invalid>;
						Eq_2 stackArg24 = <invalid>;
						Eq_2 stackArg40 = <invalid>;
						Eq_2 stackArg56 = <invalid>;
						Eq_2 stackArg88 = <invalid>;
						Eq_2 stackArg104 = <invalid>;
						Eq_2 stackArg136 = <invalid>;
						Eq_2 stackArg152 = <invalid>;
						Eq_2 stackArg312 = <invalid>;
						word32 s0_657;
						word32 a0_658;
						word32 a3_659;
						word32 s6_660;
						word32 mstatus_661;
						lwip_read(ra, s1, a0, a1, a2, s2, s3, s4, mstatus, stackArg8, stackArg20, stackArg24, stackArg40, stackArg56, stackArg88, stackArg104, stackArg136, stackArg152, stackArg312, out s0_657, out a0_658, out a3_659, out s6_660, out mstatus_661);
						if (s3_131 == 0x00)
							break;
						struct Eq_274 * a0_196;
						if (s3_131 < 0x00)
						{
							a0_196 = (struct Eq_274 *) &g_t2307272C;
							goto l23000718;
						}
						ui32 s7_149 = s4_138 + 1;
						s0_139 += s3_131;
						if ((s4_138 & 0x00FF) == 0x00)
						{
							word32 s1_723;
							word32 a0_724;
							word32 a1_725;
							word32 a2_726;
							word32 a4_727;
							word32 a5_728;
							word32 a7_729;
							word32 s2_730;
							word32 s4_731;
							word32 s5_732;
							word32 s9_733;
							word32 s10_734;
							word32 s11_735;
							word32 t4_736;
							ra_157 = printf(ra_157, s8_140 + 0x0744, a3_124, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_723, out a0_724, out a1_725, out a2_726, out a3_124, out a4_727, out a5_728, out a7_729, out s2_730, out s3_131, out s4_731, out s5_732, out s6_141, out s7_149, out s8_140, out s9_733, out s10_734, out s11_735, out t4_736);
						}
						if (s6_141 < s0_139)
						{
							word32 a5_737;
							xTaskGetTickCount(out a5_737);
							a0_196 = (struct Eq_274 *) &g_t2307275C;
l23000718:
							word32 s1_707;
							word32 a0_708;
							word32 a1_709;
							word32 a3_710;
							word32 a4_711;
							word32 a7_712;
							word32 s2_713;
							word32 s3_714;
							word32 s4_715;
							word32 s6_716;
							word32 s7_717;
							word32 s8_718;
							word32 s9_719;
							word32 s10_720;
							word32 s11_721;
							word32 t4_722;
							printf(ra_157, a0_196, a3_124, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_707, out a0_708, out a1_709, out a2_217, out a3_710, out a4_711, out a5_214, out a7_712, out s2_713, out s3_714, out s4_715, out s5_228, out s6_716, out s7_717, out s8_718, out s9_719, out s10_720, out s11_721, out t4_722);
							goto l230006F2;
						}
						s4_138 = s7_149;
					}
					word32 s1_662;
					word32 a0_663;
					word32 a1_664;
					word32 a3_665;
					word32 a4_666;
					word32 a7_667;
					word32 s2_668;
					word32 s3_669;
					word32 s4_670;
					word32 s6_671;
					word32 s7_672;
					word32 s8_673;
					word32 s9_674;
					word32 s10_675;
					word32 s11_676;
					word32 t4_677;
					printf(ra_157, &g_t23072724, a3_124, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_662, out a0_663, out a1_664, out a2_217, out a3_665, out a4_666, out a5_214, out a7_667, out s2_668, out s3_669, out s4_670, out s5_228, out s6_671, out s7_672, out s8_673, out s9_674, out s10_675, out s11_676, out t4_677);
l230006F2:
					word32 s0_678;
					word32 s1_679;
					word32 a0_680;
					word32 a1_681;
					word32 a2_682;
					word32 a3_683;
					word32 a4_684;
					word32 a5_685;
					word32 a6_686;
					word32 s4_687;
					word32 t3_688;
					vPortFree(s5_228, a2_217, a5_214, mstatus, dwArg18, dwArg58, out s0_678, out s1_679, out a0_680, out a1_681, out a2_682, out a3_683, out a4_684, out a5_685, out a6_686, out s4_687, out t3_688);
				}
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				Eq_2 stackArg72 = <invalid>;
				Eq_2 stackArg136 = <invalid>;
				Eq_2 stackArg184 = <invalid>;
				Eq_2 stackArg200 = <invalid>;
				Eq_2 stackArg216 = <invalid>;
				Eq_2 stackArg296 = <invalid>;
				word32 s1_695;
				word32 a0_696;
				word32 a1_697;
				word32 a2_698;
				word32 a3_699;
				word32 a4_700;
				word32 a5_701;
				word32 s2_702;
				word32 s3_703;
				word32 s4_704;
				word32 s5_705;
				word32 s6_706;
				lwip_close(ra, a0, a2, mstatus, stackArg72, stackArg136, stackArg184, stackArg200, stackArg216, stackArg296, out s1_695, out a0_696, out a1_697, out a2_698, out a3_699, out a4_700, out a5_701, out s2_702, out s3_703, out s4_704, out s5_705, out s6_706);
				return;
			}
			a0_285 = (struct Eq_274 *) &g_t23072710;
		}
	}
	word32 s6_557;
	word32 t4_563;
	word32 s7_558;
	word32 s8_559;
	word32 s10_561;
	word32 s11_562;
	word32 s9_560;
	word32 a4_550;
	word32 s5_556;
	word32 a5_551;
	word32 a7_552;
	word32 s3_554;
	word32 s4_555;
	word32 s2_553;
	word32 a1_547;
	word32 a2_548;
	word32 a0_546;
	word32 s1_545;
	word32 a3_549;
	printf(ra, a0_285, a3, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_545, out a0_546, out a1_547, out a2_548, out a3_549, out a4_550, out a5_551, out a7_552, out s2_553, out s3_554, out s4_555, out s5_556, out s6_557, out s7_558, out s8_559, out s9_560, out s10_561, out s11_562, out t4_563);
}

// 23000760: void http_test_cmd(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58)
void http_test_cmd(Eq_2 ra, Eq_2 s0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg58)
{
	client_demo.constprop.3(ra, s0, a3, mstatus, dwArg18, dwArg38, dwArg58);
}

// 23000762: void aos_loop_proc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a6, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack word32 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0114, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack word32 dwArg0154, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0174)
void aos_loop_proc(Eq_2 ra, Eq_2 s1, Eq_2 a6, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, word32 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0114, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, word32 dwArg0154, Eq_2 dwArg0158, Eq_2 dwArg0174)
{
	Eq_2 s9_173;
	Eq_2 s2_177;
	Eq_2 a3_24;
	Eq_2 s0_30;
	Eq_2 s1_31;
	Eq_2 s2_34;
	Eq_2 s3_35;
	Eq_2 a5_51;
	Eq_2 a4_83;
	Eq_2 a5_84;
	Eq_2 a3_88;
	Eq_2 s6_119;
	Eq_2 s10_164;
	Eq_2 ra_114 = vfs_device_init(vfs_init(easyflash_init(looprt_start(ra, s1, 0x420100E0, a6, mstatus, dwLoc1C, dwLoc08, dwArg20, dwArg24, ra, dwArgA8, dwArgE8, dwArg0128, dwArg0174, out s0_30, out s1_31, out a3_24, out s2_34, out s3_35), s0_30, s1_31, a3_24, loopset_led_hook_on_looprt(out a5_51), a5_51, s2_34, s3_35, mstatus, s2, dwLoc08, dwArg00, dwArg04, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg38, dwArg44, dwArg58, ra, dwArg78, dwArg7C, dwArg98, dwArgB8, dwArgD8, dwArgE8, dwArg0118, out s10_164), mstatus, dwLoc1C, s3, dwArgD8, dwArgE8, dwArg0118, dwArg0158, out a3_88, out a4_83, out a5_84), a3_88, a4_83, a5_84, mstatus, dwArg44, dwArg84, dwArgB8, dwArgF8, dwArg0138, out s6_119);
	Eq_2 a0_127 = hal_board_get_factory_addr();
	Eq_2 a0_133;
	word32 s5_946;
	word32 a5_943;
	word32 s3_945;
	word32 s2_944;
	word32 s0_942;
	Eq_2 s1_143;
	Eq_2 s4_146;
	Eq_2 s6_148;
	Eq_2 ra_141 = fdt_subnode_offset(ra_114, a0_127, a0_127, 0x23084680, 0x23084000, s6_119, s2, dwArg18, dwArgC8, out s0_942, out s1_143, out a0_133, out a5_943, out s2_944, out s3_945, out s4_146, out s5_946, out s6_148);
	if (a0_133 == 0x00)
	{
		word32 a0_155;
		word32 s3_951;
		word32 s2_950;
		word32 a5_949;
		word32 a4_948;
		word32 a3_947;
		ra_141 = get_dts_addr.part.2(ra_141, dwLoc08, dwArg40, dwArg44, s1, dwArg8C, out a0_155, out a3_947, out a4_948, out a5_949, out s2_950, out s3_951, out s4_146, out s6_148, out s9_173, out s10_164);
		s2_177.u0 = 0x00;
		if (a0_155 != 0x00)
		{
l230007C6:
			Eq_2 a3_256;
			Eq_2 a4_257;
			Eq_2 a5_258;
			Eq_2 s3_265;
			Eq_2 a0_220 = hal_board_get_factory_addr();
			word32 a0_231;
			word32 s5_955;
			word32 s6_956;
			word32 s4_954;
			word32 s3_953;
			word32 a5_952;
			Eq_2 s1_241;
			Eq_2 s2_242;
			Eq_2 s0_240;
			Eq_2 ra_239 = fdt_subnode_offset(ra_141, a0_220, a0_220, 0x23084C1C, s2_177, s6_148, s2, dwArg18, dwArgC8, out s0_240, out s1_241, out a0_231, out a5_952, out s2_242, out s3_953, out s4_954, out s5_955, out s6_956);
			if (a0_231 == 0x00)
			{
				word32 a0_253;
				word32 s6_958;
				word32 s4_957;
				ra_239 = get_dts_addr.part.2(ra_239, dwLoc08, dwArg40, dwArg44, s1, dwArg8C, out a0_253, out a3_256, out a4_257, out a5_258, out s2_242, out s3_265, out s4_957, out s6_958, out s9_173, out s10_164);
				if (a0_253 != 0x00)
				{
l230007F0:
					Eq_2 s2_338;
					ptr32 mstatus_362;
					Eq_2 s2_368;
					Eq_2 a0_387;
					ptr32 mstatus_411;
					word32 s2_960;
					word32 s3_961;
					word32 s6_962;
					word32 s0_959;
					Eq_2 a5_397;
					Eq_2 a4_396;
					Eq_2 a3_395;
					Eq_2 ra_412 = aos_open(aos_loop_init(romfs_register(ra_239, s0_240, a3_256, a4_257, a5_258, s2_242, s3_265, mstatus, dwLoc20, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg2C, dwArg3C, dwArg48, s3, ra, dwArg78, dwArg98, dwArgB8, dwArgBC, dwArgD8, dwArgF8, dwArg0108, dwArg0118, out s2_338), s2_338, mstatus, s2, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg18, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg58, dwArg7C, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0128, dwArg0138, out s2_368, out mstatus_362), 0x23072408, s2_368, mstatus_362, dwLoc1C, s3, s1, dwArgD8, dwArg0118, dwArg0158, out s0_959, out a0_387, out a3_395, out a4_396, out a5_397, out s2_960, out s3_961, out s6_962, out mstatus_411);
					if (a0_387 >= 0x00)
					{
						Eq_2 a5_417;
						Eq_2 a3_421;
						Eq_2 a4_422;
						Eq_2 s1_425;
						Eq_2 s6_432;
						Eq_2 s3_448;
						word32 s2_1000;
						word32 s11_996;
						word32 s0_998;
						word32 a1_999;
						word32 t4_997;
						word32 s7_992;
						word32 s9_994;
						word32 s10_995;
						word32 s8_993;
						word32 s2_988;
						word32 s4_990;
						word32 s5_991;
						word32 s3_989;
						word32 a0_984;
						word32 a2_986;
						word32 a7_987;
						word32 a1_985;
						ra_412 = aos_poll_read_fd(aos_cli_init(printf(ra_412, &g_t23072414, a3_395, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_425, out a0_984, out a1_985, out a2_986, out a3_421, out a4_422, out a5_417, out a7_987, out s2_988, out s3_989, out s4_990, out s5_991, out s6_432, out s7_992, out s8_993, out s9_994, out s10_995, out s11_996, out t4_997), s1_425, a3_421, a4_422, a5_417, mstatus_411, dwArg10, dwArg14, dwArg5C, dwArg0108, dwArg0148, out s3_448), a0_387, aos_cli_event_cb_read_get(), 305419896, s3_448, s6_432, mstatus_411, dwLoc10, dwLoc0C, dwArg20, dwArg24, dwArg48, ra, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_998, out a1_999, out a3_395, out a4_396, out a5_397, out s2_1000);
						codex_debug_cli_init();
						easyflash_cli_init();
						network_netutils_iperf_cli_register();
						network_netutils_tcpserver_cli_register();
						network_netutils_tcpclinet_cli_register();
						network_netutils_netstat_cli_register();
						network_netutils_ping_cli_register();
						sntp_cli_init();
						bl_sys_time_cli_init();
						bl_sys_ota_cli_init();
						blfdt_cli_init();
						wifi_mgmr_cli_init();
						bl_wdt_cli_init();
						bl_gpio_cli_init();
						looprt_test_cli_init();
					}
					word32 s2_963;
					word32 s3_964;
					aos_register_event_filter(ra_412, 0x23000D00, 0x00, a3_395, a4_396, a5_397, mstatus_411, dwArg10, dwArg14, dwArg18, dwArg5C, dwArg0108, dwArg0148, out s2_963, out s3_964);
					Eq_2 a0_533;
					Eq_2 a1_534;
					ptr32 mstatus_575;
					Eq_2 a3_562 = aos_loop_run(cmd_stack_wifi(ra_412, mstatus_411, dwLoc1C, dwLoc08, dwArg04, dwArg40, dwArg44, s1, dwArg8C, dwArgA8, dwArg0174, out a0_533, out a1_534), a0_533, a1_534, mstatus_411, s2, dwArg08, dwArg50, dwArg54, s1, dwArg78, dwArg88, dwArg9C, dwArgA8, dwArgD8, dwArg0118, dwArg0158, out mstatus_575);
					word32 a5_969;
					word32 s4_970;
					word32 s8_971;
					word32 a1_966;
					word32 a2_967;
					word32 a4_968;
					word32 a0_965;
					puts(587750240, out a0_965, out a1_966, out a2_967, out a4_968, out a5_969, out s4_970, out s8_971);
					word32 s8_978;
					word32 a4_975;
					word32 a5_976;
					word32 s4_977;
					word32 a1_973;
					word32 a2_974;
					word32 a0_972;
					puts(587670580, out a0_972, out a1_973, out a2_974, out a4_975, out a5_976, out s4_977, out s8_978);
					Eq_2 a5_614;
					Eq_2 a4_617;
					word32 s8_983;
					word32 s4_982;
					word32 a2_981;
					word32 a1_980;
					word32 a0_979;
					puts(587670628, out a0_979, out a1_980, out a2_981, out a4_617, out a5_614, out s4_982, out s8_983);
					vTaskDelete(0x00, dwArg48, a3_562, a4_617, a5_614, mstatus_575);
					return;
				}
				s1_241 = s0_240;
			}
			ra_239 = hal_gpio_init_from_dts(ra_239, s1_241, s2_242, s9_173, s10_164, mstatus, dwLoc20, dwLoc1C, dwLoc0C, dwLoc04, dwArg2C, dwArg38, dwArg44, dwArg48, dwArg60, s3, s1, dwArg78, dwArg88, dwArgB8, dwArg0154, out s0_240, out a3_256, out a4_257, out a5_258, out s2_242, out s3_265);
			goto l230007F0;
		}
		s1_143.u0 = 0x00;
	}
	ra_141 = vfs_uart_init(ra_141, s1_143, s1_143, a0_133, a0_133, s4_146, s6_148, s10_164, mstatus, dwArg08, dwArg28, dwArg38, dwArg48, dwArg78, dwArg88, dwArgF8, dwArg0114, out s2_177, out s6_148, out s9_173, out s10_164);
	goto l230007C6;
}

