pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 230008C2: void vApplicationStackOverflowHook(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
// Called from:
//      vTaskSwitchContext
void vApplicationStackOverflowHook(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	word32 a0_55;
	word32 a1_56;
	word32 a2_57;
	word32 a4_58;
	word32 a5_59;
	word32 s4_60;
	word32 s8_61;
	puts(0x23072DE0, out a0_55, out a1_56, out a2_57, out a4_58, out a5_59, out s4_60, out s8_61);
	word32 s1_62;
	word32 a0_63;
	word32 a1_64;
	word32 a2_65;
	word32 a3_66;
	word32 a4_67;
	word32 a5_68;
	word32 a7_69;
	word32 s2_70;
	word32 s3_71;
	word32 s4_72;
	word32 s5_73;
	word32 s6_74;
	word32 s7_75;
	word32 s8_76;
	word32 s9_77;
	word32 s10_78;
	word32 s11_79;
	word32 t4_80;
	printf(ra, &g_t23072DFC, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_62, out a0_63, out a1_64, out a2_65, out a3_66, out a4_67, out a5_68, out a7_69, out s2_70, out s3_71, out s4_72, out s5_73, out s6_74, out s7_75, out s8_76, out s9_77, out s10_78, out s11_79, out t4_80);
	while (true)
		;
}

// 230008E4: void vApplicationMallocFailedHook(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
// Called from:
//      pvPortMalloc
void vApplicationMallocFailedHook(Eq_2 ra, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	xPortGetFreeHeapSize();
	word32 s1_41;
	word32 a0_42;
	word32 a1_43;
	word32 a2_44;
	word32 a3_45;
	word32 a4_46;
	word32 a5_47;
	word32 a7_48;
	word32 s2_49;
	word32 s3_50;
	word32 s4_51;
	word32 s5_52;
	word32 s6_53;
	word32 s7_54;
	word32 s8_55;
	word32 s9_56;
	word32 s10_57;
	word32 s11_58;
	word32 t4_59;
	printf(ra, &g_t23072DA8, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_41, out a0_42, out a1_43, out a2_44, out a3_45, out a4_46, out a5_47, out a7_48, out s2_49, out s3_50, out s4_51, out s5_52, out s6_53, out s7_54, out s8_55, out s9_56, out s10_57, out s11_58, out t4_59);
	while (true)
		;
}

// 230008FC: Register int32 vApplicationIdleHook()
// Called from:
//      prvIdleTask
int32 vApplicationIdleHook()
{
	return g_dw4200D8F0;
}

// 23000906: Register Eq_2 check_dts_config(Register Eq_2 a0, Register Eq_2 a1, Register out ptr32 a3Out)
// Called from:
//      event_cb_wifi_event
Eq_2 check_dts_config(Eq_2 a0, Eq_2 a1, ptr32 & a3Out)
{
	ptr32 a3_22;
	Eq_2 a0_17 = bl_wifi_sta_info_get(fp + -116, out a3_22);
	Eq_2 s0_31 = ~0x00;
	if (a0_17 == 0x00)
	{
		word32 a5_96;
		word32 a4_95;
		word32 a3_94;
		strncpy(a0, fp + -116, 32, out a3_94, out a4_95, out a5_96);
		((word32) a0 + 31)->u1 = 0x00;
		word32 a4_97;
		word32 a5_98;
		strncpy(a1, fp + -83, 64, out a3_22, out a4_97, out a5_98);
		((word32) a1 + 63)->u1 = 0x00;
		s0_31 = a0_17;
	}
	a3Out = a3_22;
	return s0_31;
}

// 23000950: void _connect_wifi(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3)
// Called from:
//      event_cb_wifi_event
void _connect_wifi(Eq_2 ra, Eq_2 a0, Eq_2 a3)
{
	byte bLocFC = (byte) dwLocFC;
	Eq_2 a3_166;
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg4 = <invalid>;
	Eq_2 stackArg8 = <invalid>;
	Eq_2 stackArg56 = <invalid>;
	Eq_2 stackArg72 = <invalid>;
	Eq_2 stackArg80 = <invalid>;
	Eq_2 stackArg84 = <invalid>;
	Eq_2 stackArg116 = <invalid>;
	Eq_2 stackArg120 = <invalid>;
	Eq_2 stackArg136 = <invalid>;
	Eq_2 stackArg144 = <invalid>;
	Eq_2 stackArg148 = <invalid>;
	Eq_2 stackArg156 = <invalid>;
	Eq_2 stackArg168 = <invalid>;
	Eq_2 stackArg184 = <invalid>;
	Eq_2 stackArg200 = <invalid>;
	Eq_2 stackArg232 = <invalid>;
	Eq_2 stackArg248 = <invalid>;
	Eq_2 stackArg264 = <invalid>;
	Eq_2 stackArg360 = <invalid>;
	word32 mstatus_1138;
	word32 a1_1136;
	word32 s2_1137;
	wifi_mgmr_sta_enable(ra, s1, a3, s2, mstatus, stackArg4, stackArg8, stackArg56, stackArg72, stackArg80, stackArg84, stackArg116, stackArg120, stackArg136, stackArg144, stackArg148, stackArg156, stackArg168, stackArg184, stackArg200, stackArg232, stackArg248, stackArg264, stackArg360, out a1_1136, out s2_1137, out mstatus_1138);
	*a0 = 0x4200DC90;
	Eq_2 a1_32;
	word32 a0_1139;
	word32 a2_1140;
	word32 a4_1141;
	word32 a5_1142;
	aos_now_ms(a3, out a0_1139, out a1_32, out a2_1140, out a4_1141, out a5_1142);
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 s1_56;
	word32 a3_1200;
	word32 a4_1201;
	word32 a1_1205;
	word32 a3_1207;
	word32 a4_1208;
	word32 a5_1209;
	word32 a2_1206;
	word32 a5_1202;
	word32 a0_1204;
	word32 t1_1203;
	word32 t1_1189;
	word32 a0_1190;
	word32 a4_1194;
	word32 t1_1196;
	word32 a0_1197;
	word32 a1_1198;
	word32 a2_1199;
	word32 a5_1195;
	word32 a1_1191;
	word32 a3_1193;
	word32 a2_1192;
	word32 a2_1178;
	word32 a3_1179;
	word32 a0_1183;
	word32 a2_1185;
	word32 a3_1186;
	word32 a4_1187;
	word32 a5_1188;
	word32 a1_1184;
	word32 a4_1180;
	word32 t1_1182;
	word32 a5_1181;
	word32 a5_1167;
	word32 t1_1168;
	word32 a3_1172;
	word32 a5_1174;
	word32 t1_1175;
	word32 a0_1176;
	word32 a1_1177;
	word32 a4_1173;
	word32 a0_1169;
	word32 a2_1171;
	word32 a1_1170;
	word32 s8_1156;
	word32 s9_1157;
	word32 t1_1161;
	word32 a1_1163;
	word32 a2_1164;
	word32 a3_1165;
	word32 a4_1166;
	word32 a0_1162;
	word32 s10_1158;
	word32 t4_1160;
	word32 s11_1159;
	word32 a2_1145;
	word32 a3_1146;
	word32 s2_1150;
	word32 s4_1152;
	word32 s5_1153;
	word32 s6_1154;
	word32 s7_1155;
	word32 s3_1151;
	word32 a4_1147;
	word32 a7_1149;
	word32 a5_1148;
	word32 a1_1144;
	word32 a0_1143;
	Eq_2 ra_151 = memset(memset(memset(memset(memset(memset(memset(printf(ra, &g_t230720F8, a1_32, dwLoc0178, dwLoc0158, dwLoc0110, dwLoc010C, dwLocE8, dwLocC4, out s1_56, out a0_1143, out a1_1144, out a2_1145, out a3_1146, out a4_1147, out a5_1148, out a7_1149, out s2_1150, out s3_1151, out s4_1152, out s5_1153, out s6_1154, out s7_1155, out s8_1156, out s9_1157, out s10_1158, out s11_1159, out t4_1160), s1_56, 0x00, 66, out t1_1161, out a0_1162, out a1_1163, out a2_1164, out a3_1165, out a4_1166, out a5_1167), (char *) fp - 288, 0x00, 33, out t1_1168, out a0_1169, out a1_1170, out a2_1171, out a3_1172, out a4_1173, out a5_1174), (char *) fp - 0x00B8, 0x00, 66, out t1_1175, out a0_1176, out a1_1177, out a2_1178, out a3_1179, out a4_1180, out a5_1181), (char *) fp - 320, 0x00, 32, out t1_1182, out a0_1183, out a1_1184, out a2_1185, out a3_1186, out a4_1187, out a5_1188), (char *) fp - 340, 0x00, 0x06, out t1_1189, out a0_1190, out a1_1191, out a2_1192, out a3_1193, out a4_1194, out a5_1195), (char *) fp - 332, 0x00, 0x0A, out t1_1196, out a0_1197, out a1_1198, out a2_1199, out a3_1200, out a4_1201, out a5_1202), (char *) fp - 116, 0x00, 66, out t1_1203, out a0_1204, out a1_1205, out a2_1206, out a3_1207, out a4_1208, out a5_1209);
	Eq_2 stackArg8 = <invalid>;
	Eq_2 stackArg20 = <invalid>;
	Eq_2 stackArg88 = <invalid>;
	Eq_2 stackArg136 = <invalid>;
	Eq_2 stackArg200 = <invalid>;
	Eq_2 stackArg264 = <invalid>;
	word32 s1_1217;
	word32 s5_1221;
	word32 s10_1223;
	word32 s11_1224;
	word32 s9_1222;
	word32 a0_1218;
	word32 s4_1220;
	word32 s2_1219;
	ef_get_env_blob(ra, a0, a1, a3, s3, mstatus, stackArg8, stackArg20, stackArg88, stackArg136, stackArg200, stackArg264, out s1_1217, out a0_1218, out s2_1219, out s4_1220, out s5_1221, out s9_1222, out s10_1223, out s11_1224);
	Eq_2 s3_105 = (char *) fp - 320;
	if ((word32) bLoc74 == 0x00)
	{
		if (check_dts_config(fp + -288, fp + -0x00B8, out a3_166) != 0x00)
		{
			word32 a0_1495;
			word32 a1_1496;
			word32 a2_1497;
			word32 a4_1498;
			word32 a5_1499;
			word32 s4_1500;
			word32 s8_1501;
			puts(0x23072234, out a0_1495, out a1_1496, out a2_1497, out a4_1498, out a5_1499, out s4_1500, out s8_1501);
			word32 a0_1502;
			word32 a1_1503;
			word32 a2_1504;
			word32 a4_1505;
			word32 a5_1506;
			word32 s4_1507;
			word32 s8_1508;
			puts(0x2307224C, out a0_1502, out a1_1503, out a2_1504, out a4_1505, out a5_1506, out s4_1507, out s8_1508);
			word32 a0_1509;
			word32 a1_1510;
			word32 a2_1511;
			word32 a4_1512;
			word32 a5_1513;
			word32 s4_1514;
			word32 s8_1515;
			puts(0x23072298, out a0_1509, out a1_1510, out a2_1511, out a4_1512, out a5_1513, out s4_1514, out s8_1515);
			word32 a0_1516;
			word32 a1_1517;
			word32 a2_1518;
			word32 a4_1519;
			word32 a5_1520;
			word32 s4_1521;
			word32 s8_1522;
			puts(0x230722DC, out a0_1516, out a1_1517, out a2_1518, out a4_1519, out a5_1520, out s4_1521, out s8_1522);
			word32 a0_1523;
			word32 a1_1524;
			word32 a2_1525;
			word32 a4_1526;
			word32 a5_1527;
			word32 s4_1528;
			word32 s8_1529;
			puts(0x230722FC, out a0_1523, out a1_1524, out a2_1525, out a4_1526, out a5_1527, out s4_1528, out s8_1529);
			word32 a0_1530;
			word32 a1_1531;
			word32 a2_1532;
			word32 a4_1533;
			word32 a5_1534;
			word32 s4_1535;
			word32 s8_1536;
			puts(0x23072318, out a0_1530, out a1_1531, out a2_1532, out a4_1533, out a5_1534, out s4_1535, out s8_1536);
			return;
		}
l23000B88:
		word32 a0_1421;
		word32 a1_1422;
		word32 a2_1423;
		word32 a4_1424;
		word32 a5_1425;
		aos_now_ms(a3_166, out a0_1421, out a1_1422, out a2_1423, out a4_1424, out a5_1425);
		word32 a1_1426;
		word32 a2_1427;
		word32 a3_1428;
		word32 a4_1429;
		word32 a5_1430;
		strlen((char *) fp - 288, out a1_1426, out a2_1427, out a3_1428, out a4_1429, out a5_1430);
		Eq_2 a3_684;
		word32 a1_1431;
		word32 a2_1432;
		word32 a4_1433;
		word32 a5_1434;
		strlen((char *) fp - 0x00B8, out a1_1431, out a2_1432, out a3_684, out a4_1433, out a5_1434);
		word32 s1_1435;
		word32 a0_1436;
		word32 a1_1437;
		word32 a2_1438;
		word32 a3_1439;
		word32 a4_1440;
		word32 a5_1441;
		word32 a7_1442;
		word32 s2_1443;
		word32 s3_1444;
		word32 s4_1445;
		word32 s5_1446;
		word32 s6_1447;
		word32 s7_1448;
		word32 s8_1449;
		word32 s9_1450;
		word32 s10_1451;
		word32 s11_1452;
		word32 t4_1453;
		printf(ra_151, &g_t23072340, a3_684, dwLoc0178, dwLoc0158, dwLoc0110, dwLoc010C, dwLocE8, dwLocC4, out s1_1435, out a0_1436, out a1_1437, out a2_1438, out a3_1439, out a4_1440, out a5_1441, out a7_1442, out s2_1443, out s3_1444, out s4_1445, out s5_1446, out s6_1447, out s7_1448, out s8_1449, out s9_1450, out s10_1451, out s11_1452, out t4_1453);
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg24 = <invalid>;
		Eq_2 stackArg56 = <invalid>;
		Eq_2 stackArg88 = <invalid>;
		Eq_2 stackArg120 = <invalid>;
		Eq_2 stackArg132 = <invalid>;
		Eq_2 stackArg196 = <invalid>;
		wifi_mgmr_sta_connect(ra, a1, a2, a3, s2, mstatus, stackArg24, stackArg56, stackArg88, stackArg120, stackArg132, stackArg196);
		return;
	}
	word32 a5_1227;
	word32 a3_1225;
	word32 a4_1226;
	strncpy((char *) fp - 288, (char *) fp - 116, 32, out a3_1225, out a4_1226, out a5_1227);
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	word32 a2_1231;
	word32 a4_1233;
	word32 a5_1234;
	word32 a3_1232;
	word32 t1_1228;
	word32 a1_1230;
	word32 a0_1229;
	Eq_2 ra_276 = memset(ra_151, (char *) fp - 116, 0x00, 66, out t1_1228, out a0_1229, out a1_1230, out a2_1231, out a3_1232, out a4_1233, out a5_1234);
	Eq_2 stackArg8 = <invalid>;
	Eq_2 stackArg20 = <invalid>;
	Eq_2 stackArg88 = <invalid>;
	Eq_2 stackArg136 = <invalid>;
	Eq_2 stackArg200 = <invalid>;
	Eq_2 stackArg264 = <invalid>;
	word32 s11_1248;
	word32 s5_1245;
	word32 s10_1247;
	word32 s9_1246;
	word32 s1_1241;
	word32 a0_1242;
	word32 s2_1243;
	word32 s4_1244;
	ef_get_env_blob(ra, a0, a1, a3, s3, mstatus, stackArg8, stackArg20, stackArg88, stackArg136, stackArg200, stackArg264, out s1_1241, out a0_1242, out s2_1243, out s4_1244, out s5_1245, out s9_1246, out s10_1247, out s11_1248);
	if ((word32) bLoc74 != 0x00)
	{
		word32 a5_1251;
		word32 a4_1250;
		word32 a3_1249;
		strncpy((char *) fp - 0x00B8, (char *) fp - 116, 65, out a3_1249, out a4_1250, out a5_1251);
	}
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	word32 a4_1257;
	word32 a5_1258;
	word32 a1_1254;
	word32 a3_1256;
	word32 a2_1255;
	word32 a0_1253;
	word32 t1_1252;
	Eq_2 ra_308 = memset(ra_276, (char *) fp - 116, 0x00, 66, out t1_1252, out a0_1253, out a1_1254, out a2_1255, out a3_1256, out a4_1257, out a5_1258);
	Eq_2 stackArg8 = <invalid>;
	Eq_2 stackArg20 = <invalid>;
	Eq_2 stackArg88 = <invalid>;
	Eq_2 stackArg136 = <invalid>;
	Eq_2 stackArg200 = <invalid>;
	Eq_2 stackArg264 = <invalid>;
	word32 s11_1272;
	word32 s1_1265;
	word32 a0_1266;
	word32 s4_1268;
	word32 s5_1269;
	word32 s9_1270;
	word32 s10_1271;
	word32 s2_1267;
	ef_get_env_blob(ra, a0, a1, a3, s3, mstatus, stackArg8, stackArg20, stackArg88, stackArg136, stackArg200, stackArg264, out s1_1265, out a0_1266, out s2_1267, out s4_1268, out s5_1269, out s9_1270, out s10_1271, out s11_1272);
	Eq_2 a3_312 = 0x00;
	if ((word32) bLoc74 != 0x00)
	{
		word32 a5_1274;
		word32 a4_1273;
		strncpy(s1_56, (char *) fp - 116, 65, out a3_312, out a4_1273, out a5_1274);
	}
	if ((word32) bLocFC == 0x00)
	{
		Eq_2 a1_336;
		word32 a0_1275;
		word32 a4_1277;
		word32 a5_1278;
		word32 a2_1276;
		aos_now_ms(a3_312, out a0_1275, out a1_336, out a2_1276, out a4_1277, out a5_1278);
		word32 s6_1290;
		word32 s8_1292;
		word32 s9_1293;
		word32 s11_1295;
		word32 t4_1296;
		word32 s10_1294;
		word32 s7_1291;
		word32 a1_1281;
		word32 a3_1283;
		word32 a4_1284;
		word32 a7_1286;
		word32 s2_1287;
		word32 s4_1288;
		word32 s5_1289;
		word32 a5_1285;
		word32 a2_1282;
		word32 s1_1279;
		word32 a0_1280;
		ra_308 = printf(ra_308, &g_t23072184, a1_336, dwLoc0178, dwLoc0158, dwLoc0110, dwLoc010C, dwLocE8, dwLocC4, out s1_1279, out a0_1280, out a1_1281, out a2_1282, out a3_1283, out a4_1284, out a5_1285, out a7_1286, out s2_1287, out s3_105, out s4_1288, out s5_1289, out s6_1290, out s7_1291, out s8_1292, out s9_1293, out s10_1294, out s11_1295, out t4_1296);
		word32 a2_1299;
		word32 a5_1301;
		word32 s4_1302;
		word32 s8_1303;
		word32 a4_1300;
		word32 a0_1297;
		word32 a1_1298;
		puts(587669916, out a0_1297, out a1_1298, out a2_1299, out a4_1300, out a5_1301, out s4_1302, out s8_1303);
		word32 a5_1308;
		word32 a1_1304;
		word32 a2_1305;
		word32 a3_1306;
		word32 a4_1307;
		strlen((char *) fp - 288, out a1_1304, out a2_1305, out a3_1306, out a4_1307, out a5_1308);
		wifi_mgmr_psk_cal(ra, a0, a2);
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg0 = <invalid>;
		Eq_2 stackArg4 = <invalid>;
		Eq_2 stackArg8 = <invalid>;
		Eq_2 stackArg12 = <invalid>;
		Eq_2 stackArg16 = <invalid>;
		Eq_2 stackArg20 = <invalid>;
		Eq_2 stackArg24 = <invalid>;
		Eq_2 stackArg40 = <invalid>;
		Eq_2 stackArg48 = <invalid>;
		Eq_2 stackArg52 = <invalid>;
		Eq_2 stackArg56 = <invalid>;
		Eq_2 stackArg60 = <invalid>;
		Eq_2 stackArg64 = <invalid>;
		Eq_2 stackArg68 = <invalid>;
		Eq_2 stackArg76 = <invalid>;
		Eq_2 stackArg104 = <invalid>;
		Eq_2 stackArg116 = <invalid>;
		Eq_2 stackArg120 = <invalid>;
		Eq_2 stackArg124 = <invalid>;
		Eq_2 stackArg140 = <invalid>;
		Eq_2 stackArg168 = <invalid>;
		Eq_2 stackArg184 = <invalid>;
		Eq_2 stackArg200 = <invalid>;
		Eq_2 stackArg232 = <invalid>;
		Eq_2 stackArg296 = <invalid>;
		Eq_2 stackArg360 = <invalid>;
		ef_set_env(ra, a0, a1, s2, s3, s4, s5, s6, mstatus, stackArg0, stackArg4, stackArg8, stackArg12, stackArg16, stackArg20, stackArg24, stackArg40, stackArg48, stackArg52, stackArg56, stackArg60, stackArg64, stackArg68, stackArg76, stackArg104, stackArg116, stackArg120, stackArg124, stackArg140, stackArg168, stackArg184, stackArg200, stackArg232, stackArg296, stackArg360);
		ef_save_env();
	}
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	word32 a5_1342;
	word32 a4_1341;
	word32 a3_1340;
	word32 a2_1339;
	word32 a1_1338;
	word32 a0_1337;
	word32 t1_1336;
	Eq_2 ra_405 = memset(ra_308, (char *) fp - 116, 0x00, 66, out t1_1336, out a0_1337, out a1_1338, out a2_1339, out a3_1340, out a4_1341, out a5_1342);
	Eq_2 stackArg8 = <invalid>;
	Eq_2 stackArg20 = <invalid>;
	Eq_2 stackArg88 = <invalid>;
	Eq_2 stackArg136 = <invalid>;
	Eq_2 stackArg200 = <invalid>;
	Eq_2 stackArg264 = <invalid>;
	word32 s1_1349;
	word32 s2_1351;
	word32 a0_1350;
	word32 s5_1353;
	word32 s4_1352;
	word32 s10_1355;
	word32 s9_1354;
	word32 s11_1356;
	ef_get_env_blob(ra, a0, a1, a3, s3, mstatus, stackArg8, stackArg20, stackArg88, stackArg136, stackArg200, stackArg264, out s1_1349, out a0_1350, out s2_1351, out s4_1352, out s5_1353, out s9_1354, out s10_1355, out s11_1356);
	if ((word32) bLoc74 != 0x00)
	{
		Eq_2 a3_421;
		word32 a4_1460;
		word32 a5_1461;
