pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
		strncpy(fp + -332, fp + -116, 0x09, out a3_421, out a4_1460, out a5_1461);
		word32 s1_1462;
		word32 a0_1463;
		word32 a1_1464;
		word32 a2_1465;
		word32 a3_1466;
		word32 a4_1467;
		word32 a5_1468;
		word32 a7_1469;
		word32 s2_1470;
		word32 s4_1471;
		word32 s5_1472;
		word32 s6_1473;
		word32 s7_1474;
		word32 s8_1475;
		word32 s9_1476;
		word32 s10_1477;
		word32 s11_1478;
		word32 t4_1479;
		ra_405 = printf(ra_405, &g_t230721C4, a3_421, dwLoc0178, dwLoc0158, dwLoc0110, dwLoc010C, dwLocE8, dwLocC4, out s1_1462, out a0_1463, out a1_1464, out a2_1465, out a3_1466, out a4_1467, out a5_1468, out a7_1469, out s2_1470, out s3_105, out s4_1471, out s5_1472, out s6_1473, out s7_1474, out s8_1475, out s9_1476, out s10_1477, out s11_1478, out t4_1479);
		word32 a1_1480;
		word32 a2_1481;
		word32 a3_1482;
		word32 a4_1483;
		word32 a5_1484;
		word32 a0_458 = strchr(fp + -332, 0x007C, out a1_1480, out a2_1481, out a3_1482, out a4_1483, out a5_1484);
		if (a0_458 != 0x01)
		{
			char_to_hex((word32) *((word32) a0_458 + 1));
			word32 a1_1485;
			word32 a2_1486;
			word32 a3_1487;
			word32 a4_1488;
			word32 a5_1489;
			word32 a1_1490;
			word32 a2_1491;
			word32 a3_1492;
			word32 a4_1493;
			word32 a5_1494;
			word32 s0_487 = strlen(fp + -332, out a1_1485, out a2_1486, out a3_1487, out a4_1488, out a5_1489) - strlen(a0_458 + 1, out a1_1490, out a2_1491, out a3_1492, out a4_1493, out a5_1494);
			Mem491[fp + -48 + (s0_487 + -1) + 0x0EE4:byte] = 0x00;
			struct Eq_4129 * s5_466 = null;
			word32 s0_493 = s0_487 + (fp + -332);
			while (true)
			{
				s0_493 += ~0x00;
				if (s5_466 >= s0_487 + -1)
					break;
				char_to_hex((word32) s0_493->bFFFFFFFF);
				++s5_466;
			}
l23000B04:
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			word32 t1_1357;
			word32 a1_1359;
			word32 a0_1358;
			word32 a2_1360;
			word32 a3_1361;
			word32 a4_1362;
			word32 a5_1363;
			ra_151 = memset(ra_405, (char *) fp - 116, 0x00, 66, out t1_1357, out a0_1358, out a1_1359, out a2_1360, out a3_1361, out a4_1362, out a5_1363);
			Eq_2 stackArg8 = <invalid>;
			Eq_2 stackArg20 = <invalid>;
			Eq_2 stackArg88 = <invalid>;
			Eq_2 stackArg136 = <invalid>;
			Eq_2 stackArg200 = <invalid>;
			Eq_2 stackArg264 = <invalid>;
			word32 s1_1370;
			word32 a0_1371;
			word32 s2_1372;
			word32 s4_1373;
			word32 s5_1374;
			word32 s9_1375;
			word32 s10_1376;
			word32 s11_1377;
			ef_get_env_blob(ra, a0, a1, a3, s3, mstatus, stackArg8, stackArg20, stackArg88, stackArg136, stackArg200, stackArg264, out s1_1370, out a0_1371, out s2_1372, out s4_1373, out s5_1374, out s9_1375, out s10_1376, out s11_1377);
			a3_166.u0 = 0x00;
			if ((word32) bLoc74 != 0x00)
			{
				Eq_2 a3_555;
				word32 a4_1378;
				word32 a5_1379;
				strncpy(s3_105, (char *) fp - 116, 0x1F, out a3_555, out a4_1378, out a5_1379);
				Eq_2 s3_577;
				word32 s1_1380;
				word32 a0_1381;
				word32 a1_1382;
				word32 a2_1383;
				word32 a3_1384;
				word32 a4_1385;
				word32 a5_1386;
				word32 a7_1387;
				word32 s2_1388;
				word32 s4_1389;
				word32 s5_1390;
				word32 s6_1391;
				word32 s7_1392;
				word32 s8_1393;
				word32 s9_1394;
				word32 s10_1395;
				word32 s11_1396;
				word32 t4_1397;
				Eq_2 ra_572 = printf(ra_151, &g_t230721F0, a3_555, dwLoc0178, dwLoc0158, dwLoc0110, dwLoc010C, dwLocE8, dwLocC4, out s1_1380, out a0_1381, out a1_1382, out a2_1383, out a3_1384, out a4_1385, out a5_1386, out a7_1387, out s2_1388, out s3_577, out s4_1389, out s5_1390, out s6_1391, out s7_1392, out s8_1393, out s9_1394, out s10_1395, out s11_1396, out t4_1397);
				word32 a1_1398;
				word32 a2_1399;
				word32 a3_1400;
				word32 a4_1401;
				word32 a5_1402;
				Eq_2 a0_587 = strlen(s3_577, out a1_1398, out a2_1399, out a3_1400, out a4_1401, out a5_1402);
				Eq_2 s0_594 = a0_587;
				if ((a0_587 & 1) != 0x00)
					s0_594 = a0_587 - (a0_587 | 0x02);
				if (s0_594 != 0x00)
				{
					Eq_2 s8_600 = s3_577;
					Eq_2 s7_601 = 0x00;
					while (s7_601 < s0_594)
					{
						s8_600 = (word32) s8_600 + 2;
						Mem624[(s7_601 >>u 0x01) + (fp + -48) + 0x0EDC:byte] = SLICE((char_to_hex((word32) *s8_600) << 4) + char_to_hex((word32) (*((word32) s8_600 - 1))), byte, 0);
						s7_601 = (word32) s7_601 + 2;
					}
				}
				word32 s1_1403;
				word32 a0_1404;
				word32 a1_1405;
				word32 a2_1406;
				word32 a4_1407;
				word32 a5_1408;
				word32 a7_1409;
				word32 s2_1410;
				word32 s3_1411;
				word32 s4_1412;
				word32 s5_1413;
				word32 s6_1414;
				word32 s7_1415;
				word32 s8_1416;
				word32 s9_1417;
				word32 s10_1418;
				word32 s11_1419;
				word32 t4_1420;
				ra_151 = printf(ra_572, &g_t2307220C, (word32) bLoc0152, dwLoc0178, dwLoc0158, dwLoc0110, dwLoc010C, dwLocE8, dwLocC4, out s1_1403, out a0_1404, out a1_1405, out a2_1406, out a3_166, out a4_1407, out a5_1408, out a7_1409, out s2_1410, out s3_1411, out s4_1412, out s5_1413, out s6_1414, out s7_1415, out s8_1416, out s9_1417, out s10_1418, out s11_1419, out t4_1420);
			}
			goto l23000B88;
		}
	}
	goto l23000B04;
}

// 23000D00: void event_cb_wifi_event(Register Eq_2 ra, Register (ptr32 Eq_4260) a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void event_cb_wifi_event(Eq_2 ra, struct Eq_4260 * a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	if ((word32) (word16) ((word32) a0->w0006 + -1) > 22)
	{
		Eq_2 a1_18;
		word32 a0_281;
		word32 a2_282;
		word32 a4_283;
		word32 a5_284;
		aos_now_ms(a3, out a0_281, out a1_18, out a2_282, out a4_283, out a5_284);
		word32 s1_333;
		word32 a0_334;
		word32 a1_335;
		word32 a2_336;
		word32 a3_337;
		word32 a4_338;
		word32 a5_339;
		word32 a7_340;
		word32 s2_341;
		word32 s3_342;
		word32 s4_343;
		word32 s5_344;
		word32 s6_345;
		word32 s7_346;
		word32 s8_347;
		word32 s9_348;
		word32 s10_349;
		word32 s11_350;
		word32 t4_351;
		printf(ra, &g_t23072BA0, a1_18, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_333, out a0_334, out a1_335, out a2_336, out a3_337, out a4_338, out a5_339, out a7_340, out s2_341, out s3_342, out s4_343, out s5_344, out s6_345, out s7_346, out s8_347, out s9_348, out s10_349, out s11_350, out t4_351);
	}
	else
	{
		switch ((word32) (word16) (a0->w0006 + -1))
		{
		case 0x00:
			Eq_2 a1_131;
			word32 a0_285;
			word32 a2_286;
			word32 a4_287;
			word32 a5_288;
			Eq_2 s0_135 = aos_now_ms(a3, out a0_285, out a1_131, out a2_286, out a4_287, out a5_288);
			Eq_2 a3_146;
			word32 s1_289;
			word32 a0_290;
			word32 a1_291;
			word32 a2_292;
			word32 a4_293;
			word32 a5_294;
			word32 a7_295;
			word32 s2_296;
			word32 s3_297;
			word32 s4_298;
			word32 s5_299;
			word32 s6_300;
			word32 s7_301;
			word32 s8_302;
			word32 s9_303;
			word32 s10_304;
			word32 s11_305;
			word32 t4_306;
			Eq_2 ra_149 = printf(ra, &g_t230728C0, a1_131, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_289, out a0_290, out a1_291, out a2_292, out a3_146, out a4_293, out a5_294, out a7_295, out s2_296, out s3_297, out s4_298, out s5_299, out s6_300, out s7_301, out s8_302, out s9_303, out s10_304, out s11_305, out t4_306);
			wifi_mgmr_start_background(ra_149, s0_135, 0x4200D8E8, a3_146, mstatus, dwArg00, dwArg04, dwArg0C, dwArg10, dwArg14, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg38, dwArg44, dwArg48, dwArg4C, dwArg5C, dwArg60, dwArg64, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148);
			return;
		case 0x01:
			word32 a0_307;
			word32 a1_308;
			word32 a2_309;
			word32 a4_310;
			word32 a5_311;
			aos_now_ms(a3, out a0_307, out a1_308, out a2_309, out a4_310, out a5_311);
			Eq_2 a3_73;
			word32 a1_312;
			word32 a2_313;
			word32 a4_314;
			word32 a5_315;
			bl_timer_now_us(out a1_312, out a2_313, out a3_73, out a4_314, out a5_315);
			0x00 = (uint16) dwArg64;
			Eq_2 a0_87;
			Eq_2 a3_92;
			word32 s1_316;
			word32 a1_317;
			word32 a2_318;
			word32 a4_319;
			word32 a5_320;
			word32 a7_321;
			word32 s2_322;
			word32 s3_323;
			word32 s4_324;
			word32 s5_325;
			word32 s6_326;
			word32 s7_327;
			word32 s8_328;
			word32 s9_329;
			word32 s10_330;
			word32 s11_331;
			word32 t4_332;
			Eq_2 ra_95 = printf(ra, &g_t230728E0, a3_73, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_316, out a0_87, out a1_317, out a2_318, out a3_92, out a4_319, out a5_320, out a7_321, out s2_322, out s3_323, out s4_324, out s5_325, out s6_326, out s7_327, out s8_328, out s9_329, out s10_330, out s11_331, out t4_332);
			_connect_wifi(ra_95, a0_87, a3_92);
			return;
		}
	}
}

// 23000FCC: Register int32 vApplicationGetIdleTaskMemory(Register ptr32 a0, Register ptr32 a1, Register ptr32 a2)
// Called from:
//      vTaskStartScheduler
int32 vApplicationGetIdleTaskMemory(ptr32 a0, ptr32 a1, ptr32 a2)
{
	g_ptr4201091C = a0;
	g_ptr4201015C = a1;
	*(ptr32 *) 96 = a2;
	return 96;
}

