pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 23000FE8: Register int32 vApplicationGetTimerTaskMemory(Register ptr32 a0, Register ptr32 a1, Register ptr32 a2)
// Called from:
//      xTimerCreateTimerTask
int32 vApplicationGetTimerTaskMemory(ptr32 a0, ptr32 a1, ptr32 a2)
{
	g_ptr4201097C = a0;
	g_ptr420102DC = a1;
	*(ptr32 *) 400 = a2;
	return 400;
}

// 23001004: Register word32 vAssertCalled(Register Eq_2 a4, Register ptr32 mstatus, Register out (ptr32 Eq_4556) a5Out)
// Called from:
//      xEventGroupCreateStatic
//      xEventGroupWaitBits
//      xEventGroupSetBits
//      vEventGroupDelete
//      xQueueGenericReset
//      xQueueGenericCreateStatic
//      xQueueGenericCreate
//      xQueueCreateCountingSemaphore
//      xQueueGenericSend
//      xQueueGiveMutexRecursive
//      xQueueGenericSendFromISR
//      xQueueGiveFromISR
//      xQueueReceive
//      xQueueSemaphoreTake
//      xQueueTakeMutexRecursive
//      uxQueueMessagesWaiting
//      prvInitialiseNewStreamBuffer
//      prvWriteBytesToBuffer
//      prvReadBytesFromBuffer
//      xStreamBufferGenericCreate
//      xStreamBufferGenericCreateStatic
//      vStreamBufferDelete
//      xStreamBufferSpacesAvailable
//      xStreamBufferSend
//      xStreamBufferSendFromISR
//      xStreamBufferReceive
//      xStreamBufferReceiveFromISR
//      xStreamBufferIsEmpty
//      prvDeleteTCB
//      xTaskCreateStatic
//      eTaskGetState
//      vTaskStartScheduler
//      pcTaskGetName
//      xTaskIncrementTick
//      xTaskResumeAll
//      vTaskDelay
//      vTaskSwitchContext
//      vTaskPlaceOnEventList
//      vTaskPlaceOnUnorderedEventList
//      vTaskPlaceOnEventListRestricted
//      xTaskRemoveFromEventList
//      vTaskRemoveFromUnorderedEventList
//      vTaskSetTimeOutState
//      xTaskCheckForTimeOut
//      xTaskPriorityDisinherit
//      vTaskPriorityDisinheritAfterTimeout
//      xTaskGenericNotify
//      xTaskGenericNotifyFromISR
//      vTaskNotifyGiveFromISR
//      xTimerCreateTimerTask
//      xTimerCreateStatic
//      xTimerGenericCommand
//      prvSwitchTimerLists
//      prvTimerTask
//      pvTimerGetTimerID
//      xPortStartScheduler
//      pvPortMalloc
//      vPortFree
//      vPortDefineHeapRegions
//      sys_sem_free
//      iperf_server_udp
//      aos_task_exit
word32 vAssertCalled(Eq_2 a4, ptr32 mstatus, struct Eq_4556 & a5Out)
{
	__csrrc(mstatus, 0x08);
	do
		;
	while (a4 != 0x01);
	a5Out = (struct Eq_4556 *) 0x01;
	return dwArgB4;
}

// 2300101C: void bfl_main(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Register ptr32 fcsr, Register ptr32 mstatus, Register ptr32 misa, Register ptr32 mie, Register ptr32 mtvec, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0134, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0154, Stack Eq_2 dwArg0174)
// Called from:
//      bl602_start
void bfl_main(Eq_2 ra, Eq_2 s1, Eq_2 s2, ptr32 fcsr, ptr32 mstatus, ptr32 misa, ptr32 mie, ptr32 mtvec, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0134, Eq_2 dwArg0138, Eq_2 dwArg0154, Eq_2 dwArg0174)
{
	word32 a5_903;
	word32 a4_902;
	word32 a3_901;
	word32 a2_900;
	word32 a1_899;
	g_t4200EC8C = bl_timer_now_us(out a1_899, out a2_900, out a3_901, out a4_902, out a5_903);
	word32 s8_907;
	word32 s2_906;
	word32 a1_905;
	word32 s1_904;
	Eq_2 ra_41 = bl_uart_init(0x00, 0x10, 0x07, 2000000, out s1_904, out a1_905, out s2_906, out s8_907);
	word32 s8_914;
	word32 s4_913;
	word32 a5_912;
	word32 a4_911;
	word32 a2_910;
	word32 a1_909;
	word32 a0_908;
	puts(587670676, out a0_908, out a1_909, out a2_910, out a4_911, out a5_912, out s4_913, out s8_914);
	word32 s8_921;
	word32 s4_920;
	word32 a5_919;
	word32 a4_918;
	word32 a2_917;
	word32 a1_916;
	word32 a0_915;
	puts(587670704, out a0_915, out a1_916, out a2_917, out a4_918, out a5_919, out s4_920, out s8_921);
	Eq_2 a0_80 = bl_chip_banner(fp + -60);
	if (a0_80 == 0x00)
	{
		word32 a0_1158;
		word32 a1_1159;
		word32 a2_1160;
		word32 a4_1161;
		word32 a5_1162;
		word32 s4_1163;
		word32 s8_1164;
		puts(a0_80, out a0_1158, out a1_1159, out a2_1160, out a4_1161, out a5_1162, out s4_1163, out s8_1164);
	}
	word32 s8_928;
	word32 s4_927;
	word32 a5_926;
	word32 a4_925;
	word32 a2_924;
	word32 a1_923;
	word32 a0_922;
	puts(0x230727FC, out a0_922, out a1_923, out a2_924, out a4_925, out a5_926, out s4_927, out s8_928);
	word32 s8_935;
	word32 s4_934;
	word32 a5_933;
	word32 a4_932;
	word32 a2_931;
	word32 a1_930;
	word32 a0_929;
	puts(0x230727FC, out a0_929, out a1_930, out a2_931, out a4_932, out a5_933, out s4_934, out s8_935);
	word32 s8_942;
	word32 s4_941;
	word32 a5_940;
	word32 a4_939;
	word32 a2_938;
	word32 a1_937;
	word32 a0_936;
	puts(587720660, out a0_936, out a1_937, out a2_938, out a4_939, out a5_940, out s4_941, out s8_942);
	word32 s8_949;
	word32 s4_948;
	word32 a5_947;
	word32 a4_946;
	word32 a2_945;
	word32 a1_944;
	word32 a0_943;
	int32 s0_154 = bl_chip_info(ra_41, puts(587670728, out a0_943, out a1_944, out a2_945, out a4_946, out a5_947, out s4_948, out s8_949), fp + -56, misa);
	word32 a0_950;
	word32 a1_951;
	word32 a2_952;
	word32 a4_953;
	word32 a5_954;
	word32 s4_955;
	word32 s8_956;
	puts(fp + -56, out a0_950, out a1_951, out a2_952, out a4_953, out a5_954, out s4_955, out s8_956);
	word32 a0_957;
	word32 a1_958;
	word32 a2_959;
	word32 a4_960;
	word32 a5_961;
	word32 s4_962;
	word32 s8_963;
	puts(s0_154 + 2044, out a0_957, out a1_958, out a2_959, out a4_960, out a5_961, out s4_962, out s8_963);
	word32 a0_964;
	word32 a1_965;
	word32 a2_966;
	word32 a4_967;
	word32 a5_968;
	word32 s4_969;
	word32 s8_970;
	puts(587670752, out a0_964, out a1_965, out a2_966, out a4_967, out a5_968, out s4_969, out s8_970);
	word32 a0_971;
	word32 a1_972;
	word32 a2_973;
	word32 a4_974;
	word32 a5_975;
	word32 s4_976;
	word32 s8_977;
	puts(587670768, out a0_971, out a1_972, out a2_973, out a4_974, out a5_975, out s4_976, out s8_977);
	word32 a0_978;
	word32 a1_979;
	word32 a2_980;
	word32 a4_981;
	word32 a5_982;
	word32 s4_983;
	word32 s8_984;
	puts(s0_154 + 2044, out a0_978, out a1_979, out a2_980, out a4_981, out a5_982, out s4_983, out s8_984);
	word32 a0_985;
	word32 a1_986;
	word32 a2_987;
	word32 a4_988;
	word32 a5_989;
	word32 s4_990;
	word32 s8_991;
	puts(587670812, out a0_985, out a1_986, out a2_987, out a4_988, out a5_989, out s4_990, out s8_991);
	word32 a0_992;
	word32 a1_993;
	word32 a2_994;
	word32 a4_995;
	word32 a5_996;
	word32 s4_997;
	word32 s8_998;
	puts(587670828, out a0_992, out a1_993, out a2_994, out a4_995, out a5_996, out s4_997, out s8_998);
	word32 a0_999;
	word32 a1_1000;
	word32 a2_1001;
	word32 a4_1002;
	word32 a5_1003;
	word32 s4_1004;
	word32 s8_1005;
	puts(s0_154 + 2044, out a0_999, out a1_1000, out a2_1001, out a4_1002, out a5_1003, out s4_1004, out s8_1005);
	word32 a0_1006;
	word32 a1_1007;
	word32 a2_1008;
	word32 a4_1009;
	word32 a5_1010;
	word32 s4_1011;
	word32 s8_1012;
	puts(0x23072544, out a0_1006, out a1_1007, out a2_1008, out a4_1009, out a5_1010, out s4_1011, out s8_1012);
	word32 a0_1013;
	word32 a1_1014;
	word32 a2_1015;
	word32 a4_1016;
	word32 a5_1017;
	word32 s4_1018;
	word32 s8_1019;
	puts(587670868, out a0_1013, out a1_1014, out a2_1015, out a4_1016, out a5_1017, out s4_1018, out s8_1019);
	word32 a0_1020;
	word32 a1_1021;
	word32 a2_1022;
	word32 a4_1023;
	word32 a5_1024;
	word32 s4_1025;
	word32 s8_1026;
	puts(s0_154 + 2044, out a0_1020, out a1_1021, out a2_1022, out a4_1023, out a5_1024, out s4_1025, out s8_1026);
	word32 a0_1027;
	word32 a1_1028;
	word32 a2_1029;
	word32 a4_1030;
	word32 a5_1031;
	word32 s4_1032;
	word32 s8_1033;
	puts(587670876, out a0_1027, out a1_1028, out a2_1029, out a4_1030, out a5_1031, out s4_1032, out s8_1033);
	word32 a0_1034;
	word32 a1_1035;
	word32 a2_1036;
	word32 a4_1037;
	word32 a5_1038;
	word32 s4_1039;
	word32 s8_1040;
	puts(587670892, out a0_1034, out a1_1035, out a2_1036, out a4_1037, out a5_1038, out s4_1039, out s8_1040);
	word32 a0_1041;
	word32 a1_1042;
	word32 a2_1043;
	word32 a4_1044;
	word32 a5_1045;
	word32 s4_1046;
	word32 s8_1047;
	puts(s0_154 + 2044, out a0_1041, out a1_1042, out a2_1043, out a4_1044, out a5_1045, out s4_1046, out s8_1047);
	word32 a0_1048;
	word32 a1_1049;
	word32 a2_1050;
	word32 a4_1051;
	word32 a5_1052;
	word32 s4_1053;
	word32 s8_1054;
	puts(0x23072578, out a0_1048, out a1_1049, out a2_1050, out a4_1051, out a5_1052, out s4_1053, out s8_1054);
	word32 a0_1055;
	word32 a1_1056;
	word32 a2_1057;
	word32 a4_1058;
	word32 a5_1059;
	word32 s4_1060;
	word32 s8_1061;
	puts(0x23072588, out a0_1055, out a1_1056, out a2_1057, out a4_1058, out a5_1059, out s4_1060, out s8_1061);
	Eq_2 a4_366;
	word32 a0_1062;
	word32 a1_1063;
	word32 a2_1064;
	word32 a4_1065;
	word32 a5_1066;
	word32 s4_1067;
	word32 s8_1068;
	word32 a0_1069;
	word32 a1_1070;
	word32 a2_1071;
	word32 a5_1072;
	word32 s4_1073;
	word32 s8_1074;
	puts((word32) puts(s0_154 + 2044, out a0_1062, out a1_1063, out a2_1064, out a4_1065, out a5_1066, out s4_1067, out s8_1068) + 2004, out a0_1069, out a1_1070, out a2_1071, out a4_366, out a5_1072, out s4_1073, out s8_1074);
	vPortDefineHeapRegions(s0_154, &g_t4200CEDC, a4_366, mstatus, dwArgE8);
	Eq_2 a3_407;
	word32 s1_1075;
	word32 a0_1076;
	word32 a1_1077;
	word32 a2_1078;
	word32 a4_1079;
	word32 a5_1080;
	word32 a7_1081;
	word32 s2_1082;
	word32 s3_1083;
	word32 s4_1084;
	word32 s5_1085;
	word32 s6_1086;
	word32 s7_1087;
	word32 s8_1088;
	word32 s9_1089;
	word32 s10_1090;
	word32 s11_1091;
	word32 t4_1092;
	word32 s1_1093;
	word32 a0_1094;
	word32 a1_1095;
	word32 a2_1096;
	word32 a3_1097;
	word32 a4_1098;
	word32 a5_1099;
	word32 a7_1100;
	word32 s2_1101;
	word32 s3_1102;
	word32 s4_1103;
	word32 s5_1104;
	word32 s6_1105;
	word32 s7_1106;
	word32 s8_1107;
	word32 s9_1108;
	word32 s10_1109;
	word32 s11_1110;
	word32 t4_1111;
	Eq_2 ra_458 = blog_init(printf(printf(ra_41, &g_t23072594, 0x00FFF860, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1075, out a0_1076, out a1_1077, out a2_1078, out a3_407, out a4_1079, out a5_1080, out a7_1081, out s2_1082, out s3_1083, out s4_1084, out s5_1085, out s6_1086, out s7_1087, out s8_1088, out s9_1089, out s10_1090, out s11_1091, out t4_1092), &g_t230725A8, a3_407, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1093, out a0_1094, out a1_1095, out a2_1096, out a3_1097, out a4_1098, out a5_1099, out a7_1100, out s2_1101, out s3_1102, out s4_1103, out s5_1104, out s6_1105, out s7_1106, out s8_1107, out s9_1108, out s10_1109, out s11_1110, out t4_1111), s2, dwArg20, dwArg24, dwArg48, dwArg6C);
	bl_irq_init();
	Eq_2 a3_486;
	Eq_2 a3_514;
	Eq_2 a4_515;
	Eq_2 a5_516;
	Eq_2 s1_519;
	Eq_2 s0_543;
	Eq_2 s6_551;
	Eq_2 s1_568;
	Eq_2 s10_569;
	Eq_2 s2_571;
	Eq_2 s4_573;
	Eq_2 s6_575;
	Eq_2 s8_577;
	Eq_2 s9_578;
	ptr32 gp_592;
	Eq_2 ra_593 = hal_board_cfg(hal_boot2_init(bl_dma_init(bl_sec_test(bl_sec_init(ra_458, mstatus, dwLoc3C, dwLoc38, s2, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg38, dwArg3C, dwArg44, dwArg48, dwArg4C, ra, dwArg6C, dwArgB8, dwArgC8, dwArgF8, dwArg0138, out a3_486), a3_486, s2, dwArg20, dwArg24, dwArg48, dwArg6C, out s1_519, out a3_514, out a4_515, out a5_516), s1_519, a3_514, a4_515, a5_516, mstatus, dwLoc40, dwLoc3C, dwLoc38, dwLoc20, dwLoc1C, dwLoc18, dwLoc10, dwLoc0C, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg38, dwArg3C, ra, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0118, out s0_543, out s6_551), s6_551, dwLoc34, s2, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg18, dwArg20, dwArg24, dwArg28, dwArg3C, dwArg48, dwArg4C, dwArg6C, dwArgD8, out s1_568, out s2_571, out s4_573, out s6_575, out s8_577, out s9_578, out s10_569), s0_543, s1_568, s2_571, s4_573, s6_575, s8_577, s9_578, s10_569, mstatus, dwLoc38, dwLoc34, s2, dwLoc18, dwArg54, dwArg94, dwArgB4, out gp_592);
	word32 a0_1112;
	word32 a1_1113;
	word32 a2_1114;
	word32 a4_1115;
	word32 a5_1116;
	word32 s4_1117;
	word32 s8_1118;
	puts(587670976, out a0_1112, out a1_1113, out a2_1114, out a4_1115, out a5_1116, out s4_1117, out s8_1118);
	word32 tp_1119;
	word32 t0_1120;
	word32 s0_1121;
	word32 a0_1122;
	word32 a2_1123;
	word32 a3_1124;
	word32 a4_1125;
	word32 a5_1126;
	word32 s2_1127;
	Eq_2 ra_649 = xTaskCreateStatic(ra_593, &g_ptr23000462, 0x230725EC, 0x0200, 0x00, 0x0F, 0x4200F080, 0x4200F880, mstatus, dwLoc3C, dwLoc1C, dwArgA8, dwArg0174, out tp_1119, out t0_1120, out s0_1121, out a0_1122, out a2_1123, out a3_1124, out a4_1125, out a5_1126, out s2_1127);
	word32 a0_1128;
	word32 a1_1129;
	word32 a2_1130;
	word32 a4_1131;
	word32 a5_1132;
	word32 s4_1133;
	word32 s8_1134;
	puts(587671028, out a0_1128, out a1_1129, out a2_1130, out a4_1131, out a5_1132, out s4_1133, out s8_1134);
	word32 tp_1135;
	word32 t0_1136;
	word32 s0_1137;
	word32 a0_1138;
	word32 a2_1139;
	word32 a3_1140;
	word32 a4_1141;
	word32 a5_1142;
	word32 s2_1143;
	Eq_2 ra_694 = xTaskCreateStatic(ra_649, &g_ptr23000762, 587671068, 0x0400, 0x00, 0x0F, 0x4200E020, 0x4200F020, mstatus, dwLoc3C, dwLoc1C, dwArgA8, dwArg0174, out tp_1135, out t0_1136, out s0_1137, out a0_1138, out a2_1139, out a3_1140, out a4_1141, out a5_1142, out s2_1143);
	word32 a0_1144;
	word32 a1_1145;
	word32 a2_1146;
	word32 a4_1147;
	word32 a5_1148;
	word32 s4_1149;
	word32 s8_1150;
	puts(0x23072628, out a0_1144, out a1_1145, out a2_1146, out a4_1147, out a5_1148, out s4_1149, out s8_1150);
	Eq_2 a6_723;
	Eq_2 ra_725 = tcpip_init(ra_694, mstatus, dwLoc2C, s2, dwArg00, dwArg28, dwArg4C, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgE8, dwArg0108, out a6_723);
	word32 a0_1151;
	word32 a1_1152;
	word32 a2_1153;
	word32 a4_1154;
	word32 a5_1155;
	word32 s4_1156;
	word32 s8_1157;
	puts(587671112, out a0_1151, out a1_1152, out a2_1153, out a4_1154, out a5_1155, out s4_1156, out s8_1157);
	vTaskStartScheduler(ra_725, gp_592, a6_723, fcsr, mstatus, mie, mtvec, dwLoc3C, dwArg04, dwArg24, dwArg68, dwArg88, dwArg98, dwArg0134, dwArg0154);
}

// 2300126A: void ShadowUpdateStatusCallback(Register Eq_2 ra, Register word32 a2, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void ShadowUpdateStatusCallback(Eq_2 ra, word32 a2, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	struct Eq_274 * a0_11;
	g_b4200EC98 = 0x00;
	if (a2 == 0x00)
		a0_11 = (struct Eq_274 *) &g_t23072E0C;
	else if (a2 == 0x01)
		a0_11 = (struct Eq_274 *) &g_t23072E20;
	else
	{
		if (a2 != 0x02)
			return;
		a0_11 = (struct Eq_274 *) &g_t23072E34;
	}
	word32 s1_96;
	word32 a0_97;
	word32 a1_98;
	word32 a2_99;
	word32 a3_100;
	word32 a4_101;
	word32 a5_102;
	word32 a7_103;
	word32 s2_104;
	word32 s3_105;
	word32 s4_106;
	word32 s5_107;
	word32 s6_108;
	word32 s7_109;
	word32 s8_110;
	word32 s9_111;
	word32 s10_112;
	word32 s11_113;
	word32 t4_114;
	printf(ra, a0_11, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_96, out a0_97, out a1_98, out a2_99, out a3_100, out a4_101, out a5_102, out a7_103, out s2_104, out s3_105, out s4_106, out s5_107, out s6_108, out s7_109, out s8_110, out s9_111, out s10_112, out s11_113, out t4_114);
}

