pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 230012A2: void windowActuate_Callback(Register Eq_2 ra, Register word32 a2, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void windowActuate_Callback(Eq_2 ra, word32 a2, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	if (a2 == 0x00)
		return;
	word32 s1_81;
	word32 a0_82;
	word32 a1_83;
	word32 a2_84;
	word32 a3_85;
	word32 a4_86;
	word32 a5_87;
	word32 a7_88;
	word32 s2_89;
	word32 s3_90;
	word32 s4_91;
	word32 s5_92;
	word32 s6_93;
	word32 s7_94;
	word32 s8_95;
	word32 s9_96;
	word32 s10_97;
	word32 s11_98;
	word32 t4_99;
	printf(ra, &g_t2307429C, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_81, out a0_82, out a1_83, out a2_84, out a3_85, out a4_86, out a5_87, out a7_88, out s2_89, out s3_90, out s4_91, out s5_92, out s6_93, out s7_94, out s8_95, out s9_96, out s10_97, out s11_98, out t4_99);
}

// 230012B8: void aws_main_entry(Register Eq_2 ra, Register (ptr32 Eq_5611) a0, Register real32 fs0, Register real32 fs1, Register Eq_5614 fa0, Register real32 fs2, Register real32 fs3, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus)
void aws_main_entry(Eq_2 ra, struct Eq_5611 * a0, real32 fs0, real32 fs1, Eq_5614 fa0, real32 fs2, real32 fs3, ptr32 fflags, ptr32 frm, ptr32 mstatus)
{
	Eq_2 a3_1084;
	Eq_2 ra_1087;
	Eq_2 dwLoc0D1C_3272;
	a0->r1F30 = fs0;
	a0->r1F20 = fs1;
	a0->r1F10 = fs2;
	a0->r1F00 = fs3;
	word32 a3_3443;
	word32 a2_3442;
	word32 a1_3441;
	word32 a6_3446;
	word32 a5_3445;
	word32 a7_3447;
	word32 a4_3444;
	memcpy(fp + -3360, 587758084, 0x1C, out a1_3441, out a2_3442, out a3_3443, out a4_3444, out a5_3445, out a6_3446, out a7_3447);
	word32 a5_3452;
	word32 a7_3454;
	word32 a3_3450;
	word32 a1_3448;
	word32 a6_3453;
	word32 a4_3451;
	word32 a2_3449;
	memcpy(fp + -0x0D58, 587758068, 0x10, out a1_3448, out a2_3449, out a3_3450, out a4_3451, out a5_3452, out a6_3453, out a7_3454);
	Eq_2 dwLoc0D54_2151 = 0x230012A2;
	Eq_2 dwLoc0D58_2155 = 0x01;
	Eq_2 dwLoc0D50_2157 = fp + ~0x0D5B;
	word16 wLoc0D4E_2473 = SLICE(fp + ~0x0D5B, word16, 16);
	word32 s1_112;
	Eq_2 s2_115;
	Eq_2 a0_128;
	word32 s0_131;
	Eq_2 a3_136;
	ptr32 mstatus_152;
	word32 a4_3472;
	word32 s9_3468;
	word32 s5_3464;
	word32 s3_3462;
	word32 a1_3456;
	word32 a0_3455;
	word32 s6_3476;
	word32 s2_3474;
	word32 s11_3470;
	word32 s7_3466;
	word32 a7_3461;
	word32 a4_3459;
	word32 a2_3457;
	word32 a5_3460;
	word32 s3_3475;
	word32 a5_3473;
	word32 t4_3471;
	word32 s10_3469;
	word32 s8_3467;
	word32 s6_3465;
	word32 s4_3463;
	word32 a3_3458;
	Eq_2 ra_153 = aos_open(printf(ra, &g_t23072E80, 0x01, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_112, out a0_3455, out a1_3456, out a2_3457, out a3_3458, out a4_3459, out a5_3460, out a7_3461, out s2_115, out s3_3462, out s4_3463, out s5_3464, out s6_3465, out s7_3466, out s8_3467, out s9_3468, out s10_3469, out s11_3470, out t4_3471), s1_112 + -348, s2_115, mstatus, dwLoc0D6C, dwLoc0CEC, 0x00, dwLoc0C78, dwLoc0C38, dwLoc0BF8, out s0_131, out a0_128, out a3_136, out a4_3472, out a5_3473, out s2_3474, out s3_3475, out s6_3476, out mstatus_152);
	struct Eq_5763 * dwLoc0D60_2593 = (uint32) nLoc0D60;
	Eq_2 dwLoc0D28_2675 = SEQ(nLoc0D27, 0x06);
	Eq_2 dwLoc0D3C_2399 = SEQ(nLoc0D3B, 0x08);
	if (a0_128 < 0x00)
	{
		Eq_2 a3_924;
		Eq_2 a3_952;
		Eq_2 a3_979;
		Eq_2 a0_1013;
		word32 t4_3552;
		word32 s10_3550;
		word32 s8_3548;
		word32 s6_3546;
		word32 s5_3527;
		word32 s1_3499;
		word32 s9_3513;
		word32 s11_3515;
		word32 s10_3514;
		word32 s8_3512;
		word32 s7_3511;
		word32 s6_3510;
		word32 s4_3508;
		word32 s3_3507;
		word32 s2_3506;
		word32 a5_3504;
		word32 a4_3503;
		word32 a2_3502;
		word32 a1_3501;
		word32 s10_3496;
		word32 s11_3551;
		word32 s9_3549;
		word32 s7_3547;
		word32 s9_3531;
		word32 s10_3532;
		word32 s11_3533;
		word32 t4_3534;
		word32 a1_3536;
		word32 a2_3537;
		word32 a3_3538;
		word32 a5_3540;
		word32 a7_3541;
		word32 s2_3542;
		word32 s4_3544;
		word32 s5_3545;
		word32 s3_3543;
		word32 a4_3539;
		word32 s1_3535;
		word32 s8_3530;
		word32 s6_3528;
		word32 s7_3529;
		word32 s1_3517;
		word32 a0_3518;
		word32 a1_3519;
		word32 a4_3521;
		word32 a5_3522;
		word32 a7_3523;
		word32 s3_3525;
		word32 s4_3526;
		word32 s2_3524;
		word32 a2_3520;
		word32 t4_3516;
		word32 a1_3483;
		word32 a2_3484;
		word32 a5_3486;
		word32 a7_3487;
		word32 s4_3490;
		word32 s5_3491;
		word32 s6_3492;
		word32 s9_3495;
		word32 s7_3493;
		word32 s3_3489;
		word32 a4_3485;
		word32 s8_3494;
		word32 s2_3488;
		word32 a0_3482;
		word32 s1_3481;
		word32 t4_3498;
		word32 s11_3497;
		word32 a0_3500;
		word32 a7_3505;
		word32 s5_3509;
		Eq_2 ra_1021 = printf(printf(printf(printf(ra_153, &g_t23072EB8, a3_136, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_3481, out a0_3482, out a1_3483, out a2_3484, out a3_924, out a4_3485, out a5_3486, out a7_3487, out s2_3488, out s3_3489, out s4_3490, out s5_3491, out s6_3492, out s7_3493, out s8_3494, out s9_3495, out s10_3496, out s11_3497, out t4_3498), &g_t23072F08, a3_924, dwLoc0D68, 0x23072ED8, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_3499, out a0_3500, out a1_3501, out a2_3502, out a3_952, out a4_3503, out a5_3504, out a7_3505, out s2_3506, out s3_3507, out s4_3508, out s5_3509, out s6_3510, out s7_3511, out s8_3512, out s9_3513, out s10_3514, out s11_3515, out t4_3516), &g_t23072F14, a3_952, dwLoc0D68, 0x23072ED8, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_3517, out a0_3518, out a1_3519, out a2_3520, out a3_979, out a4_3521, out a5_3522, out a7_3523, out s2_3524, out s3_3525, out s4_3526, out s5_3527, out s6_3528, out s7_3529, out s8_3530, out s9_3531, out s10_3532, out s11_3533, out t4_3534), &g_t23073F7C, a3_979, dwLoc0D68, 0x23072ED8, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_3535, out a0_1013, out a1_3536, out a2_3537, out a3_3538, out a4_3539, out a5_3540, out a7_3541, out s2_3542, out s3_3543, out s4_3544, out s5_3545, out s6_3546, out s7_3547, out s8_3548, out s9_3549, out s10_3550, out s11_3551, out t4_3552);
		word32 a2_3554;
		word32 a3_3555;
		word32 a4_3556;
		word32 a5_3557;
		word32 a1_3553;
		word16 wLoc0D50_2401 = (word16) strlen(a0_1013, out a1_3553, out a2_3554, out a3_3555, out a4_3556, out a5_3557);
		Eq_2 a3_1045;
		word32 a1_3558;
		word32 a2_3559;
		word32 a4_3560;
		word32 a5_3561;
		strlen(587677548, out a1_3558, out a2_3559, out a3_1045, out a4_3560, out a5_3561);
		dwLoc0D48.u0 = 0x23072ED8;
		dwLoc0CC4.u0 = 0x23072F24;
		dwLoc0D3C_2399.u0 = 0x00;
		Eq_2 a3_1058;
		word32 t4_3597;
		word32 s11_3596;
		word32 s7_3592;
		word32 s6_3573;
		word32 s8_3593;
		word32 s9_3594;
		word32 s10_3595;
		word32 s10_3577;
		word32 s11_3578;
		word32 t4_3579;
		word32 s1_3580;
		word32 a1_3582;
		word32 a2_3583;
		word32 a4_3584;
		word32 a7_3586;
		word32 s2_3587;
		word32 s3_3588;
		word32 s5_3590;
		word32 s6_3591;
		word32 s4_3589;
		word32 a5_3585;
		word32 a0_3581;
		word32 s7_3574;
		word32 s8_3575;
		word32 s9_3576;
		word32 a0_3563;
		word32 a1_3564;
		word32 a2_3565;
		word32 a5_3567;
		word32 a7_3568;
		word32 s2_3569;
		word32 s4_3571;
		word32 s5_3572;
		word32 s3_3570;
		word32 a4_3566;
		word32 s1_3562;
		ra_1087 = printf(printf(ra_1021, &g_t23073F90, a3_1045, dwLoc0D68, 0x23072ED8, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_3562, out a0_3563, out a1_3564, out a2_3565, out a3_1058, out a4_3566, out a5_3567, out a7_3568, out s2_3569, out s3_3570, out s4_3571, out s5_3572, out s6_3573, out s7_3574, out s8_3575, out s9_3576, out s10_3577, out s11_3578, out t4_3579), &g_t23073FA8, a3_1058, dwLoc0D68, 0x23072ED8, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_3580, out a0_3581, out a1_3582, out a2_3583, out a3_1084, out a4_3584, out a5_3585, out a7_3586, out s2_3587, out s3_3588, out s4_3589, out s5_3590, out s6_3591, out s7_3592, out s8_3593, out s9_3594, out s10_3595, out s11_3596, out t4_3597);
		dwLoc0D50_2157 = SEQ(wLoc0D4E_2473, wLoc0D50_2401);
		dwLoc0D1C_3272 = SEQ(wLoc0D1A, 0x01BB);
	}
	else
	{
		word32 a0_3478;
		word32 s0_3477;
		word32 a1_3479;
		word32 a3_3480;
		Eq_2 ra_171 = aos_ioctl(ra_153, a0_128, 0x01, s0_131 + 812 + (fp + 0x00FFEFD0), fp + -3424, dwLoc0D70, dwLoc0D2C, out s0_3477, out a0_3478, out a1_3479, out a3_3480);
		Eq_2 s0_173 = 0x00;
		while (true)
		{
			word32 a5_180 = CONVERT(Mem101[dwLoc0BBC + s0_173:byte], byte, word32);
			if (a5_180 == 0x0A || a5_180 == 0x0D)
				break;
			s0_173 = (word32) s0_173 + 1;
		}
		Eq_2 a5_195;
		Eq_2 a3_199;
		Eq_2 a4_200;
		Eq_2 s1_203;
		word32 a2_3639;
		word32 a7_3640;
		word32 s2_3641;
		word32 s3_3642;
		word32 a1_3638;
		word32 a0_3637;
		word32 s4_3643;
		word32 s5_3644;
		word32 s11_3650;
		word32 t4_3651;
		word32 s9_3648;
		word32 s10_3649;
		word32 s6_3645;
		word32 s7_3646;
		word32 s8_3647;
		Eq_2 ra_202 = printf(ra_171, &g_t23073FC0, dwLoc0BBC, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_203, out a0_3637, out a1_3638, out a2_3639, out a3_199, out a4_200, out a5_195, out a7_3640, out s2_3641, out s3_3642, out s4_3643, out s5_3644, out s6_3645, out s7_3646, out s8_3647, out s9_3648, out s10_3649, out s11_3650, out t4_3651);
		Eq_2 a0_219;
		word32 s1_227;
		word32 a1_3652;
		word32 a2_3653;
		word32 a4_3655;
		word32 a5_3656;
		word32 a6_3657;
		word32 s3_3659;
		word32 s4_3660;
		word32 s8_3661;
		word32 s2_3658;
		word32 a3_3654;
		Eq_2 s0_226 = pvPortMalloc(ra_202, s1_203, s0_173, a3_199, a4_200, a5_195, mstatus_152, dwLoc0D30, dwLoc0D2C, dwLoc0CE4, dwLoc0C38, dwLoc0BF8, out s1_227, out a0_219, out a1_3652, out a2_3653, out a3_3654, out a4_3655, out a5_3656, out a6_3657, out s2_3658, out s3_3659, out s4_3660, out s8_3661);
		if (a0_219 == 0x00)
		{
			word32 a1_3687;
			word32 a7_3688;
			word32 s7_3694;
			word32 s8_3695;
			word32 s9_3696;
			word32 s10_3697;
			word32 t4_3699;
			word32 s11_3698;
			word32 s5_3692;
			word32 s6_3693;
			word32 s2_3689;
			word32 s3_3690;
			word32 s4_3691;
			word32 s1_3685;
			word32 a0_3686;
			Eq_2 a5_872;
			Eq_2 a4_877;
			Eq_2 a3_876;
			Eq_2 a2_875;
			printf(ra_202, &g_t23073FD0, fp + 0x00FFEFD0, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_3685, out a0_3686, out a1_3687, out a2_875, out a3_876, out a4_877, out a5_872, out a7_3688, out s2_3689, out s3_3690, out s4_3691, out s5_3692, out s6_3693, out s7_3694, out s8_3695, out s9_3696, out s10_3697, out s11_3698, out t4_3699);
			while (true)
			{
				word32 s1_3700;
				word32 a0_3701;
				word32 s2_3703;
				word32 s3_3704;
				word32 s4_3705;
				word32 s8_3706;
				word32 a1_3702;
				vTaskDelay(1000, a2_875, a3_876, a4_877, a5_872, mstatus_152, dwLoc0D4C, dwLoc0D48, dwLoc0C38, dwLoc0BF8, out s1_3700, out a0_3701, out a1_3702, out a2_875, out a3_876, out a4_877, out a5_872, out s2_3703, out s3_3704, out s4_3705, out s8_3706);
			}
		}
		struct Eq_6344 * a5_245;
		Eq_2 a3_249;
		word32 a6_3665;
		word32 a7_3666;
		word32 a2_3663;
		word32 a4_3664;
		word32 a1_3662;
		memcpy(a0_219, s1_227 - s0_226, s0_226, out a1_3662, out a2_3663, out a3_249, out a4_3664, out a5_245, out a6_3665, out a7_3666);
		((word32) s0_226 + a5_245->dw0310)->u1 = 0x00;
		word32 a5_3672;
		word32 a7_3673;
		word32 s2_3674;
		word32 s3_3675;
		word32 s5_3677;
		word32 s6_3678;
		word32 s7_3679;
		word32 s9_3681;
		word32 s10_3682;
		word32 s11_3683;
		word32 t4_3684;
		word32 s8_3680;
		word32 s4_3676;
		word32 a3_3670;
		word32 a4_3671;
		word32 a0_3667;
		word32 a1_3668;
		word32 a2_3669;
		struct Eq_6385 * s1_274;
		Eq_2 ra_273 = printf(ra_202, &g_t23072F08, a3_249, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_274, out a0_3667, out a1_3668, out a2_3669, out a3_3670, out a4_3671, out a5_3672, out a7_3673, out s2_3674, out s3_3675, out s4_3676, out s5_3677, out s6_3678, out s7_3679, out s8_3680, out s9_3681, out s10_3682, out s11_3683, out t4_3684);
		while (true)
		{
			word32 a5_291 = (word32) s1_274->t0000;
			if (a5_291 != 0x0A && a5_291 != 0x0D)
				break;
			++s1_274;
		}
		Eq_2 s0_296 = 0x00;
		while (true)
		{
			word32 a5_303 = CONVERT(Mem263[s1_274 + s0_296:byte], byte, word32);
			if (a5_303 == 0x0A || a5_303 == 0x0D)
				break;
			s0_296 = (word32) s0_296 + 1;
		}
		Eq_2 a3_326;
		word32 s2_333;
		word32 a1_3709;
		word32 a2_3710;
		word32 s5_3716;
		word32 s6_3717;
		word32 s7_3718;
		word32 s8_3719;
		word32 s10_3721;
		word32 s11_3722;
		word32 t4_3723;
		word32 s9_3720;
		word32 s3_3714;
		word32 s4_3715;
		word32 a4_3711;
		word32 a5_3712;
		word32 a7_3713;
		word32 s1_3707;
		word32 a0_3708;
		Eq_2 ra_329 = printf(ra_273, &g_t23073FE0, 0x0A, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_3707, out a0_3708, out a1_3709, out a2_3710, out a3_326, out a4_3711, out a5_3712, out a7_3713, out s2_333, out s3_3714, out s4_3715, out s5_3716, out s6_3717, out s7_3718, out s8_3719, out s9_3720, out s10_3721, out s11_3722, out t4_3723);
		if (s0_296 > 0x05)
		{
			word32 s5_3731;
			word32 s6_3732;
			word32 t4_3738;
			word32 s10_3736;
			word32 s11_3737;
			word32 s7_3733;
			word32 s8_3734;
			word32 s9_3735;
			word32 a0_3725;
			word32 a1_3726;
			word32 a7_3727;
			word32 s3_3729;
			word32 s4_3730;
			word32 s2_3728;
			word32 s1_3724;
			Eq_2 a5_347;
			Eq_2 a4_352;
			Eq_2 a3_351;
			Eq_2 a2_350;
			printf(ra_329, &g_t23073FF0, a3_326, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_3724, out a0_3725, out a1_3726, out a2_350, out a3_351, out a4_352, out a5_347, out a7_3727, out s2_3728, out s3_3729, out s4_3730, out s5_3731, out s6_3732, out s7_3733, out s8_3734, out s9_3735, out s10_3736, out s11_3737, out t4_3738);
			while (true)
			{
				word32 a1_3932;
				word32 s2_3933;
				word32 s3_3934;
				word32 s4_3935;
				word32 s8_3936;
				word32 s1_3930;
				word32 a0_3931;
				vTaskDelay(1000, a2_350, a3_351, a4_352, a5_347, mstatus_152, dwLoc0D4C, dwLoc0D48, dwLoc0C38, dwLoc0BF8, out s1_3930, out a0_3931, out a1_3932, out a2_350, out a3_351, out a4_352, out a5_347, out s2_3933, out s3_3934, out s4_3935, out s8_3936);
			}
		}
		word32 a1_3739;
		word32 a2_3740;
		word32 a3_3741;
		word32 a5_3743;
		word32 a6_3744;
		word32 a7_3745;
		word32 a4_3742;
		memcpy(fp + ~0x0C3B, s2_333 - s0_296, s0_296, out a1_3739, out a2_3740, out a3_3741, out a4_3742, out a5_3743, out a6_3744, out a7_3745);
		(word32) s0_296 + (fp + ~0x102F) + 1012 = (int32) 0x00;
		Eq_2 a3_425;
		struct Eq_6596 * a5_427;
		word32 a2_3747;
		word32 a4_3748;
		word32 a1_3746;
		a5_427->w0314 = (word16) atoi(fp + ~0x0C3B, out a1_3746, out a2_3747, out a3_425, out a4_3748, out a5_427);
		struct Eq_6619 * a4_449;
		word32 a3_3753;
		word32 a5_3754;
		word32 s7_3760;
		word32 s8_3761;
		word32 s9_3762;
		word32 s10_3763;
		word32 t4_3765;
		word32 s11_3764;
		word32 s5_3758;
		word32 s6_3759;
		word32 a7_3755;
		word32 s3_3756;
		word32 s4_3757;
		word32 s1_3749;
		word32 a1_3751;
		word32 a2_3752;
		word32 a0_3750;
		byte * s2_455;
		Eq_2 ra_451 = printf(ra_329, &g_t23072F14, a3_425, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_3749, out a0_3750, out a1_3751, out a2_3752, out a3_3753, out a4_449, out a5_3754, out a7_3755, out s2_455, out s3_3756, out s4_3757, out s5_3758, out s6_3759, out s7_3760, out s8_3761, out s9_3762, out s10_3763, out s11_3764, out t4_3765);
		a4_449->dw031C = 0x23072F24;
		a4_449->dw0320 = 0x23073404;
		a4_449->dw0318 = 587676336;
		a4_449->b0324 = 0x00;
		a4_449->dw0328 = 0x00;
		while (true)
		{
			word32 a5_481 = (word32) *s2_455;
			if (a5_481 != 0x0A && a5_481 != 0x0D)
				break;
			++s2_455;
		}
		Eq_2 s0_486 = 0x00;
		while (true)
		{
			word32 a5_493 = CONVERT(Mem476[s2_455 + s0_486:byte], byte, word32);
			if (a5_493 == 0x0A || a5_493 == 0x0D)
				break;
			s0_486 = (word32) s0_486 + 1;
		}
		Eq_2 a5_512;
		Eq_2 a3_516;
		Eq_2 a4_517;
		Eq_2 s1_520;
		word32 s7_3775;
		word32 s8_3776;
		word32 t4_3780;
		word32 s9_3777;
		word32 s10_3778;
		word32 s11_3779;
		word32 a0_3766;
		word32 a1_3767;
		word32 a7_3769;
		word32 s2_3770;
		word32 s3_3771;
		word32 s5_3773;
		word32 s6_3774;
		word32 s4_3772;
		word32 a2_3768;
		Eq_2 ra_519 = printf(ra_451, &g_t23074000, 0x0A, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_520, out a0_3766, out a1_3767, out a2_3768, out a3_516, out a4_517, out a5_512, out a7_3769, out s2_3770, out s3_3771, out s4_3772, out s5_3773, out s6_3774, out s7_3775, out s8_3776, out s9_3777, out s10_3778, out s11_3779, out t4_3780);
		Eq_2 a0_542;
		word32 s1_550;
		word32 a2_3782;
		word32 a3_3783;
		word32 a4_3784;
		word32 a5_3785;
		word32 s2_3787;
		word32 s3_3788;
		word32 s4_3789;
		word32 s8_3790;
		word32 a6_3786;
		word32 a1_3781;
		Eq_2 s0_549 = pvPortMalloc(ra_519, s1_520, s0_486, a3_516, a4_517, a5_512, mstatus_152, dwLoc0D30, dwLoc0D2C, dwLoc0CE4, dwLoc0C38, dwLoc0BF8, out s1_550, out a0_542, out a1_3781, out a2_3782, out a3_3783, out a4_3784, out a5_3785, out a6_3786, out s2_3787, out s3_3788, out s4_3789, out s8_3790);
		dwLoc0D54_2151 = a0_542;
		if (a0_542 == 0x00)
		{
			word32 a1_3819;
			word32 a7_3820;
			word32 s7_3826;
			word32 s8_3827;
			word32 s9_3828;
			word32 s10_3829;
			word32 t4_3831;
			word32 s11_3830;
			word32 s5_3824;
			word32 s6_3825;
			word32 s2_3821;
			word32 s3_3822;
			word32 s4_3823;
			word32 s1_3817;
			word32 a0_3818;
			Eq_2 a5_824;
			Eq_2 a4_829;
			Eq_2 a3_828;
			Eq_2 a2_827;
			printf(ra_519, &g_t23074014, fp + 0x00FFEFD0, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_3817, out a0_3818, out a1_3819, out a2_827, out a3_828, out a4_829, out a5_824, out a7_3820, out s2_3821, out s3_3822, out s4_3823, out s5_3824, out s6_3825, out s7_3826, out s8_3827, out s9_3828, out s10_3829, out s11_3830, out t4_3831);
			while (true)
			{
				word32 s1_3832;
				word32 a0_3833;
				word32 s2_3835;
				word32 s3_3836;
				word32 s4_3837;
				word32 s8_3838;
				word32 a1_3834;
				vTaskDelay(1000, a2_827, a3_828, a4_829, a5_824, mstatus_152, dwLoc0D4C, dwLoc0D48, dwLoc0C38, dwLoc0BF8, out s1_3832, out a0_3833, out a1_3834, out a2_827, out a3_828, out a4_829, out a5_824, out s2_3835, out s3_3836, out s4_3837, out s8_3838);
			}
		}
		struct Eq_6763 * a5_568;
		Eq_2 a3_572;
		word32 a1_3791;
		word32 a2_3792;
		word32 a4_3793;
		word32 a7_3795;
		word32 a6_3794;
		memcpy(a0_542, s1_550 - s0_549, s0_549, out a1_3791, out a2_3792, out a3_572, out a4_3793, out a5_568, out a6_3794, out a7_3795);
		((word32) s0_549 + a5_568->dw02DC)->u1 = 0x00;
		struct Eq_6786 * a5_589;
		word32 a1_3797;
		word32 a2_3798;
		word32 s4_3804;
		word32 s5_3805;
		word32 s6_3806;
		word32 s7_3807;
		word32 s9_3809;
		word32 s10_3810;
		word32 s11_3811;
		word32 t4_3812;
		word32 s8_3808;
		word32 s2_3802;
		word32 s3_3803;
		word32 a3_3799;
		word32 a4_3800;
		word32 a7_3801;
		word32 a0_3796;
		byte * s1_597;
		Eq_2 ra_596 = printf(ra_519, &g_t23073F7C, a3_572, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_597, out a0_3796, out a1_3797, out a2_3798, out a3_3799, out a4_3800, out a5_589, out a7_3801, out s2_3802, out s3_3803, out s4_3804, out s5_3805, out s6_3806, out s7_3807, out s8_3808, out s9_3809, out s10_3810, out s11_3811, out t4_3812);
		struct Eq_6828 * a5_615;
		word32 a1_3813;
		word32 a2_3814;
		word32 a3_3815;
		word32 a4_3816;
		a5_615->w02E0 = (word16) strlen(a5_589->t02DC, out a1_3813, out a2_3814, out a3_3815, out a4_3816, out a5_615);
		while (true)
		{
			word32 a5_624 = (word32) *s1_597;
			if (a5_624 != 0x0A && a5_624 != 0x0D)
				break;
			++s1_597;
		}
		Eq_2 s0_629 = 0x00;
		while (true)
		{
			word32 a5_636 = CONVERT(Mem621[s1_597 + s0_629:byte], byte, word32);
			if (a5_636 == 0x0A || a5_636 == 0x0D)
				break;
			s0_629 = (word32) s0_629 + 1;
		}
		Eq_2 a5_655;
		Eq_2 a3_659;
		Eq_2 a4_660;
		Eq_2 s1_663;
		word32 a2_3841;
		word32 a7_3842;
		word32 s7_3848;
		word32 s8_3849;
		word32 s9_3850;
		word32 s10_3851;
		word32 t4_3853;
		word32 s11_3852;
		word32 s5_3846;
		word32 s6_3847;
		word32 s2_3843;
		word32 s3_3844;
		word32 s4_3845;
		word32 a0_3839;
		word32 a1_3840;
		Eq_2 ra_662 = printf(ra_596, &g_t23073F90, 0x0A, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_663, out a0_3839, out a1_3840, out a2_3841, out a3_659, out a4_660, out a5_655, out a7_3842, out s2_3843, out s3_3844, out s4_3845, out s5_3846, out s6_3847, out s7_3848, out s8_3849, out s9_3850, out s10_3851, out s11_3852, out t4_3853);
		Eq_2 a0_681;
		word32 s2_690;
		word32 s8_3863;
		word32 s1_3854;
		word32 a1_3855;
		word32 a3_3857;
		word32 a4_3858;
		word32 a5_3859;
		word32 s3_3861;
		word32 s4_3862;
		word32 a6_3860;
		word32 a2_3856;
		Eq_2 s0_688 = pvPortMalloc(ra_662, s1_663, s0_629, a3_659, a4_660, a5_655, mstatus_152, dwLoc0D30, dwLoc0D2C, dwLoc0CE4, dwLoc0C38, dwLoc0BF8, out s1_3854, out a0_681, out a1_3855, out a2_3856, out a3_3857, out a4_3858, out a5_3859, out a6_3860, out s2_690, out s3_3861, out s4_3862, out s8_3863);
		dwLoc0D58_2155 = a0_681;
		if (a0_681 == 0x00)
		{
			word32 a0_3891;
			word32 a1_3892;
			word32 a7_3893;
			word32 s2_3894;
			word32 s4_3896;
			word32 s5_3897;
			word32 s6_3898;
			word32 s8_3900;
			word32 s9_3901;
			word32 s10_3902;
			word32 t4_3904;
			word32 s11_3903;
			word32 s7_3899;
			word32 s3_3895;
			word32 s1_3890;
			Eq_2 a5_776;
			Eq_2 a4_781;
			Eq_2 a3_780;
			Eq_2 a2_779;
			printf(ra_662, &g_t2307402C, fp + 0x00FFEFD0, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_3890, out a0_3891, out a1_3892, out a2_779, out a3_780, out a4_781, out a5_776, out a7_3893, out s2_3894, out s3_3895, out s4_3896, out s5_3897, out s6_3898, out s7_3899, out s8_3900, out s9_3901, out s10_3902, out s11_3903, out t4_3904);
			while (true)
			{
				word32 a0_3906;
				word32 s4_3910;
				word32 s8_3911;
				word32 a1_3907;
				word32 s2_3908;
				word32 s3_3909;
				word32 s1_3905;
				vTaskDelay(1000, a2_779, a3_780, a4_781, a5_776, mstatus_152, dwLoc0D4C, dwLoc0D48, dwLoc0C38, dwLoc0BF8, out s1_3905, out a0_3906, out a1_3907, out a2_779, out a3_780, out a4_781, out a5_776, out s2_3908, out s3_3909, out s4_3910, out s8_3911);
			}
		}
		struct Eq_7006 * a5_707;
		Eq_2 a3_711;
		word32 a1_3864;
		word32 a7_3868;
		word32 a2_3865;
		word32 a4_3866;
		word32 a6_3867;
		memcpy(a0_681, s2_690 - s0_688, s0_688, out a1_3864, out a2_3865, out a3_711, out a4_3866, out a5_707, out a6_3867, out a7_3868);
		((word32) s0_688 + a5_707->dw02D8)->u1 = 0x00;
		Eq_2 a2_731;
		Eq_2 a3_732;
		Eq_2 a4_733;
		struct Eq_7032 * s2_739;
		Eq_2 s3_740;
		word32 a0_3870;
		word32 a1_3871;
		word32 a5_3872;
		word32 a7_3873;
		word32 s5_3875;
		word32 s6_3876;
		word32 s7_3877;
		word32 s9_3879;
		word32 s10_3880;
		word32 s11_3881;
		word32 t4_3882;
		word32 s8_3878;
		word32 s4_3874;
		word32 s1_3869;
		ra_1087 = printf(ra_662, &g_t23073FA8, a3_711, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_3869, out a0_3870, out a1_3871, out a2_731, out a3_732, out a4_733, out a5_3872, out a7_3873, out s2_739, out s3_740, out s4_3874, out s5_3875, out s6_3876, out s7_3877, out s8_3878, out s9_3879, out s10_3880, out s11_3881, out t4_3882);
		word32 a5_3885;
		word32 s6_3889;
		word32 s2_3886;
		word32 s3_3887;
		word32 s5_3888;
