pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
		word32 a2_3883;
		word32 a4_3884;
		aos_close(ra_1087, s3_740, a2_731, a3_732, a4_733, s2_739, mstatus_152, dwLoc0D38, out a2_3883, out a3_1084, out a4_3884, out a5_3885, out s2_3886, out s3_3887, out s5_3888, out s6_3889);
	}
	Eq_2 s2_1119;
	word32 a0_1142;
	Eq_2 a3_1145;
	Eq_2 s0_1150;
	word32 s9_3926;
	word32 s10_3927;
	word32 s11_3928;
	word32 t4_3929;
	word32 s1_3912;
	word32 a0_3913;
	word32 a1_3914;
	word32 a3_3916;
	word32 a4_3917;
	word32 a5_3918;
	word32 s3_3920;
	word32 s4_3921;
	word32 s5_3922;
	word32 s7_3924;
	word32 s8_3925;
	word32 s6_3923;
	word32 a7_3919;
	word32 a2_3915;
	Eq_2 ra_1160 = aws_iot_shadow_init(printf(ra_1087, &g_t23074044, a3_1084, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_3912, out a0_3913, out a1_3914, out a2_3915, out a3_3916, out a4_3917, out a5_3918, out a7_3919, out s2_1119, out s3_3920, out s4_3921, out s5_3922, out s6_3923, out s7_3924, out s8_3925, out s9_3926, out s10_3927, out s11_3928, out t4_3929), fp + ~0x0C3B, fp + ~0x0D1F, s2_1119, mstatus_152, dwLoc0CF8, 0x00, dwLoc0CB8, dwLoc0CA8, out s0_1150, out a0_1142, out a3_1145);
	if (a0_1142 == 0x00)
	{
		Eq_2 s1_1182;
		Eq_2 s2_1185;
		word32 a0_1202;
		Eq_2 a3_1205;
		Eq_2 s0_1210;
		Eq_2 s1_1211;
		Eq_2 s3_1225;
		word32 a7_3604;
		word32 a4_3602;
		word32 a2_3600;
		word32 a0_3598;
		word32 s6_3608;
		word32 s7_3609;
		word32 s8_3610;
		word32 s9_3611;
		word32 s11_3613;
		word32 t4_3614;
		word32 s10_3612;
		word32 s3_3605;
		word32 s4_3606;
		word32 s5_3607;
		word32 a5_3603;
		word32 a3_3601;
		word32 a1_3599;
		Eq_2 s2_1212;
		Eq_2 s10_1223;
		ptr32 mstatus_1221;
		Eq_2 ra_1222 = aws_iot_shadow_connect(printf(ra_1160, &g_t2307408C, a3_1145, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_1182, out a0_3598, out a1_3599, out a2_3600, out a3_3601, out a4_3602, out a5_3603, out a7_3604, out s2_1185, out s3_3605, out s4_3606, out s5_3607, out s6_3608, out s7_3609, out s8_3610, out s9_3611, out s10_3612, out s11_3613, out t4_3614), s1_1182, s0_1150, (word32) s1_1182 + 728 + (fp + 0x00FFEFD0), s2_1185, mstatus_152, dwLoc0D6C, dwLoc0D68, dwLoc0D58_2155, dwLoc0D54_2151, dwLoc0D50_2157, dwLoc0D4C, dwLoc0D48, dwLoc0D38, dwLoc0D18, dwLoc0D08, dwLoc0D04, dwLoc0CF8, dwLoc0CD8, dwLoc0CC8, dwLoc0CB8, out s0_1210, out s1_1211, out a0_1202, out a3_1205, out s2_1212, out s3_1225, out s10_1223, out mstatus_1221);
		if (a0_1202 == 0x00)
		{
			if (aws_iot_shadow_set_autoreconnect_status(s0_1210, 0x01) == 0x00)
			{
				Eq_2 a3_1246;
				Eq_2 a0_1243 = aws_iot_shadow_register_delta(ra_1222, s1_1211, s0_1210, (word32) s1_1211 + 744 + (fp + 0x00FFEFD0), fp + -3424, s3_1225, mstatus_1221, dwLoc0D68, dwLoc0D60_2593, dwLoc0D58_2155, dwLoc0D2C, dwLoc0D28_2675, dwLoc0D18, dwLoc0D10, 0x00, dwLoc0CD8, dwLoc0CC8, dwLoc0CC4, dwLoc0CB8, dwLoc0C98, dwLoc0C88, out a3_1246);
				Eq_2 s0_1255 = a0_1243;
				if (a0_1243 == 0x00)
				{
					real32 fs0_1263 = g_r23073E48;
					g_r23073B50 = fs0_1263;
					Eq_2 a2_1264 = dwLoc0C8C;
					real32 fs1_1268 = g_r23073E4C;
					real32 fs2_1270 = g_r23073E54;
					real32 fs3_1272 = g_r23073E50;
					while (((word32) s0_1255 - 3 & 0x00FF) <= 0x01 || s0_1255 == 0x00)
					{
						word32 a0_1301;
						Eq_2 a2_1303;
						Eq_2 a3_1304;
						int32 s0_1311;
						Eq_2 s10_1313;
						Eq_2 s2_1315;
						struct Eq_7548 * s3_1316;
						Eq_2 ra_1310 = aws_iot_shadow_yield(ra_1222, fp + ~0x0C3B, 200, a2_1264, a3_1246, fp + -3424, s2_1212, s10_1223, mstatus_1221, dwLoc0D68, dwLoc0D58_2155, dwLoc0D54_2151, dwLoc0D38, dwLoc0CD8, dwLoc0C98, dwLoc0C88, dwLoc0C58, dwLoc0C48, dwLoc0BD8, out s0_1311, out a0_1301, out a2_1303, out a3_1304, out s2_1315, out s3_1316, out s10_1313, out mstatus_1221);
						if (a0_1301 != 0x04 && (word32) s3_1316->bFFFFFC98 == 0x00)
						{
							Eq_2 a3_1340;
							word32 t4_4071;
							word32 s11_4070;
							word32 s10_4069;
							word32 s9_4068;
							word32 s8_4067;
							word32 s7_4066;
							word32 s6_4065;
							word32 s5_4064;
							word32 s4_4063;
							word32 s3_4062;
							word32 s2_4061;
							word32 a7_4060;
							word32 a5_4059;
							word32 a4_4058;
							word32 a2_4057;
							word32 a1_4056;
							word32 a0_4055;
							word32 s1_4054;
							Eq_2 ra_1343 = printf(ra_1310, &g_t23074134, a3_1304, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_4054, out a0_4055, out a1_4056, out a2_4057, out a3_1340, out a4_4058, out a5_4059, out a7_4060, out s2_4061, out s3_4062, out s4_4063, out s5_4064, out s6_4065, out s7_4066, out s8_4067, out s9_4068, out s10_4069, out s11_4070, out t4_4071);
							(word32) (fp + 0x00FFEFD0 + s0_1311)->b02D3 != 0x00;
							word32 s3_4135;
							word32 s4_4136;
							word32 s5_4137;
							word32 s6_4138;
							word32 s8_4140;
							word32 s9_4141;
							word32 s10_4142;
							word32 t4_4144;
							word32 s11_4143;
							word32 s7_4139;
							word32 s2_4134;
							word32 s1_4126;
							word32 a1_4128;
							word32 a2_4129;
							word32 a3_4130;
							word32 a5_4132;
							word32 a7_4133;
							word32 a4_4131;
							word32 a0_4127;
							Eq_2 ra_1382 = printf(ra_1343, &g_t23074190, a3_1340, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_4126, out a0_4127, out a1_4128, out a2_4129, out a3_4130, out a4_4131, out a5_4132, out a7_4133, out s2_4134, out s3_4135, out s4_4136, out s5_4137, out s6_4138, out s7_4139, out s8_4140, out s9_4141, out s10_4142, out s11_4143, out t4_4144);
							if ((word32) (fs1_1268 <= 7.328192e-18F) != 0x00)
								g_r4200DC94 = fs3_1272;
							else if ((word32) (fs0_1263 >= 7.328192e-18F) != 0x00)
								g_r4200DC94 = fs2_1270;
							word32 a0_1439;
							Eq_2 s1_1447;
							Eq_2 s2_1450;
							Eq_2 a3_1443;
							Eq_2 ra_1446 = aws_iot_shadow_init_json_document(ra_1382, fp + ~0x0D03, 200, dwLoc0D68, dwLoc0D48, dwLoc0D1C_3272, dwLoc0D00, dwLoc0CD8, dwLoc0CB4, out s1_1447, out a0_1439, out a3_1443, out s2_1450);
							if (a0_1439 == 0x00)
							{
								word32 a0_1487;
								Eq_2 s2_1500;
								Eq_2 s3_1501;
								ra_1446 = aws_iot_shadow_add_reported(ra_1446, s1_1447, s2_1450, 200, (word32) s1_1447 + 744 + (fp + 0x00FFEFD0), fp + 0x00FFEFD0, s2_1450, fa0, fflags, frm, dwLoc0D6C, dwLoc0D50_2157, dwLoc0D14, dwLoc0D04, dwLoc0BF8, out a0_1487, out a3_1443, out s2_1500, out s3_1501);
								if (a0_1487 == 0x00)
								{
									word32 a0_1516;
									ra_1446 = aws_iot_finalize_json_document(ra_1446, s2_1500, 200, s3_1501, dwLoc0D58_2155, dwLoc0D2C, dwLoc0D10, 0x00, dwLoc0CC4, out a0_1516, out a3_1443);
									if (a0_1516 == 0x00)
									{
										word32 a1_1547;
										word32 s1_1553;
										Eq_2 s2_1556;
										Eq_2 s4_1558;
										Eq_2 s6_1560;
										byte * s4_1588;
										word32 s7_4120;
										word32 s8_4121;
										word32 s9_4122;
										word32 s11_4124;
										word32 t4_4125;
										word32 s10_4123;
										word32 a0_4112;
										word32 a3_4114;
										word32 a4_4115;
										word32 a5_4116;
										word32 s3_4118;
										word32 s5_4119;
										word32 a7_4117;
										word32 a2_4113;
										ra_1446 = aws_iot_shadow_update(printf(ra_1446, &g_t230741B0, a3_1443, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_1553, out a0_4112, out a1_1547, out a2_4113, out a3_4114, out a4_4115, out a5_4116, out a7_4117, out s2_1556, out s3_4118, out s4_1558, out s5_4119, out s6_1560, out s7_4120, out s8_4121, out s9_4122, out s10_4123, out s11_4124, out t4_4125), s1_1553 + 1012 + (fp + 0x00FFEFD0), a1_1547, s2_1556, 0x01, s4_1558, s6_1560, mstatus_1221, dwLoc0D6C, dwLoc0D68, dwLoc0D58_2155, dwLoc0D54_2151, dwLoc0D38, dwLoc0D28_2675, dwLoc0CF8, fp + ~0x102F, 0x00, dwLoc0CD8, out a3_1443, out s4_1588, out mstatus_1221);
										*s4_1588 = 0x01;
									}
								}
							}
							Eq_2 a4_1626;
							word32 a2_4075;
							word32 a3_4076;
							word32 a5_4077;
							word32 a7_4078;
							word32 s3_4080;
							word32 s4_4081;
							word32 s5_4082;
							word32 s7_4084;
							word32 s8_4085;
							word32 s9_4086;
							word32 s11_4088;
							word32 t4_4089;
							word32 s10_4087;
							word32 s6_4083;
							word32 s2_4079;
							word32 a1_4074;
							word32 a0_4073;
							word32 s1_4072;
							Eq_2 ra_1628 = printf(ra_1446, &g_t230741C4, a3_1443, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_4072, out a0_4073, out a1_4074, out a2_4075, out a3_4076, out a4_1626, out a5_4077, out a7_4078, out s2_4079, out s3_4080, out s4_4081, out s5_4082, out s6_4083, out s7_4084, out s8_4085, out s9_4086, out s10_4087, out s11_4088, out t4_4089);
							pcTaskGetName(0x00, a4_1626, mstatus_1221);
							Eq_2 a5_1658;
							Eq_2 a2_1661;
							Eq_2 a3_1662;
							Eq_2 a4_1663;
							word32 s1_4090;
							word32 a0_4091;
							word32 a1_4092;
							word32 a7_4093;
							word32 s3_4095;
							word32 s4_4096;
							word32 s5_4097;
							word32 s7_4099;
							word32 s8_4100;
							word32 s9_4101;
							word32 t4_4103;
							word32 s11_4102;
							word32 s6_4098;
							word32 s2_4094;
							ra_1222 = printf(ra_1628, &g_t23074220, uxTaskGetStackHighWaterMark(0x00, a4_1626), dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_4090, out a0_4091, out a1_4092, out a2_1661, out a3_1662, out a4_1663, out a5_1658, out a7_4093, out s2_4094, out s3_4095, out s4_4096, out s5_4097, out s6_4098, out s7_4099, out s8_4100, out s9_4101, out s10_1223, out s11_4102, out t4_4103);
							word32 a0_4105;
							word32 a1_4106;
							word32 a4_4107;
							word32 a5_4108;
							word32 s4_4110;
							word32 s8_4111;
							word32 s3_4109;
							word32 s1_4104;
							s0_1255 = vTaskDelay(1000, a2_1661, a3_1662, a4_1663, a5_1658, mstatus_1221, dwLoc0D4C, dwLoc0D48, dwLoc0C38, dwLoc0BF8, out s1_4104, out a0_4105, out a1_4106, out a2_1264, out a3_1246, out a4_4107, out a5_4108, out s2_1212, out s3_4109, out s4_4110, out s8_4111);
						}
						else
						{
							Eq_2 a0_1711;
							word32 s0_4052;
							word32 s3_4053;
							ra_1222 = aws_iot_shadow_yield(ra_1310, fp + ~0x0C3B, 1000, a2_1303, a3_1304, fp + -3424, s2_1315, s10_1313, mstatus_1221, dwLoc0D68, dwLoc0D58_2155, dwLoc0D54_2151, dwLoc0D38, dwLoc0CD8, dwLoc0C98, dwLoc0C88, dwLoc0C58, dwLoc0C48, dwLoc0BD8, out s0_4052, out a0_1711, out a2_1264, out a3_1246, out s2_1212, out s3_4053, out s10_1223, out mstatus_1221);
							s0_1255 = a0_1711;
						}
					}
					Eq_2 a3_1749;
					Eq_2 a3_1773;
					Eq_2 s3_1781;
					Eq_2 s4_1782;
					word32 a0_1797;
					ptr32 mstatus_1805;
					word32 s11_4035;
					word32 t4_4036;
					word32 s8_4032;
					word32 s9_4033;
					word32 s10_4034;
					word32 s5_4029;
					word32 s6_4030;
					word32 s7_4031;
					word32 a5_4026;
					word32 a7_4027;
					word32 s2_4028;
					word32 a1_4023;
					word32 a2_4024;
					word32 a4_4025;
					word32 t4_4020;
					word32 s1_4021;
					word32 a0_4022;
					word32 s10_4018;
					word32 s11_4019;
					word32 s7_4015;
					word32 s8_4016;
					word32 s9_4017;
					word32 s6_4014;
					word32 s3_4011;
					word32 s4_4012;
					word32 s5_4013;
					word32 a5_4008;
					word32 a7_4009;
					word32 s2_4010;
					word32 a2_4006;
					word32 a4_4007;
					word32 a0_4004;
					word32 a1_4005;
					word32 s1_4003;
					Eq_2 a5_1802;
					Eq_2 a4_1801;
					Eq_2 a3_1800;
					Eq_2 a2_1799;
					Eq_2 ra_1806 = aws_iot_shadow_disconnect(printf(printf(ra_1222, &g_t23074250, a3_1246, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_4003, out a0_4004, out a1_4005, out a2_4006, out a3_1749, out a4_4007, out a5_4008, out a7_4009, out s2_4010, out s3_4011, out s4_4012, out s5_4013, out s6_4014, out s7_4015, out s8_4016, out s9_4017, out s10_4018, out s11_4019, out t4_4020), &g_t23074274, a3_1749, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_4021, out a0_4022, out a1_4023, out a2_4024, out a3_1773, out a4_4025, out a5_4026, out a7_4027, out s2_4028, out s3_1781, out s4_1782, out s5_4029, out s6_4030, out s7_4031, out s8_4032, out s9_4033, out s10_4034, out s11_4035, out t4_4036), fp + ~0x0C3B, a3_1773, fp + -3424, s3_1781, s4_1782, mstatus_1221, dwLoc0D4C, dwLoc0D3C_2399, dwLoc0CD8, dwLoc0CA8, dwLoc0C98, dwLoc0C78, dwLoc0C68, dwLoc0C28, out a0_1797, out a2_1799, out a3_1800, out a4_1801, out a5_1802, out mstatus_1805);
					if (a0_1797 != 0x00)
					{
						word32 t4_4051;
						word32 s9_4048;
						word32 s10_4049;
						word32 s11_4050;
						word32 s8_4047;
						word32 s7_4046;
						word32 s6_4045;
						word32 s5_4044;
						word32 s2_4041;
						word32 s3_4042;
						word32 s4_4043;
						word32 a0_4038;
						word32 a1_4039;
						word32 a7_4040;
						word32 s1_4037;
						printf(ra_1806, &g_t23074284, a3_1800, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_4037, out a0_4038, out a1_4039, out a2_1799, out a3_1800, out a4_1801, out a5_1802, out a7_4040, out s2_4041, out s3_4042, out s4_4043, out s5_4044, out s6_4045, out s7_4046, out s8_4047, out s9_4048, out s10_4049, out s11_4050, out t4_4051);
					}
					vTaskDelete(0x00, a2_1799, a3_1800, a4_1801, a5_1802, mstatus_1805);
				}
				else
				{
					word32 t4_3995;
					word32 s11_3994;
					word32 s10_3993;
					word32 s6_3989;
					word32 s7_3990;
					word32 s8_3991;
					word32 s9_3992;
					word32 s2_3985;
					word32 s3_3986;
					word32 s4_3987;
					word32 s5_3988;
					word32 a7_3984;
					word32 a1_3983;
					word32 a0_3982;
					word32 s1_3981;
					Eq_2 a5_1884;
					Eq_2 a4_1889;
					Eq_2 a3_1888;
					Eq_2 a2_1887;
					printf(ra_1222, &g_t23074114, a3_1246, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_3981, out a0_3982, out a1_3983, out a2_1887, out a3_1888, out a4_1889, out a5_1884, out a7_3984, out s2_3985, out s3_3986, out s4_3987, out s5_3988, out s6_3989, out s7_3990, out s8_3991, out s9_3992, out s10_3993, out s11_3994, out t4_3995);
					while (true)
					{
						word32 s4_4001;
						word32 s8_4002;
						word32 s3_4000;
						word32 s2_3999;
						word32 a1_3998;
						word32 a0_3997;
						word32 s1_3996;
						vTaskDelay(1000, a2_1887, a3_1888, a4_1889, a5_1884, mstatus_1221, dwLoc0D4C, dwLoc0D48, dwLoc0C38, dwLoc0BF8, out s1_3996, out a0_3997, out a1_3998, out a2_1887, out a3_1888, out a4_1889, out a5_1884, out s2_3999, out s3_4000, out s4_4001, out s8_4002);
					}
				}
			}
			else
			{
				word32 s7_3968;
				word32 s11_3972;
				word32 t4_3973;
				word32 s8_3969;
				word32 s9_3970;
				word32 s10_3971;
				word32 s1_3959;
				word32 a0_3960;
				word32 a7_3962;
				word32 s2_3963;
				word32 s3_3964;
				word32 s5_3966;
				word32 s6_3967;
				word32 s4_3965;
				word32 a1_3961;
				Eq_2 a5_1931;
				Eq_2 a4_1936;
				Eq_2 a3_1935;
				Eq_2 a2_1934;
				printf(ra_1222, &g_t230740D8, a3_1205, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_3959, out a0_3960, out a1_3961, out a2_1934, out a3_1935, out a4_1936, out a5_1931, out a7_3962, out s2_3963, out s3_3964, out s4_3965, out s5_3966, out s6_3967, out s7_3968, out s8_3969, out s9_3970, out s10_3971, out s11_3972, out t4_3973);
				while (true)
				{
					word32 s8_3980;
					word32 s4_3979;
					word32 s3_3978;
					word32 s2_3977;
					word32 a1_3976;
					word32 a0_3975;
					word32 s1_3974;
					vTaskDelay(1000, a2_1934, a3_1935, a4_1936, a5_1931, mstatus_1221, dwLoc0D4C, dwLoc0D48, dwLoc0C38, dwLoc0BF8, out s1_3974, out a0_3975, out a1_3976, out a2_1934, out a3_1935, out a4_1936, out a5_1931, out s2_3977, out s3_3978, out s4_3979, out s8_3980);
				}
			}
		}
		else
		{
			word32 s8_3947;
			word32 t4_3951;
			word32 s9_3948;
			word32 s10_3949;
			word32 s11_3950;
			word32 s1_3937;
			word32 a0_3938;
			word32 a1_3939;
			word32 s2_3941;
			word32 s3_3942;
			word32 s4_3943;
			word32 s6_3945;
			word32 s7_3946;
			word32 s5_3944;
			word32 a7_3940;
			Eq_2 a5_1978;
			Eq_2 a4_1983;
			Eq_2 a3_1982;
			Eq_2 a2_1981;
			printf(ra_1222, &g_t230740A0, a3_1205, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_3937, out a0_3938, out a1_3939, out a2_1981, out a3_1982, out a4_1983, out a5_1978, out a7_3940, out s2_3941, out s3_3942, out s4_3943, out s5_3944, out s6_3945, out s7_3946, out s8_3947, out s9_3948, out s10_3949, out s11_3950, out t4_3951);
			while (true)
			{
				word32 a0_3953;
				word32 a1_3954;
				word32 s2_3955;
				word32 s3_3956;
				word32 s8_3958;
				word32 s4_3957;
				word32 s1_3952;
				vTaskDelay(1000, a2_1981, a3_1982, a4_1983, a5_1978, mstatus_1221, dwLoc0D4C, dwLoc0D48, dwLoc0C38, dwLoc0BF8, out s1_3952, out a0_3953, out a1_3954, out a2_1981, out a3_1982, out a4_1983, out a5_1978, out s2_3955, out s3_3956, out s4_3957, out s8_3958);
			}
		}
	}
	else
	{
		word32 t4_3629;
		word32 s11_3628;
		word32 s10_3627;
		word32 s6_3623;
		word32 s7_3624;
		word32 s8_3625;
		word32 s9_3626;
		word32 s1_3615;
		word32 a1_3617;
		word32 a7_3618;
		word32 s2_3619;
		word32 s4_3621;
		word32 s5_3622;
		word32 s3_3620;
		word32 a0_3616;
		Eq_2 a5_2025;
		Eq_2 a4_2030;
		Eq_2 a3_2029;
		Eq_2 a2_2028;
		printf(ra_1160, &g_t23074054, a3_1145, dwLoc0D68, dwLoc0D48, dwLoc0D00, dwLoc0CFC, dwLoc0CD8, dwLoc0CB4, out s1_3615, out a0_3616, out a1_3617, out a2_2028, out a3_2029, out a4_2030, out a5_2025, out a7_3618, out s2_3619, out s3_3620, out s4_3621, out s5_3622, out s6_3623, out s7_3624, out s8_3625, out s9_3626, out s10_3627, out s11_3628, out t4_3629);
		while (true)
		{
			word32 s8_3636;
			word32 s4_3635;
			word32 s3_3634;
			word32 s2_3633;
			word32 a1_3632;
			word32 a0_3631;
			word32 s1_3630;
			vTaskDelay(1000, a2_2028, a3_2029, a4_2030, a5_2025, mstatus_152, dwLoc0D4C, dwLoc0D48, dwLoc0C38, dwLoc0BF8, out s1_3630, out a0_3631, out a1_3632, out a2_2028, out a3_2029, out a4_2030, out a5_2025, out s2_3633, out s3_3634, out s4_3635, out s8_3636);
		}
	}
}

// 23001A34: void cmd_coex_dump()
void cmd_coex_dump()
{
	coex_dump_pta();
	coex_dump_wifi();
}

// 23001A44: void codex_debug_cli_init()
// Called from:
//      aos_loop_proc
void codex_debug_cli_init()
{
}

// 23001A48: Register (ptr32 (ptr32 Eq_8205)) mm_rx_filter_set(Register (ptr32 (ptr32 Eq_8205)) a4, Register out (ptr32 Eq_8201) a5Out)
// Called from:
//      mm_env_init
//      mm_hw_info_set
//      mm_hw_ap_info_set
//      mm_hw_ap_info_reset
struct Eq_8205 ** mm_rx_filter_set(struct Eq_8205 ** a4, struct Eq_8201 & a5Out)
{
	struct Eq_8201 * a5_8 = *((char *) *a4 + 4) | a4;
	a5_8->dw0060 = 0x44B00000;
	a5Out = a5_8;
	return (struct Eq_8205 **) 0x44B00000;
}

