pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 23001A5E: void element_notify_status_enabled()
void element_notify_status_enabled()
{
}

// 23001A62: Register Eq_2 blmac_ap_setf(Register ui32 a0, Register Eq_2 a5)
// Called from:
//      mm_hw_info_set
//      mm_hw_ap_info_set
//      mm_hw_ap_info_reset
Eq_2 blmac_ap_setf(ui32 a0, Eq_2 a5)
{
	Eq_2 a4_5 = *((word32) a5 + 76);
	(a0 << 1 | a5 & ~0x02)->t004C = a4_5;
	return a4_5;
}

// 23001A72: Register uint32 ascii_to_hex(Register uint32 a0)
// Called from:
//      mm_sta_add
uint32 ascii_to_hex(uint32 a0)
{
	uint32 a0_13 = a0 + -48 & 0x00FF;
	if (a0_13 <= 0x09)
		return a0_13;
	ui32 a5_14;
	if ((a0 + -97 & 0x00FF) <= 0x05)
		a5_14 = a0 + -87;
	else
	{
		a0_13 = 0x00;
		if ((a0 + -65 & 0x00FF) > 0x05)
			return a0_13;
		a5_14 = a0 + -55;
	}
	a0_13 = a5_14 & 0x00FF;
	return a0_13;
}

// 23001AAE: void element_notify_time_last_received_set()
void element_notify_time_last_received_set()
{
}

// 23001AB2: Register word32 blmac_encr_cntrl_pack.constprop.8(Register ui32 a0, Register ui32 a1, Register (ptr32 Eq_8261) a2, Register ui32 a3, Register ui32 a4, Register ui32 a5, Register Eq_8265 a6, Register ui32 a7, Stack Eq_2 dwArg0128, Register out Eq_8268 s1Out, Register out Eq_8265 s2Out, Register out Eq_8270 s3Out, Register out ptr32 s4Out, Register out Eq_8272 s5Out, Register out Eq_8273 s6Out)
// Called from:
//      cmd_wifi
//      mm_sec_machwaddr_wr
//      mm_sec_machwkey_wr
//      mm_sec_machwaddr_del
//      RemoveAPKeyInfo
word32 blmac_encr_cntrl_pack.constprop.8(ui32 a0, ui32 a1, struct Eq_8261 * a2, ui32 a3, ui32 a4, ui32 a5, Eq_8265 a6, ui32 a7, Eq_2 dwArg0128, union Eq_8268 & s1Out, union Eq_8265 & s2Out, union Eq_8270 & s3Out, ptr32 & s4Out, union Eq_8272 & s5Out, union Eq_8273 & s6Out)
{
	if ((a4 << 0x04 & -0x00F1) == 0x00)
	{
		if ((a5 << 2 & -0x0D) == 0x00)
		{
			*(union Eq_8307 *) 0x44B000C4 = a0 << 31 | a7 | a6 << 0x01 | a5 << 2 | a4 << 0x04 | a3 << 0x08 | a2 << 0x10 | a1 << 0x1E;
			0x00 = (uint16) dwArg0128;
			s1Out = a5 << 2;
			s2Out = a6;
			s3Out = a1 << 0x1E;
			s4Out = dwArg78;
			s5Out = a3 << 0x08;
			s6Out = a4 << 0x04;
			return dwArgE4;
		}
		else
			assert_err();
	}
	else
		assert_err();
}

// 23001B5E: void element_notify_keepalive_received()
void element_notify_keepalive_received()
{
}

// 23001B62: Register ui32 hal_machw_rx_duration(Register Eq_8320 a1, Register (ptr32 Eq_8321) a4, Register ptr32 mstatus, Stack word32 dwArg38, Register out Eq_8324 a0Out, Register out ptr32 a4Out, Register out Eq_8320 s2Out)
// Called from:
//      mm_check_beacon
ui32 hal_machw_rx_duration(Eq_8320 a1, struct Eq_8321 * a4, ptr32 mstatus, word32 dwArg38, union Eq_8324 & a0Out, ptr32 & a4Out, union Eq_8320 & s2Out)
{
	word32 a0_13 = a4->dw0028;
	ui32 s1_19 = (word32) (a4 >> 0x0C & 0x0F)->b23078014;
	if ((s1_19 & -0x0080) == 0x00)
	{
		*(ui32 *) 1152418148 = s1_19;
		*(ui32 *) 1152418144 = (a1 >> 0x0F & 0x01) << 24 | a1;
		*(int32 *) 1152418152 = 0x80000000;
		ptr32 a4_40 = 0x44B08000;
		do
			;
		while (*(int32 *) 1152418152 << 0x01 >= 0x00);
		Eq_8324 a0_51;
		if (false)
		{
			word32 a2_99;
			word32 a5_100;
			assert_rec(mstatus, out a2_99, out a4_40, out a5_100);
			a0_51.u0 = 500;
		}
		else
			a0_51 = (word32) (word16) a0_13;
		0x00 = dwArg38;
		a0Out = a0_51;
		a4Out = a4_40;
		s2Out = a1;
		return s1_19;
	}
	else
		assert_err();
}

// 23001C12: Register word32 mm_env_max_ampdu_duration_set()
// Called from:
//      mm_env_init
//      mm_hw_config_handler
word32 mm_env_max_ampdu_duration_set()
{
	int32 a5_17 = 0x0096;
	if ((word32) (word16) (*(union Eq_2 *) 0x44B00200 >> 0x0C) != 0x00 && (word32) ((word16) (*((union Eq_2 *) 0x44B00200) >> 0x0C)) <= 0x0096)
		a5_17 = (word32) (word16) (*(union Eq_2 *) 0x44B00200 >> 0x0C);
	g_w42018E60 = (word16) a5_17;
	int32 a5_25 = 0x0096;
	if ((word32) (word16) (*(union Eq_2 *) 0x44B00204 >> 0x0C) != 0x00 && (word32) ((word16) (*((union Eq_2 *) 0x44B00204) >> 0x0C)) <= 0x0096)
		a5_25 = (word32) (word16) (*(union Eq_2 *) 0x44B00204 >> 0x0C);
	g_w42018E62 = (word16) a5_25;
	int32 a5_42 = 0x0096;
	if ((word32) (word16) (*(union Eq_2 *) 0x44B00208 >> 0x0C) != 0x00 && (word32) ((word16) (*((union Eq_2 *) 0x44B00208) >> 0x0C)) <= 0x0096)
		a5_42 = (word32) (word16) (*(union Eq_2 *) 0x44B00208 >> 0x0C);
	g_w42018E64 = (word16) a5_42;
	int32 a5_59 = 0x0096;
	if ((word32) (word16) (*(union Eq_2 *) 0x44B0020C >> 0x0C) != 0x00 && (word32) ((word16) (*((union Eq_2 *) 0x44B0020C) >> 0x0C)) <= 0x0096)
		a5_59 = (word32) (word16) (*(union Eq_2 *) 0x44B0020C >> 0x0C);
	g_w42018E66 = (word16) a5_59;
	g_w42018E68 = (word16) a5_59;
	return 0x42018E58;
}

// 23001CE4: Register Eq_2 mm_env_init(Register Eq_2 ra)
// Called from:
//      mm_init
Eq_2 mm_env_init(Eq_2 ra)
{
	word32 t1_41;
	word32 a0_42;
	word32 a1_43;
	word32 a2_44;
	word32 a3_45;
	word32 a4_46;
	word32 a5_47;
	Eq_2 ra_18 = memset(ra, 0x42018E58, 0x00, 44, out t1_41, out a0_42, out a1_43, out a2_44, out a3_45, out a4_46, out a5_47);
	g_t42018E7A.u1 = 0x0101;
	g_t42018E6A.u1 = 0x00;
	g_dw42018E5C = 0x00;
	*(word32 *) 0x7FFFFFDE = 0x42018E58;
	word32 a5_48;
	mm_rx_filter_set((struct Eq_8205 **) 0x7FFFFFDE, out a5_48);
	mm_env_max_ampdu_duration_set();
	return ra_18;
}

// 23001D26: Register Eq_2 mm_init(Register Eq_2 ra, Register ui32 s0, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Stack word32 dwArgF8, Stack Eq_2 dwArg0108, Stack word32 dwArg0118, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      mm_reset_req_handler
//      bl_init
Eq_2 mm_init(Eq_2 ra, ui32 s0, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg9C, Eq_2 dwArgAC, word32 dwArgF8, Eq_2 dwArg0108, word32 dwArg0118, Eq_2 dwArg0168, ptr32 & s0Out, ptr32 & a3Out, ptr32 & a4Out)
{
	Eq_2 a4_44;
	Eq_2 s2_50;
	Eq_2 a3_62;
	struct Eq_8573 * a0_109;
	Eq_2 a4_122;
	Eq_2 ra_151 = rxl_init(txl_cntrl_init(ps_init(td_init(sta_mgmt_init(vif_mgmt_init(mm_env_init(hal_machw_init(ra, s0, dwArg08, dwArg28, dwArg50, dwArg54, dwArg78, dwArg9C)), out a4_44, out s2_50), a4_44, s2_50, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg60, dwArg64, dwArg68, dwArg88, dwArg8C, dwArgAC, out a3_62), a3_62, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg40, dwArg44, dwArg50, dwArg54, dwArg68, dwArg78, dwArg8C, dwArg9C), out a0_109), a0_109, dwArgF8, dwArg0168, out a4_122), a4_122, mstatus, dwArg20, dwArg24, dwArg48, dwArg6C, dwArg0108);
	mm_timer_init();
	ptr32 s0_195;
	Eq_2 ra_194 = chan_init(scan_init(ra_151, mstatus), dwArg0118, out s0_195);
	hal_dma_init();
	ptr32 a3_218;
	ptr32 a4_219;
	Eq_2 ra_221 = mm_bcn_init(ra_194, out a3_218, out a4_219);
	s0Out = s0_195;
	a3Out = a3_218;
	a4Out = a4_219;
	return ra_221;
}

