pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 23001D60: Register Eq_2 mm_active(Register ptr32 mstatus, Register out ptr32 a4Out, Register out ptr32 s2Out)
// Called from:
//      mm_reset
//      mm_back_to_host_idle
//      chan_goto_idle_cb
//      chan_tx_cfm
//      mm_monitor_enable_req_handler
//      mm_set_idle_req_handler
//      mm_start_req_handler
Eq_2 mm_active(ptr32 mstatus, ptr32 & a4Out, ptr32 & s2Out)
{
	((union Eq_2 *) 0x68)->u0 = 0x44B00000;
	ptr32 a4_11;
	ptr32 s2_16;
	word32 s1_25;
	word32 a0_26;
	word32 a1_27;
	word32 a5_28;
	word32 s3_29;
	word32 s4_30;
	Eq_2 s0_14 = ke_state_set(0x00, 0x01, mstatus, out s1_25, out a0_26, out a1_27, out a4_11, out a5_28, out s2_16, out s3_29, out s4_30);
	a4Out = a4_11;
	s2Out = s2_16;
	return s0_14;
}

// 23001D72: void mm_reset(Register ptr32 mstatus, Stack Eq_2 dwArg28)
// Called from:
//      bl_reset_evt
void mm_reset(ptr32 mstatus, Eq_2 dwArg28)
{
	word32 a0_7;
	word32 a2_68;
	word32 a4_69;
	word32 s2_70;
	ke_state_get(0x00, dwArg28, out a0_7, out a2_68, out a4_69, out s2_70);
	if (a0_7 != 0x01)
	{
		word32 s1_73;
		word32 a0_74;
		word32 a1_75;
		word32 a4_76;
		word32 a5_77;
		word32 s2_78;
		word32 s3_79;
		word32 s4_80;
		ke_state_set(0x00, 0x00, mstatus, out s1_73, out a0_74, out a1_75, out a4_76, out a5_77, out s2_78, out s3_79, out s4_80);
	}
	else
	{
		word32 a4_71;
		word32 s2_72;
		mm_active(mstatus, out a4_71, out s2_72);
	}
}

// 23001D94: void mm_tbtt_evt(Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg48, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158)
void mm_tbtt_evt(Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg48, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgBC, Eq_2 dwArgF8, Eq_2 dwArg0128, Eq_2 dwArg0158)
{
	struct Eq_8379 * s0_7 = g_ptr4201BC58;
	if ((s0_7 & 0x00600000) != 0x00600000)
	{
		ke_evt_clear(s0_7 & 0x00600000, a4, mstatus);
		__csrrc(mstatus, 0x08);
		txl_cntrl_halt_ac(0x04);
		word32 s2_213;
		word32 a1_211;
		word32 mstatus_214;
		word32 a5_212;
		Eq_2 s0_103;
		Eq_2 s5_110;
		Eq_2 a4_162;
		Eq_2 ra_102 = txl_cntrl_flush_ac(0x04, dwArg88, out s0_103, out a1_211, out a4_162, out a5_212, out s2_213, out s5_110, out mstatus_214);
		__csrrs(mstatus, 0x08);
		Eq_2 s1_104 = 0x02;
		while (s0_103 != 0x00)
		{
			if ((word32) *((word32) s0_103 + 86) == s1_104)
			{
				ui32 a5_63 = (word32) *((word32) s0_103 + 833) + ~0x00 & 0x00FF;
				((word32) s0_103 + 833)->u1 = (byte) a5_63;
				if (a5_63 == 0x00)
				{
					((word32) s0_103 + 833)->u1 = (byte) (word32) *((word32) s0_103 + 832);
					struct Eq_8900 * s2_78;
					struct Eq_8901 * s3_79;
					word32 a5_216;
					s1_104 = vif_mgmt_bcn_to_prog(s0_103, a4_162, mstatus, out a5_216, out s2_78, out s3_79);
					s0_103 = *((word32) a3 + 64);
					a4_162 = s2_78->t0120;
					int32 a5_86 = s3_79->dw0040;
					if (a3 != 0x00)
					{
						struct Eq_8927 * a5_89 = (word32) a4_162 + (a5_86 << 5);
						word32 a1_217;
						word32 s9_223;
						word32 s10_224;
						word32 s6_221;
						word32 s7_222;
						word32 s3_219;
						word32 s4_220;
						word32 a2_218;
						ra_102 = chan_tbtt_switch_update(ra_102, a5_89 + ((word32) (*((word32) s0_103 + 0x033E)) << 0x0A) / 0x0044, a3, a5_89, mstatus, s2, dwArg88, dwArgF8, dwArg0158, out s0_103, out s1_104, out a1_217, out a2_218, out a3, out a4_162, out s3_219, out s4_220, out s5_110, out s6_221, out s7_222, out s9_223, out s10_224);
					}
				}
			}
			s0_103 = *s0_103;
		}
		word32 s8_215;
		mm_bcn_transmit(ra_102, s5_110, fflags, frm, mstatus, dwArg08, dwArg48, dwArg88, dwArg8C, dwArgBC, dwArgF8, dwArg0128, out s8_215);
	}
	else
		assert_err();
}

// 23001E54: Register word32 mm_sec_machwaddr_wr(Register (ptr32 Eq_8987) a0, Register ui32 a1, Stack Eq_2 dwArg0118, Register out (ptr32 Eq_8990) a0Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      mm_sta_add
word32 mm_sec_machwaddr_wr(struct Eq_8987 * a0, ui32 a1, Eq_2 dwArg0118, struct Eq_8990 & a0Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	*(union Eq_9004 *) 0x44B000BC = (word32) a0->w420190F0 << 16 | (word32) a0->w420190EE;
	*(ui32 *) 0x44B000C0 = (word32) a0->w420190F2;
	*(byte **) 0x44B000AC = null;
	*(byte **) 0x44B000B0 = null;
	*(byte **) 0x44B000B4 = null;
	*(byte **) 0x44B000B8 = null;
	word32 s1_42;
	ptr32 s2_43;
	ptr32 s3_44;
	ptr32 s4_45;
	word32 s6_87;
	word32 s5_86;
	word32 s0_41 = blmac_encr_cntrl_pack.constprop.8(0x00, 0x01, a0 + 8 & 0x00FF, 0x00, a1, 0x00, 0x01, 0x00, dwArg0118, out s1_42, out s2_43, out s3_44, out s4_45, out s5_86, out s6_87);
	do
		;
	while (*(union Eq_8307 *) 0x44B000C4 << 0x01 < 0x00);
	a0Out = s0_41;
	s2Out = s2_43;
	s3Out = s3_44;
	s4Out = s4_45;
	return s1_42;
}

// 23001ECE: void mm_sec_keydump(Register Eq_2 ra, Register Eq_2 s2, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack ui32 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg5C, Stack Eq_2 dwArgC8)
// Called from:
//      cmd_wifi
void mm_sec_keydump(Eq_2 ra, Eq_2 s2, Eq_2 dwArg10, Eq_2 dwArg14, ui32 dwArg28, Eq_2 dwArg38, Eq_2 dwArg5C, Eq_2 dwArgC8)
{
	Eq_9057 s0_25 = *(union Eq_9057 *) 0x44B000D8;
	word32 a4_605;
	word32 a2_604;
	word32 a1_603;
	word32 a0_602;
	word32 s8_608;
	word32 a5_606;
	word32 s4_607;
	puts(587678716, out a0_602, out a1_603, out a2_604, out a4_605, out a5_606, out s4_607, out s8_608);
	word32 s11_626;
	word32 t4_627;
	word32 s8_623;
	word32 s9_624;
	word32 s10_625;
	word32 s5_620;
	word32 s6_621;
	word32 s7_622;
	word32 s2_617;
	word32 s3_618;
	word32 s4_619;
	word32 a4_614;
	word32 a5_615;
	word32 a7_616;
	word32 a1_611;
	word32 a2_612;
	word32 a3_613;
	word32 s1_609;
	word32 a0_610;
	Eq_2 ra_153 = printf(ra, &g_t23074444, s0_25 >> 0x10 & 0x00FF, dwLoc58, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_609, out a0_610, out a1_611, out a2_612, out a3_613, out a4_614, out a5_615, out a7_616, out s2_617, out s3_618, out s4_619, out s5_620, out s6_621, out s7_622, out s8_623, out s9_624, out s10_625, out s11_626, out t4_627);
	word32 s8_634;
	word32 s4_633;
	word32 a5_632;
	word32 a1_629;
	word32 a2_630;
	word32 a4_631;
	word32 a0_628;
	puts(587678840, out a0_628, out a1_629, out a2_630, out a4_631, out a5_632, out s4_633, out s8_634);
	word32 s8_641;
	word32 s4_640;
	word32 a5_639;
	word32 a4_638;
	word32 a2_637;
	word32 a1_636;
	word32 a0_635;
	Eq_2 s1_105 = puts(587678908, out a0_635, out a1_636, out a2_637, out a4_638, out a5_639, out s4_640, out s8_641);
	Eq_2 s8_104 = 0x00;
	while (s8_104 < s1_105)
	{
		word32 s4_125;
		word32 s1_734;
		word32 s2_735;
		word32 s3_736;
		word32 s5_737;
		word32 s6_738;
		blmac_encr_cntrl_pack.constprop.8(0x01, 0x00, (word32) (word16) s8_104, 0x00, 0x00, 0x00, 0x00, 0x00, dwArgC8, out s1_734, out s2_735, out s3_736, out s4_125, out s5_737, out s6_738);
		do
			;
		while (*(union Eq_8307 *) 0x44B000C4 < 0x00);
		ui32 a5_156;
		Eq_2 a3_160;
		word32 s5_170;
		word32 s1_739;
		word32 a0_740;
		word32 a1_741;
		word32 a2_742;
		word32 a4_743;
		word32 a7_744;
		word32 s2_745;
		word32 s3_746;
		word32 s4_747;
		word32 s6_748;
		word32 s7_749;
		word32 s8_750;
		word32 s9_751;
		word32 s10_752;
		word32 s11_753;
		word32 t4_754;
		Eq_2 ra_163 = printf(ra_153, s4_125 + 0x0510, *(union Eq_9004 *) 0x44B000BC >> 0x08 & 0x00FF, dwLoc58, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_739, out a0_740, out a1_741, out a2_742, out a3_160, out a4_743, out a5_156, out a7_744, out s2_745, out s3_746, out s4_747, out s5_170, out s6_748, out s7_749, out s8_750, out s9_751, out s10_752, out s11_753, out t4_754);
		Eq_2 a3_192;
		word32 s6_203;
		Eq_2 a3_220;
		word32 s7_232;
		word32 s1_755;
		word32 a0_756;
		word32 a1_757;
		word32 a2_758;
		word32 a4_759;
		word32 a5_760;
		word32 a7_761;
		word32 s2_762;
		word32 s3_763;
		word32 s4_764;
		word32 s5_765;
		word32 s7_766;
		word32 s8_767;
		word32 s9_768;
		word32 s10_769;
		word32 s11_770;
		word32 t4_771;
		word32 s1_772;
		word32 a0_773;
		word32 a1_774;
		word32 a2_775;
		word32 a4_776;
		word32 a5_777;
		word32 a7_778;
		word32 s2_779;
		word32 s3_780;
		word32 s4_781;
		word32 s5_782;
		word32 s6_783;
		word32 s8_784;
		word32 s9_785;
		word32 s10_786;
		word32 s11_787;
		word32 t4_788;
		word32 s1_789;
		word32 a0_790;
		word32 a1_791;
		word32 a2_792;
		word32 a3_793;
		word32 a4_794;
		word32 a5_795;
		word32 a7_796;
		word32 s2_797;
		word32 s3_798;
		word32 s4_799;
		word32 s5_800;
		word32 s6_801;
		word32 s7_802;
		word32 s8_803;
		word32 s9_804;
		word32 s10_805;
		word32 s11_806;
		word32 t4_807;
		Eq_2 ra_249 = printf(printf(printf(ra_163, s5_170 + 1336, a3_160, dwLoc58, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_755, out a0_756, out a1_757, out a2_758, out a3_192, out a4_759, out a5_760, out a7_761, out s2_762, out s3_763, out s4_764, out s5_765, out s6_203, out s7_766, out s8_767, out s9_768, out s10_769, out s11_770, out t4_771), s6_203 + 0x053C, a3_192, dwLoc58, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_772, out a0_773, out a1_774, out a2_775, out a3_220, out a4_776, out a5_777, out a7_778, out s2_779, out s3_780, out s4_781, out s5_782, out s6_783, out s7_232, out s8_784, out s9_785, out s10_786, out s11_787, out t4_788), s7_232 + 0x0548, a3_220, dwLoc58, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_789, out a0_790, out a1_791, out a2_792, out a3_793, out a4_794, out a5_795, out a7_796, out s2_797, out s3_798, out s4_799, out s5_800, out s6_801, out s7_802, out s8_803, out s9_804, out s10_805, out s11_806, out t4_807);
		byte * a4_265 = *(byte **) 0x44B000B4;
		dwArg28 = *(byte **) 0x44B000B8 & 0x00FF;
		word32 s1_808;
		word32 a0_809;
		word32 a1_810;
		word32 a2_811;
		word32 a3_812;
		word32 a4_813;
		word32 a5_814;
		word32 a7_815;
		word32 s2_816;
		word32 s3_817;
		word32 s4_818;
		word32 s5_819;
		word32 s6_820;
		word32 s7_821;
		word32 s8_822;
		word32 s9_823;
		word32 s10_824;
		word32 s11_825;
		word32 t4_826;
		ra_153 = printf(ra_249, &g_t23074554, *(byte **) 0x44B000AC >> 0x10 & 0x00FF, a4_265 >> 0x18, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_808, out a0_809, out a1_810, out a2_811, out a3_812, out a4_813, out a5_814, out a7_815, out s2_816, out s3_817, out s4_818, out s5_819, out s6_820, out s7_821, out s8_822, out s9_823, out s10_824, out s11_825, out t4_826);
		dwLoc58 = a4_265 >> 0x18;
		word32 a0_827;
		word32 a1_828;
		word32 a2_829;
		word32 a4_830;
		word32 a5_831;
		word32 s4_832;
		s1_105 = puts(0x230727FC, out a0_827, out a1_828, out a2_829, out a4_830, out a5_831, out s4_832, out s8_104);
	}
	uint32 a1_342;
	word32 a2_643;
	word32 a0_642;
	word32 a4_644;
	word32 a5_645;
	word32 s4_646;
	word32 s8_647;
	puts(0x230745A0, out a0_642, out a1_342, out a2_643, out a4_644, out a5_645, out s4_646, out s8_647);
	uint32 a1_364;
	word32 s1_648;
	word32 a0_649;
	word32 a2_650;
	word32 a3_651;
	word32 a4_652;
	word32 a5_653;
	word32 a7_654;
	word32 s2_655;
	word32 s3_656;
	word32 s4_657;
	word32 s5_658;
	word32 s6_659;
	word32 s7_660;
	word32 s8_661;
	word32 s9_662;
	word32 s10_663;
	word32 s11_664;
	word32 t4_665;
	word32 s1_666;
	word32 a0_667;
	word32 a1_668;
	word32 a2_669;
	word32 a3_670;
	word32 a4_671;
	word32 a5_672;
	word32 a7_673;
	word32 s2_674;
	word32 s3_675;
	word32 s4_676;
	word32 s5_677;
	word32 s6_678;
	word32 s7_679;
	word32 s8_680;
	word32 s9_681;
	word32 s10_682;
	word32 s11_683;
	word32 t4_684;
	Eq_2 ra_404 = printf(printf(ra_153, &g_t230745E4, a1_342 >> 0x10 & 0x00FF, dwLoc58, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_648, out a0_649, out a1_364, out a2_650, out a3_651, out a4_652, out a5_653, out a7_654, out s2_655, out s3_656, out s4_657, out s5_658, out s6_659, out s7_660, out s8_661, out s9_662, out s10_663, out s11_664, out t4_665), &g_t2307460C, a1_364 >> 0x10 & 0x00FF, dwLoc58, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_666, out a0_667, out a1_668, out a2_669, out a3_670, out a4_671, out a5_672, out a7_673, out s2_674, out s3_675, out s4_676, out s5_677, out s6_678, out s7_679, out s8_680, out s9_681, out s10_682, out s11_683, out t4_684);
	uint32 a1_424;
	word32 a0_685;
	word32 a2_686;
	word32 a4_687;
	word32 a5_688;
	word32 s4_689;
	word32 s8_690;
	puts(0x230727FC, out a0_685, out a1_424, out a2_686, out a4_687, out a5_688, out s4_689, out s8_690);
	uint32 a1_446;
	word32 s2_455;
	word32 s1_691;
	word32 a0_692;
	word32 a2_693;
	word32 a3_694;
	word32 a4_695;
	word32 a5_696;
	word32 a7_697;
	word32 s3_698;
	word32 s4_699;
	word32 s5_700;
	word32 s6_701;
	word32 s7_702;
	word32 s8_703;
	word32 s9_704;
	word32 s10_705;
	word32 s11_706;
	word32 t4_707;
	word32 s1_708;
	word32 a0_709;
	word32 a1_710;
	word32 a2_711;
	word32 a3_712;
	word32 a4_713;
	word32 a5_714;
	word32 a7_715;
	word32 s2_716;
	word32 s3_717;
	word32 s4_718;
	word32 s5_719;
	word32 s6_720;
	word32 s7_721;
	word32 s8_722;
	word32 s9_723;
	word32 s10_724;
	word32 s11_725;
	word32 t4_726;
	printf(printf(ra_404, &g_t23074630, a1_424 >> 0x10 & 0x00FF, dwLoc58, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_691, out a0_692, out a1_446, out a2_693, out a3_694, out a4_695, out a5_696, out a7_697, out s2_455, out s3_698, out s4_699, out s5_700, out s6_701, out s7_702, out s8_703, out s9_704, out s10_705, out s11_706, out t4_707), s2_455 + 0x060C, a1_446 >> 0x10 & 0x00FF, dwLoc58, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_708, out a0_709, out a1_710, out a2_711, out a3_712, out a4_713, out a5_714, out a7_715, out s2_716, out s3_717, out s4_718, out s5_719, out s6_720, out s7_721, out s8_722, out s9_723, out s10_724, out s11_725, out t4_726);
	word32 a0_727;
	word32 a1_728;
	word32 a2_729;
	word32 a4_730;
	word32 a5_731;
	word32 s4_732;
	word32 s8_733;
	puts(dwArg28 + 2044, out a0_727, out a1_728, out a2_729, out a4_730, out a5_731, out s4_732, out s8_733);
}

// 2300219C: Register Eq_2 mm_sec_machwkey_wr(Register Eq_2 ra, Register (ptr32 Eq_9677) a0, Stack Eq_2 dwArg0108, Register out (ptr32 Eq_8990) s0Out, Register out (ptr32 Eq_9680) s1Out, Register out (ptr32 Eq_8990) a0Out, Register out Eq_9682 a3Out, Register out ptr32 a4Out, Register out Eq_8307 a5Out, Register out ptr32 s2Out, Register out (ptr32 byte) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      mm_sta_add
//      add_key_to_mac
//      add_mfp_key_to_mac
//      mm_key_add_req_handler
Eq_2 mm_sec_machwkey_wr(Eq_2 ra, struct Eq_9677 * a0, Eq_2 dwArg0108, struct Eq_8990 & s0Out, struct Eq_8990 & s1Out, struct Eq_8990 & a0Out, union Eq_9682 & a3Out, ptr32 & a4Out, union Eq_8307 & a5Out, ptr32 & s2Out, byte & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	Eq_2 ra_176;
	ui32 s3_119;
	struct Eq_8261 * s0_109;
	struct Eq_9692 * s1_38;
	Eq_9693 s2_15 = (word32) a0->b0001;
	ui32 s3_18 = (word32) a0->b0029;
	if (s2_15 == 0x00FF)
	{
		ui32 s0_62 = (s3_18 << 0x02) + (word32) a0->b0000;
		((union Eq_9004 *) 0x44B000BC)->u0 = ~0x00;
		*(ui32 *) 0x44B000C0 = ~0x00;
		ra_176 = vif_mgmt_add_key(ra, a0, s0_62 & 0x00FF, out s0_109, out s1_38, out s3_119);
	}
	else
	{
		if (s2_15 > 11)
			assert_err();
		struct Eq_9763 * s2_39;
		ra_176 = sta_mgmt_add_key(ra, a0, (word32) s2_15.u1 + 8 & 0x00FF, out s0_109, out s1_38, out s2_39, out s3_119);
		*(union Eq_9004 *) 0x44B000BC = (word32) s2_39->w420190F0 << 16 | (word32) s2_39->w420190EE;
		*(ui32 *) 0x44B000C0 = (word32) s2_39->w420190F2;
	}
	struct Eq_9738 * a3_89 = (word32) s1_38->b0028;
	if (a3_89 > (struct Eq_9738 *) 0x03)
		assert_err();
	else
	{
		ui32 a7_102 = (word32) a3_89->b2308DD70;
		ui32 a3_103 = (word32) a3_89->b2308DD74;
		*(byte **) 0x44B000AC = &a3_89->b2308DD70;
		*(byte **) 0x44B000B0 = &a3_89->b2308DD70;
		*(byte **) 0x44B000B4 = &a3_89->b2308DD70;
		struct Eq_9818 * s1_116 = a3_89->ptr2308DD84;
		*(byte **) 0x44B000B8 = &a3_89->b2308DD70;
		struct Eq_8990 * s1_127;
		ptr32 s2_128;
		byte * s3_129;
		ptr32 s5_131;
		word32 s6_199;
		word32 s4_198;
		struct Eq_8990 * s0_126 = blmac_encr_cntrl_pack.constprop.8(0x00, 0x01, s0_109, a3_103, s3_119, (word32) s1_116->b002A, 0x00, a7_102, dwArg0108, out s1_127, out s2_128, out s3_129, out s4_198, out s5_131, out s6_199);
		do
		{
			Eq_8307 a5_140 = *(union Eq_8307 *) 0x44B000C4;
		} while (a5_140 << 0x01 < 0x00);
		s0Out = s0_126;
		s1Out = s1_127;
		a0Out = s0_126;
		a3Out = a5_140 << 0x01;
		a4Out = 0x44B00000;
		a5Out = a5_140;
		s2Out = s2_128;
		s3Out = s3_129;
		s4Out = dwArg04;
		s5Out = s5_131;
		return ra_176;
	}
}

// 230022CC: Register word32 mm_sec_machwkey_del(Register (ptr32 Eq_8261) a0, Stack Eq_2 dwArg0118, Register out ptr32 a2Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out (ptr32 Eq_9848) s3Out, Register out (ptr32 Eq_9849) s6Out)
// Called from:
//      mm_sta_del
//      apm_sta_remove
//      keyMgmtKeyGroupTxDone.isra.1
//      RemoveAPKeyInfo
//      mm_key_del_req_handler
word32 mm_sec_machwkey_del(struct Eq_8261 * a0, Eq_2 dwArg0118, ptr32 & a2Out, ptr32 & a4Out, ptr32 & s2Out, struct Eq_9848 & s3Out, struct Eq_9849 & s6Out)
{
	if (a0 > (struct Eq_8261 *) 0x07)
	{
		struct Eq_9852 * a5_24 = (char *) a0 - 8 & 0x00FF;
		*(union Eq_9004 *) 0x44B000BC = (word32) a5_24->w420190F0 << 16 | (word32) a5_24->w420190EE;
		*(ui32 *) 0x44B000C0 = (word32) a5_24->w420190F2;
		sta_mgmt_del_key(a0);
	}
	else
	{
		((union Eq_9004 *) 0x44B000BC)->u0 = ~0x00;
		*(ui32 *) 0x44B000C0 = ~0x00;
		vif_mgmt_del_key(a0, a1);
	}
	*(byte **) 0x44B000AC = null;
	*(byte **) 0x44B000B0 = null;
	*(byte **) 0x44B000B4 = null;
	*(byte **) 0x44B000B8 = null;
	word32 s1_57;
	ptr32 s2_58;
	struct Eq_9848 * s3_59;
	struct Eq_9849 * s6_62;
	word32 s5_105;
	word32 s4_104;
	blmac_encr_cntrl_pack.constprop.8(0x00, 0x01, a0, 0x00, 0x00, 0x00, 0x00, 0x00, dwArg0118, out s1_57, out s2_58, out s3_59, out s4_104, out s5_105, out s6_62);
	do
		;
	while (*(union Eq_8307 *) 0x44B000C4 << 0x01 < 0x00);
	a2Out = dwArg10;
	a4Out = 0x44B00000;
	s2Out = s2_58;
	s3Out = s3_59;
	s6Out = s6_62;
	return s1_57;
}

// 23002382: Register word32 mm_sec_machwaddr_del(Register (ptr32 Eq_9934) a0, Stack Eq_2 dwArg0118, Register out ptr32 s3Out)
// Called from:
//      mm_sta_del
word32 mm_sec_machwaddr_del(struct Eq_9934 * a0, Eq_2 dwArg0118, ptr32 & s3Out)
{
	((union Eq_9004 *) 0x44B000BC)->u0 = ~0x00;
	*(ui32 *) 0x44B000C0 = ~0x00;
	*(byte **) 0x44B000AC = null;
	*(byte **) 0x44B000B0 = null;
	*(byte **) 0x44B000B4 = null;
	*(byte **) 0x44B000B8 = null;
	ptr32 s3_31;
	word32 s6_71;
	word32 s5_70;
	word32 s4_69;
	word32 s2_68;
	word32 s1_67;
	blmac_encr_cntrl_pack.constprop.8(0x00, 0x01, (char *) a0 + 8 & 0x00FF, 0x00, 0x00, 0x00, 0x00, 0x00, dwArg0118, out s1_67, out s2_68, out s3_31, out s4_69, out s5_70, out s6_71);
	do
		;
	while (*(union Eq_8307 *) 0x44B000C4 << 0x01 < 0x00);
	s3Out = s3_31;
	return 0x44B00000;
}

// 230023D4: void mm_hw_idle_evt(Register Eq_2 a4, Register ptr32 mstatus)
void mm_hw_idle_evt(Eq_2 a4, ptr32 mstatus)
{
	ke_evt_clear(0x00800000, a4, mstatus);
	word32 s1_31;
	word32 a0_32;
	word32 a1_33;
	word32 a4_34;
	word32 a5_35;
	word32 s2_36;
	word32 s3_37;
	word32 s4_38;
	ke_state_set(0x00, 0x00, mstatus, out s1_31, out a0_32, out a1_33, out a4_34, out a5_35, out s2_36, out s3_37, out s4_38);
}

// 230023EC: Register word32 mm_hw_info_set(Register Eq_2 a0, Register Eq_2 a5, Register out ptr32 a5Out)
// Called from:
//      vif_mgmt_register
word32 mm_hw_info_set(Eq_2 a0, Eq_2 a5, ptr32 & a5Out)
{
	struct Eq_10016 * a4_13 = blmac_ap_setf(0x00, a5);
	word32 a5_15 = a4_13->dw004C;
	(a4_13 | 1)->dw004C = a5_15;
	*(word32 *) 0x011C = a5_15;
	((union Eq_2 *) 0x44B080A4)->u0 = 0x00;
	*(struct Eq_10035 **) 0x44B080A8 = null;
	((word32) *((word32) a0 + 3) << 24 | (((word32) (*((word32) a0 + 1)) << 8 | (word32) (*a0)) | (word32) (*((word32) a0 + 2)) << 16))->dw0010 = a5_15;
	struct Eq_10066 * a4_37 = (word32) *((word32) a0 + 5) << 8 | (word32) (*((word32) a0 + 4));
	a4_37->dw0014 = a5_15;
	(a4_37 & -0x0701)->dw004C = a4_37->dw004C;
	g_dw42019E58 = 889423244;
	ptr32 a5_50;
	word32 a4_49 = mm_rx_filter_set(&g_ptr42019000, out a5_50);
	a5Out = a5_50;
	return a4_49;
}

// 23002466: void mm_hw_ap_info_set(Register (ptr32 Eq_10098) a3, Register Eq_2 a5)
// Called from:
//      vif_mgmt_register
void mm_hw_ap_info_set(struct Eq_10098 * a3, Eq_2 a5)
{
	blmac_ap_setf(0x01, a5);
	g_dw42019E58 = 889693580;
	word32 a5_29;
	mm_rx_filter_set(&g_ptr42019000, out a5_29);
	*(word32 *) 0x00040071 = 0x44B08000;
	(a3 | 0x00040001)->dw0074 = a3->dw0074;
}

// 2300249C: Register word32 mm_hw_ap_info_reset(Register Eq_2 a5)
// Called from:
//      vif_mgmt_unregister
word32 mm_hw_ap_info_reset(Eq_2 a5)
{
	blmac_ap_setf(0x00, a5);
	g_dw42019E58 = 889423244;
	word32 a5_30;
	mm_rx_filter_set(&g_ptr42019000, out a5_30);
	*(word32 *) 0x00040071 = 0x44B08000;
	*(union Eq_2 *) 116 = *(union Eq_2 *) 262261;
	return ~0x00040001;
}

// 230024D8: Register Eq_2 mm_back_to_host_idle(Register ptr32 mstatus, Stack Eq_2 dwArg28, Register out ptr32 s2Out)
// Called from:
//      chan_ctxt_op_evt
Eq_2 mm_back_to_host_idle(ptr32 mstatus, Eq_2 dwArg28, ptr32 & s2Out)
{
	word32 a0_7;
	word32 a2_76;
	word32 a4_77;
	word32 s2_78;
	ke_state_get(0x00, dwArg28, out a0_7, out a2_76, out a4_77, out s2_78);
	if (a0_7 == 0x03)
	{
		if ((word32) g_t42018E7A != 0x00)
		{
			ptr32 s2_34;
			word32 s1_79;
			word32 a0_80;
			word32 a1_81;
			word32 a4_82;
			word32 a5_83;
			word32 s3_84;
			word32 s4_85;
			Eq_2 s0_32 = ke_state_set(0x00, 0x00, mstatus, out s1_79, out a0_80, out a1_81, out a4_82, out a5_83, out s2_34, out s3_84, out s4_85);
			s2Out = s2_34;
			return s0_32;
		}
		else
		{
			ptr32 s2_51;
			word32 a4_86;
			Eq_2 s0_49 = mm_active(mstatus, out a4_86, out s2_51);
			s2Out = s2_51;
			return s0_49;
		}
	}
	else
		assert_err();
}

