pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300251E: Register Eq_2 mm_force_idle_req(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      chan_goto_idle_cb
//      chan_tx_cfm
//      chan_ctxt_op_evt
Eq_2 mm_force_idle_req(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg6C, Eq_2 dwArg0108, Eq_2 dwArg0118, ptr32 & s1Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	__csrrc(mstatus, 0x08);
	Eq_2 a4_17;
	word32 s5_95;
	Eq_2 ra_46 = txl_reset(rxl_reset(ra, hal_machw_reset(a4, dwArg18), mstatus, dwArg20, dwArg24, dwArg48, dwArg6C, dwArg0108, out a4_17), a4_17, mstatus, dwArg0118, out s5_95);
	ptr32 a4_65;
	ptr32 s1_69;
	ptr32 s2_70;
	ptr32 s3_71;
	ptr32 s4_72;
	word32 a0_96;
	word32 a1_97;
	word32 a5_98;
	ke_state_set(0x00, 0x03, mstatus, out s1_69, out a0_96, out a1_97, out a4_65, out a5_98, out s2_70, out s3_71, out s4_72);
	g_w42019E6A = 0x00;
	__csrrs(mstatus, 0x08);
	s1Out = s1_69;
	a4Out = a4_65;
	s2Out = s2_70;
	s3Out = s3_71;
	s4Out = s4_72;
	return ra_46;
}

// 2300254C: Register Eq_2 mm_sta_add(Register Eq_2 ra, Register (ptr32 Eq_10270) s1, Register (ptr32 Eq_10270) a0, Register (ptr32 byte) a1, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Register out (ptr32 Eq_10292) s0Out, Register out ptr32 a0Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      mm_sta_add_req_handler
//      me_sta_add_req_handler
Eq_2 mm_sta_add(Eq_2 ra, struct Eq_10270 * s1, struct Eq_10270 * a0, byte * a1, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, struct Eq_8990 & s0Out, ptr32 & a0Out, ptr32 & s4Out, ptr32 & s5Out)
{
	word24 nLoc57_450 = SLICE(dwLoc58, word24, 8);
	ptr32 a0_32;
	byte * s3_38;
	struct Eq_10301 * s7_52;
	ptr32 s4_187;
	struct Eq_8990 * s0_294;
	Eq_2 ra_46 = sta_mgmt_register(ra, a0, a1, a4, a5, s2, dwLoc58, dwLoc10, dwLoc0C, dwArg18, s7, out s0_294, out a0_32, out s3_38, out s4_187, out s7_52);
	ptr32 s2_196 = a0_32;
	if (a0_32 != 0x00)
	{
l230025B8:
		s0Out = s0_294;
		a0Out = s2_196;
		s4Out = s4_187;
		s5Out = s4;
		return dwArg68;
	}
	else
	{
		word32 a0_64;
		byte * s3_297;
		struct Eq_10337 * s1_295 = mm_sec_machwaddr_wr((word32) *s3_38, (word32) s7_52->b0011, dwArgB8, out a0_64, out s2_196, out s3_297, out s4_187);
		s0_294->b0000 = (byte) a0_64;
		s0_294 = (struct Eq_8990 *) &g_t4201A410;
		if ((word32) s1_295->b4201AA3E != 0x00)
			goto l230025B8;
		if ((word32) s1_295->b4201ADD0 == 0x00)
		{
l230025A4:
			s0_294 += s1_295 + 0x05D8;
			s0_294->b0060 = (byte) (word32) *s3_297;
			s2_196 = 0x00;
			goto l230025B8;
		}
		g_b4201B8D9 = (byte) (word32) *s3_297;
		s4_187 = 0x4201C000;
		if ((s1_295->b4201ADD0 & 0x12FFF800) != 0x00)
		{
			(word32) *((word32) g_t4201BBD8 + 0x0181) == 0x00;
			s0_294 = set_psk(ra_46, mstatus, dwLoc28, dwArg18, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgF8, dwArg0118, out s1_295, out s2_196, out s3_297, out s4_187);
			goto l23002610;
		}
		if (((word32) s1_295->b4201ADD1 & 0x02) == 0x00)
			goto l23002610;
		Eq_2 a3_107;
		word32 a1_715;
		word32 a2_716;
		word32 a4_717;
		word32 a5_718;
		strlen((word32) g_t4201BBD8 + 0x0141, out a1_715, out a2_716, out a3_107, out a4_717, out a5_718);
		int32 * s5_132;
		int32 * s6_133;
		word32 a0_720;
		word32 a2_722;
		word32 a3_723;
		word32 s1_719;
		word32 a1_721;
		word32 a7_726;
		word32 a4_724;
		word32 a5_725;
		word32 s3_728;
		word32 s9_732;
		word32 s10_733;
		word32 s8_731;
		word32 a5_742;
		word32 a3_740;
		word32 a0_737;
		word32 s2_727;
		word32 s7_730;
		word32 s4_729;
		word32 s11_734;
		word32 t4_735;
		word32 a4_741;
		word32 t1_736;
		word32 a2_739;
		word32 a1_738;
		Eq_2 ra_148 = memset(printf(ra_46, &g_t2307466C, a3_107, dwLoc58, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_719, out a0_720, out a1_721, out a2_722, out a3_723, out a4_724, out a5_725, out a7_726, out s2_727, out s3_728, out s4_729, out s5_132, out s6_133, out s7_730, out s8_731, out s9_732, out s10_733, out s11_734, out t4_735), fp + -92, 0x00, 44, out t1_736, out a0_737, out a1_738, out a2_739, out a3_740, out a4_741, out a5_742);
		Eq_2 a3_158;
		word32 a4_745;
		word32 a5_746;
		word32 a1_743;
		word32 a2_744;
		Eq_2 a0_157 = strlen(*s6_133 + 0x0141, out a1_743, out a2_744, out a3_158, out a4_745, out a5_746);
		Eq_2 dwLoc58_451 = SEQ(nLoc57_450, (byte) (a0_157 & 0x00FF));
		if ((a0_157 & 0x00FF) != 0x05 && (a0_157 & 0x00FF) != 0x0D)
		{
			if ((a0_157 & 0x00FF) != 0x0A && (a0_157 & 0x00FF) != 0x1A)
			{
				Eq_2 a4_179;
				byte * s3_186;
				word32 a3_770;
				word32 a4_771;
				word32 a3_758;
				word32 a5_759;
				word32 a7_760;
				word32 s5_762;
				word32 t4_769;
				word32 s6_763;
				word32 s11_768;
				word32 s7_764;
				word32 s9_766;
				word32 s10_767;
				word32 s8_765;
				word32 s2_761;
				word32 a2_757;
				word32 a1_756;
				word32 s1_754;
				word32 a0_755;
				sta_mgmt_unregister(printf(ra_148, &g_t23074684, a3_158, dwLoc58_451, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_754, out a0_755, out a1_756, out a2_757, out a3_758, out a4_179, out a5_759, out a7_760, out s2_761, out s3_186, out s4_187, out s5_762, out s6_763, out s7_764, out s8_765, out s9_766, out s10_767, out s11_768, out t4_769), 0x4201A410, (word32) *s3_186, a4_179, out a3_770, out a4_771);
				s2_196 = 0x01;
				goto l230025B8;
			}
			int32 s8_214 = a0_157 & 0x00FF;
			if ((a0_157 & 1) != 0x00)
				s8_214 = a0_157 & 0x00FE;
			if (s8_214 != 0x00)
			{
				int32 s7_221 = 0x00;
				struct Eq_10701 * s5_222 = *s5_132 + 0x0141;
				do
				{
					++s5_222;
					((s7_221 >> 0x01) + (fp + -48))->b0FDC = (byte) ((ascii_to_hex((word32) s5_222->b0000) << 4) + ascii_to_hex((word32) s5_222->bFFFFFFFF));
					s7_221 += 0x02;
				} while (s7_221 < s8_214);
			}
		}
		else
		{
			word32 a3_749;
			word32 a5_751;
			word32 a6_752;
			word32 a7_753;
			word32 a4_750;
			word32 a2_748;
			word32 a1_747;
			memcpy(fp + -84, *s5_132 + 0x0141, a0_157 & 0x00FF, out a1_747, out a2_748, out a3_749, out a4_750, out a5_751, out a6_752, out a7_753);
		}
		word32 a0_285;
		word32 a3_772;
		word32 a4_773;
		word32 s5_775;
		word32 a5_774;
		mm_sec_machwkey_wr(ra_148, fp + -92, dwArgA8, out s0_294, out s1_295, out a0_285, out a3_772, out a4_773, out a5_774, out s2_196, out s3_297, out s4_187, out s5_775);
		g_b4200E8F4 = (byte) a0_285;
l23002610:
		struct Eq_10425 * a4_356;
		word32 a5_348 = s0_294 + (s1_295 + 0x05D8);
		if ((a5_348->dw03E8 & 0x12000000) != 0x00)
			a4_356 = (word32) a5_348->b03EF;
		else
		{
			if (((word32) a5_348->b03E9 & 0x08) == 0x00)
				goto l23002642;
			a4_356 = (word32) a5_348->b03EF;
		}
		s0_294 = supplicantEnable(a4_356, s1, dwArgF8, dwArg0118, out s1_295, out s2_196, out s3_297, out s4_187);
l23002642:
		if (CONVERT(Mem349[s1_295 + 0x05D8 + s0_294 + 86:byte], byte, word32) == 0x00)
			goto l230025A4;
		goto l230025B8;
	}
}

// 2300279A: Register Eq_2 mm_sta_del(Register Eq_2 ra, Register word32 s1, Register (ptr32 Eq_9934) a0, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg8C, Stack word32 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      mm_sta_del_req_handler
Eq_2 mm_sta_del(Eq_2 ra, word32 s1, struct Eq_9934 * a0, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg8C, word32 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, ptr32 & a3Out, ptr32 & a4Out)
{
	struct Eq_10778 * s6_140 = (word32) a0->b420190EA;
	struct Eq_9934 * s3_102 = a0;
	if ((word32) s6_140->b4201AA3E == 0x00)
	{
		s6_140->b4201AA48 = ~0x00;
		if ((word32) s6_140->b4201ADD0 != 0x00)
		{
			Eq_2 s1_121 = 0x4201A410;
			if ((s6_140->b4201ADD0 & 0x12FFF800) != 0x00)
			{
				struct Eq_10831 * s2_157;
				word32 s3_368;
				word32 s6_369;
				word32 a4_367;
				word32 a2_366;
				mm_sec_machwkey_del((word32) g_b4201B8DC, dwArgF8, out a2_366, out a4_367, out s2_157, out s3_368, out s6_369);
				struct Eq_10847 * s2_176;
				word32 s3_372;
				word32 s6_373;
				word32 a2_370;
				word32 a4_371;
				mm_sec_machwkey_del((word32) s2_157->b0003, dwArgF8, out a2_370, out a4_371, out s2_176, out s3_372, out s6_373);
				Eq_2 a4_190;
				word32 a2_374;
				word32 s2_375;
				word32 s3_376;
				word32 s6_377;
				mm_sec_machwkey_del((word32) s2_176->b0005, dwArgF8, out a2_374, out a4_190, out s2_375, out s3_376, out s6_377);
				struct Eq_10879 * s2_212;
				word32 t1_378;
				word32 a0_379;
				word32 a1_380;
				word32 a2_381;
				word32 a3_382;
				word32 a4_383;
				word32 a5_384;
				ra = memset(supplicantDisable(ra, a4_190, dwArg0118, dwArg0138, dwArg0158, out s2_212), s2_212->dw0008 + 0x04, 0x00, 0x0022, out t1_378, out a0_379, out a1_380, out a2_381, out a3_382, out a4_383, out a5_384);
				s1_121 = remove_psk(ra, dwArgD8, dwArgE8, dwArgF8, dwArg0128, dwArg0138, dwArg0158, out s3_102, out s6_140);
			}
			else if (((word32) s6_140->b4201ADD1 & 0x02) != 0x00)
			{
				struct Eq_8261 * a0_125 = (word32) g_b4200D8F4;
				if (a0_125 != (struct Eq_8261 *) 0x00FF)
				{
					word32 a2_418;
					word32 a4_419;
					word32 s2_420;
					s1_121 = mm_sec_machwkey_del(a0_125, dwArgF8, out a2_418, out a4_419, out s2_420, out s3_102, out s6_140);
				}
			}
			Mem265[s1_121 + (s6_140 + 0x05D8) + 1000:byte] = 0x00;
		}
	}
	else
	{
		Eq_2 a4_34 = (word32) a0->b420190EC;
		if (a4_34 == 0x01)
		{
			ui32 a5_38 = (word32) s6_140->b4201AD32 + ~0x00 & 0x00FF;
			s6_140->b4201AD32 = (byte) a5_38;
			if (a5_38 == 0x00)
			{
				ui32 s1_44 = (word32) s6_140->b4201AA3F + 0x0A & 0x00FF;
				Eq_2 a0_49;
				word32 s1_58;
				ptr32 s2_59;
				word32 s0_385;
				word32 a1_386;
				word32 a2_387;
				word32 a3_388;
				word32 a4_389;
				word32 a5_390;
				word32 a6_391;
				word32 s3_392;
				word32 s4_393;
				word32 s8_394;
				Eq_2 ra_56 = ke_msg_alloc(ra, 73, 0x0D, 0x02, a4_34, mstatus, dwLoc08, out s0_385, out s1_58, out a0_49, out a1_386, out a2_387, out a3_388, out a4_389, out a5_390, out a6_391, out s2_59, out s3_392, out s4_393, out s8_394);
				(s2_59 + (s1_44 + 432))->b001C = 0x00;
				a0_49->u1 = (byte) s1_58;
				((word32) a0_49 + 1)->u1 = 0x00;
				word32 s1_395;
				word32 a0_396;
				word32 a1_397;
				word32 a2_398;
				word32 a3_399;
				word32 a4_400;
				word32 a5_401;
				word32 s2_402;
				word32 s3_403;
				word32 s4_404;
				word32 s8_405;
				Eq_2 s0_77 = ke_msg_send(a0_49, mstatus, out s1_395, out a0_396, out a1_397, out a2_398, out a3_399, out a4_400, out a5_401, out s2_402, out s3_403, out s4_404, out s8_405);
				word32 s0_406;
				word32 s1_407;
				word32 a1_408;
				word32 a2_409;
				word32 a4_410;
				word32 s4_411;
				word32 s5_412;
				word32 s6_413;
				word32 s7_414;
				word32 s9_415;
				word32 s10_416;
				word32 s11_417;
				ra = apm_tx_int_ps_clear(ra_56, s0_77, (word32) *((word32) s0_77 + 87) + 0x0A & 0x00FF, s1_44 + 432, mstatus, s2, dwArg48, dwArg58, dwArg8C, dwArgF8, out s0_406, out s1_407, out a1_408, out a2_409, out a4_410, out s3_102, out s4_411, out s5_412, out s6_413, out s7_414, out s9_415, out s10_416, out s11_417);
			}
		}
	}
	struct Eq_10653 * s3_283;
	Eq_2 a4_276 = mm_sec_machwaddr_del(s3_102, dwArgF8, out s3_283);
	0x00 = dwArgA8;
	ptr32 a3_305;
	ptr32 a4_306;
	Eq_2 ra_308 = sta_mgmt_unregister(ra, s1, s3_283, a4_276, out a3_305, out a4_306);
	a3Out = a3_305;
	a4Out = a4_306;
	return ra_308;
}

// 230028E4: Register Eq_2 mm_cfg_element_keepalive_timestamp_update(Register Eq_2 a4, Register out Eq_2 a5Out)
// Called from:
//      rxu_cntrl_frame_handle
Eq_2 mm_cfg_element_keepalive_timestamp_update(Eq_2 a4, union Eq_2 & a5Out)
{
	word32 a5_19;
	Eq_2 a0_6 = xTaskGetTickCount(out a5_19);
	Eq_2 a5_10 = *((word32) a4 + 36);
	*((word32) a0_6 + 40) = a5_10;
	*((word32) a4 + 37) = a5_10;
	a5Out = a5_10;
	return (word32) a4 + 1;
}

// 23002902: Register Eq_2 mm_send_connection_loss_ind(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Register out (ptr32 Eq_11172) s1Out, Register out ptr32 a4Out)
// Called from:
//      mm_ap_probe_cfm
//      ps_enable_cfm
//      ps_disable_cfm
//      vif_mgmt_switch_channel
Eq_2 mm_send_connection_loss_ind(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, struct Eq_11172 & s1Out, ptr32 & a4Out)
{
	Eq_2 a0_16;
	struct Eq_11175 * s0_24;
	word32 s1_60;
	word32 a1_61;
	word32 a2_62;
	word32 a3_63;
	word32 a4_64;
	word32 a5_65;
	word32 a6_66;
	word32 s2_67;
	word32 s3_68;
	word32 s4_69;
	word32 s8_70;
	Eq_2 ra_23 = ke_msg_alloc(ra, 67, 0x06, 0x01, a4, mstatus, dwArg08, out s0_24, out s1_60, out a0_16, out a1_61, out a2_62, out a3_63, out a4_64, out a5_65, out a6_66, out s2_67, out s3_68, out s4_69, out s8_70);
	a0_16->u1 = (byte) (word32) s0_24->b0057;
	ptr32 a4_42;
	struct Eq_11172 * s1_46;
	word32 a0_71;
	word32 a1_72;
	word32 a2_73;
	word32 a3_74;
	word32 a5_75;
	word32 s2_76;
	word32 s3_77;
	word32 s4_78;
	word32 s8_79;
	ke_msg_send(a0_16, mstatus, out s1_46, out a0_71, out a1_72, out a2_73, out a3_74, out a4_42, out a5_75, out s2_76, out s3_77, out s4_78, out s8_79);
	s1Out = s1_46;
	a4Out = a4_42;
	return ra_23;
}

// 2300292A: void mm_ap_probe_cfm(Register Eq_2 ra, Register (ptr32 Eq_11239) a0, Register ui32 a1, Register ptr32 mstatus, Stack Eq_2 dwArg08)
void mm_ap_probe_cfm(Eq_2 ra, struct Eq_11239 * a0, ui32 a1, ptr32 mstatus, Eq_2 dwArg08)
{
	if (a1 << 0x08 >= 0x00)
	{
		word32 s1_62;
		word32 a4_63;
		mm_send_connection_loss_ind(ra, a1 << 0x08, mstatus, dwArg08, out s1_62, out a4_63);
	}
	else
		a0->b0074 = 0x00;
}

