pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300293A: Register word32 mm_check_rssi(Register Eq_2 ra, Register Eq_2 a0, Register Eq_11262 a1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg74, Stack word32 dwArgB4, Stack Eq_2 dwArg0128, Register out Eq_11262 s1Out, Register out Eq_11269 s2Out, Register out Eq_11262 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out Eq_11262 s6Out)
// Called from:
//      mm_check_beacon
word32 mm_check_rssi(Eq_2 ra, Eq_2 a0, Eq_11262 a1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg74, word32 dwArgB4, Eq_2 dwArg0128, union Eq_11262 & s1Out, union Eq_11269 & s2Out, union Eq_11262 & s3Out, ptr32 & s4Out, ptr32 & s5Out, union Eq_11262 & s6Out)
{
	Eq_2 s0_115;
	Eq_11262 s6_21 = (int32) *((word32) a0 + 117);
	Eq_11262 s1_100 = (int32) *((word32) a0 + 118);
	ptr32 s5_23 = (word32) *((word32) a0 + 0x0077);
	Eq_11269 s2_105 = (word32) *((word32) a0 + 0x0078);
	*((word32) a0 + 117) = (byte) a1;
	Eq_11262 s3_108 = a1;
	word32 a5_37;
	Eq_2 a4_129 = bl60x_current_time_us(fp + -40, out a5_37);
	if (s6_21 != 0x00)
	{
		a4_129 = a3 - g_dw4200DCA0;
		s0_115 = dwArg74;
		int32 a5_46 = a5_37 - dwArgB4 - (word32) (a3 < a4_129);
		if (a5_46 <= 0x00 && (a5_46 != 0x00 || a4_129 <= 2000000))
		{
l230029D6:
			if (s1_100 != 0x00)
			{
				int32 a5_104 = (int32) (byte) s5_23;
				if (s2_105 == 0x00)
				{
					if (s3_108 < s6_21)
					{
						s1_100 -= a5_104;
						s2_105 = (word32) (s3_108 < s1_100);
					}
				}
				else if (s6_21 < s3_108)
				{
					s1_100 = (word32) ((word32) s1_100.u0 + a5_104 < s3_108);
					s2_105 = s1_100 ^ 1;
				}
				if ((word32) *((word32) s0_115 + 0x0078) != s2_105)
				{
					Eq_2 a0_132;
					struct Eq_11427 * s0_140;
					word32 s2_142;
					word32 s3_143;
					word32 s1_311;
					word32 a1_312;
					word32 a2_313;
					word32 a3_314;
					word32 a4_315;
					word32 a5_316;
					word32 a6_317;
					word32 s4_318;
					word32 s8_319;
					ke_msg_alloc(ra, 87, 0x0D, 0x03, a4_129, mstatus, dwLoc18, out s0_140, out s1_311, out a0_132, out a1_312, out a2_313, out a3_314, out a4_315, out a5_316, out a6_317, out s2_142, out s3_143, out s4_318, out s8_319);
					word32 a4_150 = (word32) s0_140->b0057;
					*((word32) a0_132 + 1) = (byte) s2_142;
					*((word32) a0_132 + 2) = (byte) s3_143;
					a0_132->u1 = (byte) a4_150;
					word32 a0_320;
					word32 a1_321;
					word32 a2_322;
					word32 a3_323;
					word32 a4_324;
					word32 a5_325;
					word32 s4_326;
					word32 s8_327;
					s0_115 = ke_msg_send(a0_132, mstatus, out s1_100, out a0_320, out a1_321, out a2_322, out a3_323, out a4_324, out a5_325, out s2_105, out s3_108, out s4_326, out s8_327);
				}
				*((word32) s0_115 + 0x0078) = (byte) s2_105;
			}
			0x00 = (uint16) dwArg0128;
			s1Out = s1_100;
			s2Out = s2_105;
			s3Out = s3_108;
			s4Out = dwArg78;
			s5Out = s5_23;
			s6Out = s6_21;
			return dwArgE4;
		}
	}
	word32 s8_303;
	Eq_2 a0_59;
	word32 a5_64;
	struct Eq_11316 * s0_67;
	word32 s2_69;
	word32 s3_70;
	struct Eq_11319 * s4_71;
	word32 a2_299;
	word32 a1_298;
	word32 s1_297;
	word32 a3_300;
	word32 a4_301;
	word32 a6_302;
	ra = ke_msg_alloc(ra, 87, 0x0D, 0x03, a4_129, mstatus, dwLoc18, out s0_67, out s1_297, out a0_59, out a1_298, out a2_299, out a3_300, out a4_301, out a5_64, out a6_302, out s2_69, out s3_70, out s4_71, out s8_303);
	word32 a4_77 = (word32) s0_67->b0057;
	*((word32) a0_59 + 1) = (byte) s2_69;
	*((word32) a0_59 + 2) = (byte) s3_70;
	a0_59->u1 = (byte) a4_77;
	s4_71->dw0000 = a4_77;
	s4_71->dw0004 = a5_64;
	word32 a0_304;
	word32 a1_305;
	word32 a2_306;
	word32 a3_307;
	word32 a5_308;
	word32 s4_309;
	word32 s8_310;
	s0_115 = ke_msg_send(a0_59, mstatus, out s1_100, out a0_304, out a1_305, out a2_306, out a3_307, out a4_129, out a5_308, out s2_105, out s3_108, out s4_309, out s8_310);
	goto l230029D6;
}

// 23002A3E: Register Eq_2 mm_send_csa_traffic_ind(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Register out Eq_2 s0Out, Register out (ptr32 Eq_11505) s1Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      mm_check_beacon
//      mm_sta_tbtt
//      me_beacon_check
Eq_2 mm_send_csa_traffic_ind(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, union Eq_2 & s0Out, struct Eq_11505 & s1Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	Eq_2 a0_20;
	word32 s0_28;
	word32 s1_29;
	word32 a1_72;
	word32 a2_73;
	word32 a3_74;
	word32 a4_75;
	word32 a5_76;
	word32 a6_77;
	word32 s2_78;
	word32 s3_79;
	word32 s4_80;
	word32 s8_81;
	Eq_2 ra_27 = ke_msg_alloc(ra, 89, 0x0D, 0x02, a4, mstatus, dwArg08, out s0_28, out s1_29, out a0_20, out a1_72, out a2_73, out a3_74, out a4_75, out a5_76, out a6_77, out s2_78, out s3_79, out s4_80, out s8_81);
	a0_20->u1 = (byte) s1_29;
	*((word32) a0_20 + 1) = (byte) s0_28;
	ptr32 a3_46;
	struct Eq_11505 * s1_51;
	ptr32 s2_52;
	ptr32 s3_53;
	ptr32 s4_54;
	ptr32 s8_55;
	word32 a0_82;
	word32 a1_83;
	word32 a2_84;
	word32 a4_85;
	word32 a5_86;
	s0Out = ke_msg_send(a0_20, mstatus, out s1_51, out a0_82, out a1_83, out a2_84, out a3_46, out a4_85, out a5_86, out s2_52, out s3_53, out s4_54, out s8_55);
	s1Out = s1_51;
	a3Out = a3_46;
	s2Out = s2_52;
	s3Out = s3_53;
	s4Out = s4_54;
	s8Out = s8_55;
	return ra_27;
}

// 23002A6C: Register Eq_2 mm_check_beacon(Register Eq_2 ra, Register (ptr32 Eq_11576) a1, Register Eq_2 a3, Register (ptr32 Eq_11578) a4, Register (ptr32 Eq_11579) a5, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg5C, Stack word32 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg010C, Stack word32 dwArg0148, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 s9Out, Register out Eq_11596 s10Out)
// Called from:
//      rxl_cntrl_evt
Eq_2 mm_check_beacon(Eq_2 ra, struct Eq_11576 * a1, Eq_2 a3, struct Eq_11578 * a4, struct Eq_11579 * a5, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg5C, word32 dwArg64, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArg010C, word32 dwArg0148, ptr32 & s1Out, ptr32 & a0Out, ptr32 & s9Out, union Eq_11596 & s10Out)
{
	struct Eq_11597 * a0_31 = a5->ptr0008;
	Eq_8320 s7_117 = (word32) a0_31->w001C;
	word32 a5_37 = a4->dw0000;
	a1->b0074 = 0x00;
	a4->dw0001 = a5_37;
	struct Eq_11597 * s5_104 = a0_31;
	if ((word32) a1->b007A != 0x00)
	{
		struct Eq_11636 * s0_60;
		word32 s1_661;
		word32 s2_662;
		word32 s3_663;
		word32 s8_665;
		word32 s4_664;
		ra = mm_send_csa_traffic_ind(ra, &a4->dw0001, mstatus, dwLoc48, out s0_60, out s1_661, out a3, out s2_662, out s3_663, out s4_664, out s8_665);
		s0_60->b007A = 0x00;
	}
	Eq_2 a4_73 = *(union Eq_2 *) 0x44B00120;
	Eq_2 s0_125 = *((word32) a4_73 + 0x006C);
	if ((word32) a4_73 + (30000000 - a4_73) < 0x00 && (word32) g_b42018E7B != 0x00)
	{
		word32 a0_91;
		struct Eq_11712 * s1_100;
		word32 s4_671;
		word32 s6_672;
		word32 a4_667;
		word32 a5_668;
		word32 s2_669;
		word32 s3_670;
		ra = txl_frame_send_null_frame(ra, (word32) *((word32) s0_125 + 96), null, fflags, frm, mstatus, dwLoc08, dwArg28, dwArg5C, dwArg78, dwArg98, dwArgB8, dwArg0148, out s0_125, out s1_100, out a0_91, out a3, out a4_667, out a5_668, out s2_669, out s3_670, out s4_671, out s5_104, out s6_672, out s7_117);
		if (a0_91 == 0x00)
			s1_100->ptr0120->t006C = s0_125;
	}
	word32 s1_144;
	struct Eq_11659 * s2_145;
	struct Eq_11660 * s3_146;
	struct Eq_11661 * s5_148;
	struct Eq_11692 ** s6_149;
	word32 s4_147;
	struct Eq_11664 * s0_143 = mm_check_rssi(ra, s0_125, (int32) s5_104->b0033, a3, mstatus, dwArg24, dwArg64, dwArgD8, out s1_144, out s2_145, out s3_146, out s4_147, out s5_148, out s6_149);
	word32 a4_666;
	struct Eq_11679 * a0_158 = co_crc32(&s2_145->b001F + 1, 0x04, null, out a4_666);
	*s6_149 = (struct Eq_11692 **) null;
	struct Eq_11692 * s8_165 = &s2_145->b001F + 5;
	Eq_11699 s1_166 = (word32) (word16) s1_144;
	word32 a5_169 = 0x05;
	Eq_11704 a4_170 = ~0x01;
	while (s1_166 > 0x01)
	{
		Eq_11683 s9_175 = (word32) s8_165->b0001;
		word32 a3_176 = (word32) s8_165->b0000;
		struct Eq_11679 * s10_177 = s8_165 + 1;
		if ((word32) s9_175 + 1 >= s1_166)
			break;
		if (a3_176 == a5_169)
			*s6_149 = (struct Eq_11692 **) s8_165;
		else
		{
			a0_158 = co_crc32(s10_177, s9_175, a0_158, out a4_170);
			a5_169 = 0x05;
		}
		s1_166 = CONVERT(SLICE(s1_166 + (a4_170 - s9_175), word16, 0), word16, word32);
		s8_165 = s10_177 + s9_175;
	}
	a0_158->ptr0070 = s0_143;
	struct Eq_8321 * a4_243 = (word32) s2_145->b001E << 16 | ((word32) s2_145->b001D << 8 | (word32) s2_145->b001C);
	ptr32 s9_218 = (word32) s3_146->w0016;
	Eq_2 s3_232 = (word32) s2_145->b001B << 24 | ((word32) s2_145->b001A << 16 | ((word32) s2_145->b0019 << 8 | (word32) s2_145->b0018));
	Eq_11596 s10_237 = s5_148->t0020;
	Eq_2 s8_247 = (word32) s2_145->b001F << 24 | a4_243;
	if ((word32) s0_143->w005C == 0x00)
	{
		struct Eq_11692 * a5_249 = *s6_149;
	}
	word32 a0_268;
	struct Eq_8321 * a4_272;
	word32 s2_673;
	hal_machw_rx_duration(s7_117, a4_243, mstatus, dwLoc18, out a0_268, out a4_272, out s2_673);
	ui32 a0_280;
	word32 s2_287;
	word32 a4_674;
	Eq_2 s1_286 = hal_machw_rx_duration(0x18, a4_272, mstatus, dwLoc18, out a0_280, out a4_674, out s2_287);
	word32 a1_297;
	word32 a3_675;
	word32 a5_677;
	word32 a4_676;
	Eq_2 a0_296 = __udivdi3(s3_232, s8_247, s1_286, s1_286 >> 0x1F, out a1_297, out a3_675, out a4_676, out a5_677);
	Eq_2 a5_309 = s3_232 - a0_280;
	word32 a0_313 = (word32) (a0_296 < s1_286);
	uint32 s8_311 = s8_247 - (word32) (s3_232 < a5_309);
	word32 a4_312 = a0_296 + s1_286;
	uint32 a1_314 = (word32) s1_286 + a1_297 + a0_313;
	if (a1_314 < s8_311 || s8_311 == a1_314 && a4_312 < a5_309)
		a5_309 = a4_312;
	Eq_11945 a5_348 = (word32) a5_309 + ((word32) s1_286 + s2_287) - ((s3_232 - s10_237) + (a0_268 - a0_280)) - (s9_218 + s2_287);
	Eq_2 a4_347 = 0xFF000380 - *((union Eq_2 *) 0x44B00120);
	Eq_11959 a3_349 = (word32) a5_348 - 400;
	if (a5_348 + a4_347 < 0x00)
		a3_349 = (word32) s1_286 + ((word32) a5_348 - 400);
	Eq_2 a5_356 = *(union Eq_2 *) 0x44B080A4;
	Eq_2 s0_358 = *((word32) a5_356 + 36);
	Eq_2 a1_360 = (word32) a3_349 + (*((union Eq_2 *) 0x44B00120) - a5_356);
	if (a1_360 != a5_356)
	{
		word32 a4_681;
		word32 a5_682;
		word32 s2_683;
		word32 a1_679;
		word32 s1_678;
		word32 s8_685;
		word32 a2_680;
		word32 s3_684;
		mm_timer_set((word32) s0_358 + 24, a1_360, a4_347, mstatus, out s1_678, out a0_313, out a1_679, out a2_680, out a4_681, out a5_682, out s2_683, out s3_684, out s4_147, out s8_685);
	}
	0x00 = (uint16) dwArg010C;
	s1Out = dwLoc4C;
	a0Out = (word32) (a0_313 - s4_147 != 0x00);
	s9Out = s9_218;
	s10Out = s10_237;
	return dwLoc08;
}

