pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 23002CAC: void mm_sta_tbtt(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_12026) s1, Register (ptr32 Eq_12027) a0, Register Eq_2 s2, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack word32 dwArg0198)
void mm_sta_tbtt(Eq_2 ra, Eq_2 s0, struct Eq_12026 * s1, struct Eq_12027 * a0, Eq_2 s2, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0168, word32 dwArg0198)
{
	if ((word32) a0->t0058 == 0x00)
		return;
	word32 a5_13 = (word32) a0->b0079;
	struct Eq_12027 * s0_14 = a0;
	if (a5_13 != 0x00)
	{
		uint32 a5_16 = a5_13 + ~0x00 & 0x00FF;
		a0->b0079 = (byte) a5_16;
		if (a5_16 <= 0x01)
		{
			vif_mgmt_switch_channel(ra, 0x01, s2, mstatus, dwArg08, dwArg18, dwArg78, dwArg88, dwArgE8, dwArg0148);
			return;
		}
		if (a5_16 == 0x02)
		{
			word32 a3_360;
			word32 s2_361;
			word32 s3_362;
			word32 s4_363;
			word32 s8_364;
			ra = mm_send_csa_traffic_ind(ra, 0x02, mstatus, dwLoc08, out s0_14, out s1, out a3_360, out s2_361, out s3_362, out s4_363, out s8_364);
		}
	}
	Eq_2 a4_67;
	struct Eq_8927 * a5_73;
	Eq_2 s0_94;
	word32 s9_356;
	word32 s10_357;
	word32 s7_355;
	word32 s6_354;
	word32 s5_353;
	word32 s4_352;
	word32 s3_351;
	word32 a4_350;
	word32 a3_349;
	word32 a2_348;
	word32 a1_347;
	word32 s1_346;
	word32 s3_345;
	word32 s2_344;
	word32 s8_343;
	word32 s4_342;
	word32 s3_341;
	word32 a5_339;
	word32 s2_340;
	word32 a1_337;
	word32 a2_338;
	word32 s1_335;
	word32 a0_336;
	Eq_2 ra_93 = chan_tbtt_switch_update(ra, vif_mgmt_bcn_to_prog(mm_timer_set((char *) s0_14 + 24, s1 + s1->dw0004 / 8, (word32) s0_14->t0060 + 432, mstatus, out s1_335, out a0_336, out a1_337, out a2_338, out a4_67, out a5_339, out s2_340, out s3_341, out s4_342, out s8_343), a4_67, mstatus, out a5_73, out s2_344, out s3_345), 432, a5_73, mstatus, dwLoc08, dwArg98, dwArg0108, dwArg0168, out s0_94, out s1_346, out a1_347, out a2_348, out a3_349, out a4_350, out s3_351, out s4_352, out s5_353, out s6_354, out s7_355, out s9_356, out s10_357);
	struct Eq_12132 * a5_112;
	word32 a4_359;
	word32 a3_358;
	if (chan_is_on_channel(s0_94, out a3_358, out a4_359, out a5_112) == 0x00)
		return;
	struct Eq_12189 * s0_115 = a5_112->ptr0004;
	(a5_112 | 1)->ptr0004 = s0_115;
	Eq_12198 a5_121 = (word32) s0_115->b0074 + 0x01 & 0x00FF;
	s0_115->b0074 = (byte) a5_121;
	if (a5_121 <= 100)
	{
		if (a5_121 != 100)
			return;
		word32 s0_377;
		word32 a3_378;
		word32 s3_379;
		chan_bcn_detect_start(ra_93, s0, mstatus, out s0_377, out a3_378, out s3_379);
	}
	else
	{
		struct Eq_11722 * a0_152 = (word32) s0_115->b0060;
		word32 s0_365;
		word32 s1_366;
		word32 a0_367;
		word32 a3_368;
		word32 a4_369;
		word32 a5_370;
		word32 s2_371;
		word32 s3_372;
		word32 s4_373;
		word32 s5_374;
		word32 s6_375;
		word32 s7_376;
		txl_frame_send_null_frame(ra_93, a0_152, &g_t2300292A, fflags, frm, mstatus, dwArg48, dwArg78, dwArgAC, dwArgC8, dwArgE8, dwArg0108, dwArg0198, out s0_365, out s1_366, out a0_367, out a3_368, out a4_369, out a5_370, out s2_371, out s3_372, out s4_373, out s5_374, out s6_375, out s7_376);
	}
}

Eq_2 g_t23002CC8 = 
	{
		3235
	};
// 23002D80: Register (ptr32 Eq_12262) mm_get_rsn_wpa_ie(Register (ptr32 Eq_12262) a0, Register Eq_2 a1, Register out ptr32 a4Out)
// Called from:
//      keyMgmtFormatWpaRsnIe
struct Eq_12262 * mm_get_rsn_wpa_ie(struct Eq_12262 * a0, Eq_2 a1, ptr32 & a4Out)
{
	struct Eq_12265 * a5_19 = (word32) a0->b420190EA;
	ptr32 a4_26;
	word32 a1_47;
	word32 a2_48;
	word32 a3_49;
	word32 a5_50;
	word32 a6_51;
	word32 a7_52;
	memcpy(a1, (char *) a5_19 + 1107406297, (word32) a5_19->b4201ADF9, out a1_47, out a2_48, out a3_49, out a4_26, out a5_50, out a6_51, out a7_52);
	struct Eq_12262 * a0_39 = (word32) a5_19->b4201ADF9;
	a4Out = a4_26;
	return a0_39;
}

// 23002DCE: Register Eq_2 mm_tim_update_proceed(Register Eq_2 a0, Register out (ptr32 Eq_12299) a5Out)
// Called from:
//      mm_tim_update
//      mm_bcn_transmitted
Eq_2 mm_tim_update_proceed(Eq_2 a0, struct Eq_12299 & a5Out)
{
	Eq_2 a4_18;
	uint32 a3_9 = (word32) *a0;
	struct Eq_12299 * a5_11 = (word32) *((word32) a0 + 3);
	word32 t3_12 = (word32) *((word32) a0 + 2);
	if (a3_9 == 0x00)
	{
		a5_11 = (struct Eq_12299 *) ((char *) a5_11 + 0x05D8);
		a4_18 = (char *) a5_11 + 1107405288;
		if (t3_12 != 0x00)
		{
			a5_11->b4201AD2E = 0x01;
			a5_11 = (struct Eq_12299 *) 0x01;
		}
		else
			a5_11->b4201AD2E = 0x00;
	}
	else
	{
		uint32 a6_22 = a3_9 >> 0x03 & 0x00FF;
		word32 a7_24 = a6_22 + (a5_11 + 0x42047264);
		ui32 a1_26 = (word32) *a7_24;
		ui32 a3_28 = 0x01 << (a3_9 & 7);
		a4_18 = (a5_11 << 0x03) + 0x42047360;
		ui32 t1_30 = a3_28 & 0x00FF & a1_26;
		if (t3_12 != 0x00)
		{
			if (t1_30 == 0x00)
			{
				*a7_24 = (byte) (a3_28 & 0x00FF | a1_26);
				uint32 t1_164 = (word32) a5_11->t4201AD2C;
				a5_11->w4201AD24 = (word16) ((word32) a5_11->w4201AD24 + 0x01);
				if (a6_22 < t1_164)
				{
					a5_11->t4201AD2C = (byte) (a6_22 & 0x00FE);
					Mem175[a5_11 + 0x42047264 + (a6_22 & 0x00FE) + 28:word32] = a5_11 + 0x42047AB8;
				}
				if ((word32) a5_11->b4201AD2D < a6_22)
				{
					a5_11->b4201AD2D = (byte) a6_22;
					a5_11->ptr42047AD8 = a7_24;
				}
				word32 a2_202 = (word32) (word16) ((word32) a5_11->b4201AD2D + 0x06 - (word32) a5_11->t4201AD2C);
				a5_11->t4201AD22 = (word16) a2_202;
				*((word32) a4_18 + 1) = (byte) (a2_202 + ~0x01);
				((word32) a4_18 + 4)->u1 = (byte) (word32) a5_11->t4201AD2C;
				*((word32) a4_18 + 16) = &a5_11->b4201AD2E + 0x0002CD8A;
				a5_11->ptr42047AD0 = &a5_11->b4201AD2E + 0x0002CD8A;
				a4_18 = &a5_11->b4201AD2E + 0x0002CD8A;
				a5_11 = (struct Eq_12299 *) ((char *) a5_11 + 60);
			}
		}
		else if (t1_30 != 0x00)
		{
			*a7_24 = (byte) (~a3_28 & a1_26);
			uint32 a7_42 = (word32) a5_11->w4201AD24 + ~0x00 << 16;
			a5_11->w4201AD24 = (word16) (a7_42 >> 0x10);
			if (a7_42 >> 0x10 != 0x00)
			{
				if ((word32) a5_11->t4201AD2C == (a6_22 & 0x00FE))
				{
					while (true)
					{
						int32 a2_78 = (word32) a5_11->t4201AD2C;
						if (a2_78 == 0x00FB || CONVERT(Mem77[a2_78 + (a5_11 + 0x42047264):byte], byte, word32) != 0x00)
							break;
						a5_11->t4201AD2C = (byte) (a2_78 + 0x01);
					}
					a5_11->t4201AD2C = (byte) (a2_78 & 0x00FE);
					Mem102[(a2_78 & 0x00FE) + (a5_11 + 0x42047264) + 28:word32] = a5_11 + 0x42047AB8;
				}
				if ((word32) a5_11->b4201AD2D == a6_22)
				{
					while (true)
					{
						word32 a2_115 = (word32) a5_11->b4201AD2D;
						word32 a6_117 = a2_115 + (a5_11 + 0x42047264);
						if (a2_115 == 0x00 || (word32) (*a6_117) != 0x00)
							break;
						a5_11->b4201AD2D = (byte) (a2_115 + ~0x00);
					}
					a5_11->ptr42047AD8 = a6_117;
				}
				word32 a3_143 = (word32) (word16) ((word32) a5_11->b4201AD2D + 0x06 - (word32) a5_11->t4201AD2C);
				a5_11->t4201AD22 = (word16) a3_143;
				*((word32) a4_18 + 1) = (byte) (a3_143 + ~0x01);
				a5_11 = (word32) a5_11->t4201AD2C;
				((word32) a4_18 + 4)->u1 = (byte) a5_11;
			}
			else
			{
				a5_11->t4201AD22.u1 = 0x06;
				a5_11->t4201AD2C.u1 = 0xFF;
				word32 a2_54 = (word32) a5_11->t4201AD22;
				((word32) a4_18 + 4100)->u1 = 0x00;
				((word32) a4_18 + 0x00001001)->u1 = (byte) (a2_54 + ~0x01);
				Mem62[a4_18 + 0x11:word32] = a5_11 + 0x42047AB8;
				Mem69[CONVERT(Mem62[a0 + 3:byte], byte, word32) + 0x42047A80:word32] = a5_11 + 0x42047AB8;
				a4_18 = (word32) a5_11->b4201AD2D;
				Mem72[a5_11 + 0x42047264 + a4_18 + 32:word32] = a5_11 + 0x42047AB8;
				a5_11 += 0x42047AB8;
			}
		}
	}
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg8 = <invalid>;
	word32 s1_313;
	word32 s0_312;
	word32 a3_315;
	word32 a0_314;
	word32 s4_318;
	word32 s3_317;
	word32 s8_319;
	word32 s2_316;
	ke_msg_send_basic(ra, a0, a1, a4, mstatus, stackArg8, out s0_312, out s1_313, out a0_314, out a3_315, out s2_316, out s3_317, out s4_318, out s8_319);
	word32 a3_321;
	word32 a4_322;
	word32 s2_324;
	word32 s4_325;
	word32 s1_320;
	word32 a5_323;
	ke_msg_free(a0, mstatus, out s1_320, out a3_321, out a4_322, out a5_323, out s2_324, out s4_325);
	a5Out = a5_11;
	return a4_18;
}

// 2300307A: Register Eq_2 mm_bcn_init(Register Eq_2 ra, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      mm_init
Eq_2 mm_bcn_init(Eq_2 ra, ptr32 & a3Out, ptr32 & a4Out)
{
	ptr32 a3_15;
	ptr32 a4_16;
	word32 t1_38;
	word32 a0_39;
	word32 a1_40;
	word32 a2_41;
	word32 a5_42;
	Eq_2 ra_18 = memset(ra, 0x42018E84, 0x00, 36, out t1_38, out a0_39, out a1_40, out a2_41, out a3_15, out a4_16, out a5_42);
	g_dw42046120 = 0x42018E84;
	g_dw2300347A = 0x42018E84;
	co_list_init(&g_t42018EA0);
	a3Out = a3_15;
	a4Out = a4_16;
	return ra_18;
}

// 230030BC: Register Eq_2 mm_bcn_init_vif(Register Eq_2 ra, Register Eq_2 a0, Stack Eq_2 dwArg38, Register out ptr32 a3Out)
// Called from:
//      vif_mgmt_register
Eq_2 mm_bcn_init_vif(Eq_2 ra, Eq_2 a0, Eq_2 dwArg38, ptr32 & a3Out)
{
	word32 a1_13 = (word32) *((word32) a0 + 87);
	struct Eq_12731 * s0_40;
	word32 * s2_42;
	Eq_2 ra_39 = txl_frame_init_desc(ra, (word32) a0 + 96, a1_13 + 0x420476B8, a1_13 + 0x42047C98, out s0_40, out s2_42);
	*s2_42 = (word32) s0_40->b0057 + 0x42047A18;
	struct Eq_12760 * s1_58 = (word32) s0_40->b0057;
	s0_40->b0343 = 0x00;
	s0_40->w033C = 0x00;
	s0_40->b0346 = 0x00;
	s0_40->w033A = 0x06;
	s0_40->w0344 = 0xFF;
	struct Eq_12785 * a4_63 = (s1_58 << 0x03) + 0x42047360;
	a4_63->dw0011 = &s1_58->dw42047AB8;
	s1_58->dw42047AB8 = ~0x35010521;
	a4_63->ptr0008 = &s1_58->dw42047AB8;
	s1_58->dw42047AC8 = 0x00;
	s1_58->ptr42047A80 = &s1_58->dw42047AB8;
	a4_63->b0000 = 0x05;
	a4_63->b0001 = 0x04;
	word32 a3_95 = (word32) s0_40->b0343;
	a4_63->b0004 = 0x00;
	a4_63->b0002 = (byte) a3_95;
	a4_63->b0003 = 0x01;
	a4_63->b0005 = ~0x00;
	s1_58->dw42047ACC = ~0x35010521;
	int32 a4_103 = (word32) s0_40->b0345;
	s1_58->ptr42047A94 = &s1_58->dw42047AB8;
	((char *) s1_58 + 0x42047264 + a4_103)[32] = (char) &s1_58->dw42047AB8;
	ptr32 a3_110;
	word32 t1_139;
	word32 a0_140;
	word32 a1_141;
	word32 a2_142;
	word32 a4_143;
	word32 a5_144;
	Eq_2 ra_113 = memset(ra_39, (char *) s1_58 + 0x42047264, 0x00, 252, out t1_139, out a0_140, out a1_141, out a2_142, out a3_110, out a4_143, out a5_144);
	s1_58->dw42047A7C = ~0x35010521;
	s1_58->ptr42047A80 = null;
	s1_58->dw42047A8C = 0x00;
	struct Eq_12891 * a5_119 = s0_40->ptr00CC;
	a5_119->dw0024 = 0x00;
	a5_119->dw003C = 0x00;
	a5_119->dw0010 = 0x00;
	s0_40->dw032C = 0x2300362E;
	s0_40->ptr0330 = s0_40;
	0x00 = (uint16) dwArg38;
	a3Out = a3_110;
	return ra_113;
}

// 23003210: void mm_tim_update(Register Eq_2 a0)
// Called from:
//      mm_tim_update_req_handler
void mm_tim_update(Eq_2 a0)
{
	Eq_2 a5_5 = g_t42018E88;
	if (a5_5 == 0x00)
	{
		word32 a5_44;
		mm_tim_update_proceed(a0, out a5_44);
	}
	else
		co_list_push_back((word32) a0 - 0x0C, a5_5);
}

// 2300322E: Register (ptr32 Eq_12933) mm_bcn_transmit(Register Eq_2 ra, Register Eq_2 s5, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg48, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out Eq_2 s8Out)
// Called from:
//      mm_tbtt_evt
//      mm_bcn_change
struct Eq_12933 * mm_bcn_transmit(Eq_2 ra, Eq_2 s5, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg48, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgBC, Eq_2 dwArgF8, Eq_2 dwArg0128, union Eq_2 & s8Out)
{
	Eq_2 s0_172 = g_t4201AFC8;
	struct Eq_12933 * s2_174 = &g_t42018E84;
	if (g_t42018E88 == 0x00)
	{
		if ((word32) g_b42018E8D != 0x00)
			g_b42018E8C = 0x01;
		else
		{
			g_b42018E8C = 0x00;
			Eq_2 s5_295 = 0x42047360;
			struct Eq_12955 * s3_175 = g_a4201A3A8;
			struct Eq_12957 * s4_176 = &g_t4201D118;
			while (s0_172 != 0x00)
			{
				if ((word32) *((word32) s0_172 + 86) == 0x02 && ((word32) (*((word32) s0_172 + 834)) != 0x00 && (word32) (*((word32) s0_172 + 833)) == (word32) (*((word32) s0_172 + 832))))
				{
					ui32 a4_100;
					struct Eq_12988 * a5_59 = (word32) s5_295 + ((word32) (*((word32) s0_172 + 87)) << 3);
					struct Eq_12996 * a1_52 = (word32) *((word32) s0_172 + 0x033A);
					ui32 a2_61 = (word32) a5_59->b0004;
					(&(a1_52 + (word32) (*((word32) s0_172 + 0x0338)) / 24)->w0016)[5] = (word16) *((word32) s0_172 + 0x00CC);
					uint32 a4_68 = (word32) s3_175->t0054 + 0x01 << 16;
					s3_175->t0054 = (word16) (a4_68 >> 16);
					a1_52->w0016 = (word16) (a4_68 >> 16 << 4);
					word32 a4_73 = (word32) *((word32) s0_172 + 0x0343);
					a5_59->b0002 = (byte) a4_73;
					if (a4_73 == 0x00)
					{
						if ((word32) *((word32) s0_172 + 838) == 0x00)
						{
							a4_100 = a2_61 & 0x00FE;
							if (s4_176->t001C != 0x00)
								goto l2300334A;
						}
						else
						{
l2300334A:
							a4_100 = a2_61 | 1;
						}
						((word32) s0_172 + 0x0343)->u1 = (byte) (word32) a5_59->b0003;
					}
					else
					{
						a4_100 = a2_61 & 0x00FE;
						if (((word32) *((word32) s0_172 + 838) & 0x02) != 0x00)
							a4_100 = a2_61 | 1;
					}
					Eq_2 a4_102 = a4_100 | 1;
					a5_59->b0004 = (byte) a4_102;
					((word32) s0_172 + 0x0343)->u1 = (byte) ((word32) *((word32) s0_172 + 0x0343) + ~0x00);
					word32 a5_109 = (word32) *((word32) s0_172 + 839);
					if (a5_109 != 0x00)
					{
						int32 a2_111 = (word32) *((word32) s0_172 + 840);
						int32 a5_112 = a5_109 + ~0x00 & 0x00FF;
						((word32) s0_172 + 839)->u1 = (byte) a5_112;
						if (a2_111 != 0x00)
						{
							((word32) a4_102 + a2_111)->u1 = (byte) a5_112;
							a4_102 = (word32) *((word32) s0_172 + 841);
							if (a4_102 != 0x00)
								((word32) a4_102 + a5_112)->u1 = (byte) (word32) *((word32) s0_172 + 839);
						}
						word32 s7_124 = (word32) *((word32) s0_172 + 839);
						if (s7_124 == 0x00)
						{
l230033A0:
							((word32) s0_172 + 839)->u1 = 0x01;
							goto l230033A6;
						}
						word32 a2_705;
						word32 a1_704;
						Eq_2 a0_146;
						word32 s8_159;
						word32 s0_702;
						word32 s4_712;
						word32 a5_708;
						word32 a6_709;
						word32 s1_703;
						word32 a3_706;
						word32 a4_707;
						word32 s2_710;
						word32 s3_711;
						ra = ke_msg_alloc(ra, 78, 0x0D, 0x02, a4_102, mstatus, dwLoc18, out s0_702, out s1_703, out a0_146, out a1_704, out a2_705, out a3_706, out a4_707, out a5_708, out a6_709, out s2_710, out s3_711, out s4_712, out s8_159);
						a0_146->u1 = (byte) s8_159;
						*((word32) a0_146 + 1) = (byte) s7_124;
						word32 a3_717;
						word32 a0_714;
						word32 s1_713;
						word32 a5_719;
						word32 a1_715;
						word32 a2_716;
						word32 s8_720;
						word32 a4_718;
						s0_172 = ke_msg_send(a0_146, mstatus, out s1_713, out a0_714, out a1_715, out a2_716, out a3_717, out a4_718, out a5_719, out s2_174, out s3_175, out s4_176, out s8_720);
						if ((word32) *((word32) s0_172 + 839) == 0x00)
							goto l230033A0;
					}
l230033A6:
					word32 a4_701;
					tpc_update_frame_tx_power(ra, s0_172, fflags, frm, out a4_701);
					Eq_2 a4_222;
					if (chan_is_on_operational_channel(out a4_222) != 0x00)
					{
						word32 s7_227 = (word32) *((word32) s0_172 + 87);
						Eq_2 a0_237;
						word32 s1_722;
						word32 a1_723;
						word32 a3_725;
						word32 a2_724;
						word32 s0_721;
						word32 s4_731;
						word32 s8_732;
						word32 s2_729;
						word32 a4_726;
						word32 a5_727;
						word32 a6_728;
						word32 s3_730;
						Eq_2 ra_244 = ke_msg_alloc(ra, 74, 0x0D, 0x03, a4_222, mstatus, dwLoc18, out s0_721, out s1_722, out a0_237, out a1_723, out a2_724, out a3_725, out a4_726, out a5_727, out a6_728, out s2_729, out s3_730, out s4_731, out s8_732);
						a0_237->u1 = (byte) (s7_227 + 0x0A & 0x00FF);
						((word32) a0_237 + 1)->u1 = 0x00;
						((word32) a0_237 + 2)->u1 = 0x00;
						struct Eq_13120 * a3_261;
						word32 s2_739;
						word32 a2_736;
						word32 s1_733;
						word32 a0_734;
						word32 a1_735;
						word32 s4_741;
						word32 s8_742;
						word32 a5_738;
						word32 a4_737;
						word32 s3_740;
						Eq_2 s0_265 = ke_msg_send(a0_237, mstatus, out s1_733, out a0_734, out a1_735, out a2_736, out a3_261, out a4_737, out a5_738, out s2_739, out s3_740, out s4_741, out s8_742);
						((word32) s0_265 + 0x008F)->u1 = (byte) (word32) *((word32) s0_265 + 87);
						((word32) s0_265 + 144)->u1 = ~0x00;
						word32 s7_748;
						word32 s11_751;
						word32 s9_749;
						word32 s10_750;
						word32 a5_747;
						word32 a4_746;
						word32 a0_280;
						word32 s6_296;
						word32 s1_743;
						word32 a1_744;
						word32 a3_745;
						ra = txl_frame_push(ra_244, s0_265, 0x04, a3_261, (struct Eq_13346 *) ~0x00, mstatus, dwArg08, s5, dwArg88, dwArgBC, out s0_172, out s1_743, out a0_280, out a1_744, out a3_745, out a4_746, out a5_747, out s2_174, out s3_175, out s4_176, out s5_295, out s6_296, out s7_748, out s9_749, out s10_750, out s11_751);
						if (a0_280 != 0x00)
							++s2_174->dw0004;
						Eq_2 s1_314 = (word32) *((word32) s0_172 + 87) + 442 + s6_296;
						if (((word32) *((word32) s1_314 + 50) & 0x02) != 0x00)
						{
							*(union Eq_2 *) 0x3D = s1_314;
							word32 a0_752;
							word32 a3_755;
							word32 a2_754;
							word32 a1_753;
							word32 s11_761;
							word32 s7_758;
							word32 s9_759;
							word32 a6_756;
							word32 s6_757;
							word32 s10_760;
							struct Eq_13425 * s1_329;
							ra = sta_mgmt_send_postponed_frame(ra, s0_172, s1_314, s5_295, mstatus, dwArg48, s5, dwArg8C, dwArgF8, out s0_172, out s1_329, out a0_752, out a1_753, out a2_754, out a3_755, out a6_756, out s2_174, out s3_175, out s4_176, out s5_295, out s6_757, out s7_758, out s9_759, out s10_760, out s11_761);
							s1_329->dw0034 = 0x00;
						}
					}
				}
				s0_172 = *s0_172;
			}
		}
		0x00 = (uint16) dwArg0128;
		s8Out = s5;
		return s2_174;
	}
	else
		assert_err();
}

// 23003466: Register Eq_2 mm_bcn_updated(Register Eq_2 ra, Register Eq_2 a4, Register (ptr32 Eq_13476) a5, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack word32 dwArg0128, Register out ptr32 s1Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      mm_bcn_update
Eq_2 mm_bcn_updated(Eq_2 ra, Eq_2 a4, struct Eq_13476 * a5, Eq_2 s3, Eq_2 s5, Eq_2 s6, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg8C, Eq_2 dwArgC8, Eq_2 dwArgF8, word32 dwArg0128, ptr32 & s1Out, ptr32 & a4Out, ptr32 & a5Out)
{
	struct Eq_13491 * a5_106;
	struct Eq_13492 * s0_45;
	struct Eq_13516 ** s1_46;
	struct Eq_13494 * s8_50;
	word32 a0_316;
	word32 a3_317;
	word32 s3_318;
	word32 s4_319;
	Eq_2 s2_160;
	Eq_2 ra_175 = ke_msg_send_basic(ra, 64, (word32) a5->wFFFFFFFC, a4, mstatus, s6, out s0_45, out s1_46, out a0_316, out a3_317, out s2_160, out s3_318, out s4_319, out s8_50);
	struct Eq_13516 * s3_56 = *s1_46;
	struct Eq_13520 * a5_62 = (word32) s3_56->w0004;
	struct Eq_13525 * s7_55 = (word32) s0_45->b0057;
	word32 s6_64 = (word32) s3_56->w0006;
	word32 s9_65 = a5_62 - (word32) s3_56->b0008;
	int32 s5_66 = s0_45->ptr00CC->dw0014;
	s0_45->w0338 = (word16) s9_65;
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg104 = <invalid>;
	Eq_2 stackArg408 = <invalid>;
	word32 s7_330;
	word32 a3_324;
	word32 a4_325;
	word32 s3_326;
	word32 s4_327;
	word32 s5_328;
	word32 s6_329;
	me_beacon_check(ra, a0, a1, a2, s2, s8, fflags, frm, mstatus, stackArg104, stackArg408, out a3_324, out a4_325, out s3_326, out s4_327, out s5_328, out s6_329, out s7_330);
	struct Eq_13594 * s1_73 = a5_62->ptr0014;
	struct Eq_13598 * a5_76 = a5_62 + ((word32) s3_56->w0006 + ~0x00) / 24;
	a5_76->ptr0018 = s1_73;
	struct Eq_13609 * a4_82 = a5_76 + ((word32) s3_56->b0008 + 0x01) / 28;
	a4_82->dw0008 = (char *) s7_55 + 0x42047A7C;
	word32 a5_87 = (word32) s3_56->w0006;
	s7_55->dw42047A8C = 0x00;
	struct Eq_13631 * a5_91 = a4_82 + (~a5_87 + s9_65) / 0x0C;
	a5_91->ptr000C = (char *) s7_55 + 0x42047A7C;
	struct Eq_13639 * s4_61 = (s7_55 << 0x03) + 0x42047360;
	word32 * s8_165 = &s8_50->ptrFFFFFE84;
	struct Eq_13647 * s0_93 = a5_91->ptr0040;
	if ((word32) a5_91->b0004 != 0x00)
		a5_106 = (struct Eq_13491 *) &g_dw42047A2C;
	else
		a5_106 = (struct Eq_13491 *) &g_dw420470B4;
	(*(int32 *) 0x44B000A0 & 0x00FF)->ptr0024 = a5_106;
	a5_106->ptr0028 = s1_73;
	s1_73->dw0024 = 0x00;
	s1_73->dw003C = 0x00;
	*((char *) g_a42047AC8 + (word32) s0_93->b0057) = (struct Eq_13594 **) s1_73;
	s0_93->b0342 = 0x01;
	Eq_2 s5_104 = s5_66 + (s6_64 + 0x03);
	s4_61->b0003 = (byte) (word32) *s5_104;
	struct Eq_13699 * a5_126 = s8_50->ptrFFFFFE84;
	s0_93->b0347 = 0x00;
	s0_93->b0348 = (byte) (word32) a5_126->b000A;
	s0_93->b0349 = (byte) (word32) a5_126->b000B;
	int32 a4_133 = (word32) a5_126->b000A;
	if (a4_133 != 0x00)
		s0_93->b0347 = (byte) ((word32) a5_126[a4_133 / 0x0C] + 0x01);
	word32 a5_141 = (word32) s8_50->bFFFFFE8C;
	s8_50->bFFFFFE8D = 0x00;
	if (a5_141 != 0x00)
		s2_160 = mm_bcn_transmit(ra_175, s5_104, fflags, frm, mstatus, s6, dwArg18, s5, s3, dwArg8C, dwArgC8, dwArgF8, out s8_165);
	*s8_165 = 0x00;
	0x00 = dwArg0128;
	ptr32 a4_203;
	ptr32 a5_204;
	ptr32 s1_207;
	word32 s2_332;
	word32 s4_333;
	word32 a3_331;
	ke_msg_free(s2_160, mstatus, out s1_207, out a3_331, out a4_203, out a5_204, out s2_332, out s4_333);
	s1Out = s1_207;
	a4Out = a4_203;
	a5Out = a5_204;
	return ra_175;
}

word32 g_dw2300347A = 3361393238;
// 230035D2: Register Eq_2 mm_bcn_update(Register Eq_2 ra, Register (ptr32 Eq_13773) a0, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack word32 dwArg0128, Register out ptr32 s1Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      mm_bcn_transmitted
//      mm_bcn_change
Eq_2 mm_bcn_update(Eq_2 ra, struct Eq_13773 * a0, Eq_2 s3, Eq_2 s5, Eq_2 s6, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg8C, Eq_2 dwArgC8, Eq_2 dwArgF8, word32 dwArg0128, ptr32 & s1Out, ptr32 & a4Out, ptr32 & a5Out)
{
	word32 a1_84;
	word32 a2_85;
	word32 a3_86;
	word32 a4_87;
	word32 a5_88;
	word32 a6_89;
	word32 a7_90;
	memcpy((word32) a0->b0009 + 0x42047804, &a0->b0009 + 3, (word32) a0->w0004, out a1_84, out a2_85, out a3_86, out a4_87, out a5_88, out a6_89, out a7_90);
	g_b42018E8E = 0x00;
	g_b42018E8D = 0x01;
	ptr32 a4_55;
	ptr32 a5_56;
	ptr32 s1_60;
	Eq_2 ra_58 = mm_bcn_updated(ra, 0x01, &g_t42018E84, s3, s5, s6, fflags, frm, mstatus, dwArg18, dwArg8C, dwArgC8, dwArgF8, dwArg0128, out s1_60, out a4_55, out a5_56);
	s1Out = s1_60;
	a4Out = a4_55;
	a5Out = a5_56;
	return ra_58;
}

