pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300362E: void mm_bcn_transmitted(Register Eq_2 ra, Register (ptr32 Eq_13773) a0, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack word32 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack word32 dwArg0118, Stack Eq_2 dwArg0148)
void mm_bcn_transmitted(Eq_2 ra, struct Eq_13773 * a0, Eq_2 a4, Eq_2 s3, Eq_2 s5, Eq_2 s6, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, word32 dwArg38, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgB8, Eq_2 dwArgE8, word32 dwArg0118, Eq_2 dwArg0148)
{
	Eq_2 a5_14 = g_t42018E88;
	struct Eq_13773 * s1_16 = a0;
	if (a5_14 != 0x00)
	{
		Eq_10040 s0_23 = *((word32) a5_14 + 4);
		*((word32) a5_14 + 3) = s0_23;
		if (a5_14 == ~0x00)
		{
			Eq_2 a5_125 = (word32) *((word32) s0_23 + 0x0A);
			if (a5_125 != 0x00)
				ra = mm_bcn_update(ra, a0, s3, s5, s6, fflags, frm, mstatus, dwArg08, dwArg7C, dwArgB8, dwArgE8, dwArg0118, out s1_16, out a4, out a5_125);
			while (a5_125 != 0x00)
			{
				word32 a5_279;
				a4 = mm_tim_update_proceed((word32) co_list_pop_front(a4, a5_125, out a5_279) + 0x0C, out a5_125);
			}
			Eq_2 a4_82 = (word32) s1_16->b0347;
			if (a4_82 == 0x01)
			{
				0x00 = dwArg38;
				vif_mgmt_switch_channel(ra, a4_82, 0x42019000, mstatus, dwArg08, dwArg18, dwArg78, dwArg88, dwArgE8, dwArg0148);
				return;
			}
		}
		0x00 = dwArg38;
	}
	else
		assert_err();
}

// 230036B4: void mm_bcn_change(Register Eq_2 ra, Register (ptr32 Eq_13773) a0, Register (ptr32 Eq_13912) a4, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack word32 dwArg0128)
// Called from:
//      mm_bcn_change_req_handler
void mm_bcn_change(Eq_2 ra, struct Eq_13773 * a0, struct Eq_13912 * a4, Eq_2 s3, Eq_2 s5, Eq_2 s6, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg8C, Eq_2 dwArgC8, Eq_2 dwArgF8, word32 dwArg0128)
{
	struct Eq_13924 * a5_6 = a4->ptr0004;
	a0->ptr0000 = a5_6;
	if (a4 == null)
	{
		word32 s1_95;
		word32 a4_96;
		word32 a5_97;
		mm_bcn_update(ra, a0, s3, s5, s6, fflags, frm, mstatus, dwArg18, dwArg8C, dwArgC8, dwArgF8, dwArg0128, out s1_95, out a4_96, out a5_97);
	}
	else
		a5_6->b000A = 0x01;
}

// 230036CE: Register Eq_2 mm_timer_hw_set(Register Eq_2 a0, Register Eq_2 a4, Register ptr32 mstatus)
// Called from:
//      mm_timer_schedule
//      chan_upd_ctxt_status
Eq_2 mm_timer_hw_set(Eq_2 a0, Eq_2 a4, ptr32 mstatus)
{
	Eq_2 a5_14;
	__csrrc(mstatus, 0x08);
	if (a0 != 0x00)
	{
		*(union Eq_2 *) 0x44B00144 = a4;
		a5_14 = *(union Eq_2 *) 0x44B0808C;
		if ((a5_14 & 0x0080) != 0x00)
			goto l230036FC;
		((union Eq_13963 *) 0x44B08088)->u0 = 0x0080;
		a5_14 |= 0x0080;
	}
	else
		a5_14 = *(union Eq_2 *) 0x44B0808C & -0x0081;
	*(union Eq_2 *) 0x44B0808C = a5_14;
l230036FC:
	__csrrs(mstatus, 0x08);
	return a5_14;
}

// 23003710: void cmp_abs_time()
void cmp_abs_time()
{
}

// 2300371A: void mm_timer_init()
// Called from:
//      mm_init
void mm_timer_init()
{
	co_list_init(&g_t42018EA8);
}

// 23003726: Register Eq_2 mm_timer_set(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s8Out)
// Called from:
//      mm_check_beacon
//      mm_sta_tbtt
//      ps_uapsd_timer_handle
//      ps_enable_cfm
//      ps_uapsd_set
//      td_timer_end
//      td_start
//      vif_mgmt_bcn_to_prog
//      vif_mgmt_switch_channel
//      keyMgmtSta_StartSession_internal
//      chan_upd_ctxt_status
//      chan_tbtt_schedule
//      chan_cde_evt
//      chan_scan_req
//      mm_hw_config_handler
Eq_2 mm_timer_set(Eq_2 a0, Eq_2 a1, Eq_2 a4, ptr32 mstatus, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a2Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s8Out)
{
	Eq_2 a4_28;
	Eq_2 s0_19 = a1;
	a4_28 = a4;
	if (a1 - *((union Eq_2 *) 0x44B00120) < 0x00)
	{
		word32 s8_170;
		word32 a2_167;
		word32 a1_166;
		word32 a0_165;
		word32 a5_168;
		word32 s4_169;
		s0_19 = (word32) *((word32) puts(587679568, out a0_165, out a1_166, out a2_167, out a4_28, out a5_168, out s4_169, out s8_170) + 288) + 0x00FFFBB8;
	}
	word32 s3_43;
	Eq_2 a5_39 = g_t42018EA8;
	if (a0 == a5_39)
	{
		word32 a5_171;
		co_list_pop_front(a4_28, a5_39, out a5_171);
		s3_43 = 0x01;
	}
	else
	{
		word32 a5_178;
		co_list_extract(a0, a1, a4, a5, out a5_178);
		s3_43 = 0x00;
	}
	*((word32) a0 + 0x0C) = s0_19;
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg296 = <invalid>;
	word32 s1_174;
	word32 s2_175;
	word32 s3_176;
	co_list_insert(ra, s0, a1, a2, stackArg296, out s1_174, out s2_175, out s3_176);
	Eq_2 a0_128 = 0x42018EA8;
	if (s3_43 != 0x00 || a0 == g_t42018EA8)
	{
		a0_128 = g_t42018EA8;
		mm_timer_hw_set(a0, a4, mstatus);
	}
	Eq_2 a5_66 = *(union Eq_2 *) 0x44B00120;
	if (s0_19 - a5_66 >= 0x00)
	{
		s1Out.u0 = <invalid>;
		a0Out = a0_128;
		a1Out.u0 = <invalid>;
		a2Out.u0 = <invalid>;
		a4Out = a4_28;
		a5Out = a5_66;
		s2Out.u0 = <invalid>;
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		s8Out.u0 = <invalid>;
		return <invalid>;
	}
	else
	{
		Eq_2 a5_96;
		Eq_2 a4_95 = ke_evt_set(0x08000000, a4_28, mstatus, out a5_96);
		s1Out.u0 = <invalid>;
		a0Out.u0 = 0x08000000;
		a1Out.u0 = <invalid>;
		a2Out.u0 = <invalid>;
		a4Out = a4_95;
		a5Out = a5_96;
		s2Out.u0 = <invalid>;
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		s8Out.u0 = <invalid>;
		return <invalid>;
	}
}

