pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 230037DC: Register Eq_2 mm_timer_clear(Register Eq_2 a0, Register Eq_2 a4, Register out Eq_2 a2Out, Register out Eq_2 a5Out)
// Called from:
//      ps_disable_cfm
//      td_reset
//      vif_mgmt_unregister
//      vif_mgmt_bcn_recv
//      vif_mgmt_switch_channel
//      supplicantDisable
//      ProcessRxEAPOL_PwkMsg3
//      ProcessRxEAPOL_GrpMsg1
//      chan_tbtt_insert
//      chan_upd_ctxt_status
//      chan_tx_cfm
//      chan_roc_req
//      mm_hw_config_handler
Eq_2 mm_timer_clear(Eq_2 a0, Eq_2 a4, union Eq_2 & a2Out, union Eq_2 & a5Out)
{
	Eq_2 a5_7 = g_t42018EA8;
	if (a0 != a5_7)
	{
		word32 a5_38;
		co_list_extract(a0, a1, a4, a5, out a5_38);
		a2Out.u0 = <invalid>;
		a5Out = a5_7;
		return a0;
	}
	else
	{
		Eq_2 a5_19;
		co_list_pop_front(a4, a5_7, out a5_19);
		mm_timer_hw_set(a0, a4, mstatus);
		a2Out.u0 = <invalid>;
		a5Out = a5_19;
		return a1;
	}
}

// 23003814: void mm_timer_schedule(Register Eq_2 a4, Register ptr32 mstatus)
void mm_timer_schedule(Eq_2 a4, ptr32 mstatus)
{
	while (true)
	{
		Eq_2 a5_27 = ke_evt_clear(0x08000000, a4, mstatus);
		if (g_t42018EA8 == 0x00)
			break;
		a4 = *(union Eq_2 *) 0x44B00120;
		int32 a5_34 = a5_27 - a4;
		Eq_2 s0_33 = *((word32) a5_27 + 0x0C);
		Eq_2 a5_35 = a5_34 + -50;
		if (a5_34 >= ~0x31)
		{
			word32 a5_38 = mm_timer_hw_set(s0_33, a4, mstatus);
			a4 = *(union Eq_2 *) 0x44B00120;
			a5_35 = a5_38 - a4;
			if (a5_35 >= 0x00)
				return;
		}
		<anonymous> * a5_59;
		co_list_pop_front(a4, a5_35, out a5_59);
		if (a5_59 == null)
			assert_err();
		a5_59();
	}
	mm_timer_hw_set(0x00, a4, mstatus);
}

// 230038B2: void ps_uapsd_timer_handle(Register Eq_2 s9, Register Eq_2 s10, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0178)
void ps_uapsd_timer_handle(Eq_2 s9, Eq_2 s10, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg8C, Eq_2 dwArg0178)
{
	Eq_2 s0_20 = g_t4201AFC8;
	Eq_2 s2_17 = 0x00;
	struct Eq_14160 * s3_119 = (struct Eq_14160 *) 0x44B00000;
	while (s0_20 != 0x00)
	{
		if ((word32) *((word32) s0_20 + 86) == 0x00 && ((word32) (*((word32) s0_20 + 88)) != 0x00 && (word32) (*((word32) s0_20 + 0x0068)) != 0x00))
		{
			uint32 a5_27;
			word32 a4_249;
			word32 a3_248;
			Eq_2 a0_26 = chan_is_on_channel(s0_20, out a3_248, out a4_249, out a5_27);
			if (a0_26 != 0x00)
			{
				struct Eq_14229 * a4_32 = s3_119->ptr0120;
				s2_17 = a0_26;
				s0_20 = a4_32->t0064;
				struct Eq_14236 * a5_37 = a4_32 + ((a5_27 >> 1) - a4_32) / 0x0068;
				if (a5_37 < null)
				{
					(a5_37 | 8)->dw0004 = a5_37->dw0004;
					word32 a1_252;
					word32 a0_251;
					word32 s1_250;
					word32 a2_253;
					word32 a3_254;
					word32 a5_255;
					word32 s4_256;
					word32 s5_257;
					word32 s6_258;
					word32 s7_259;
					word32 s11_260;
					txl_frame_send_qosnull_frame(s9, s10, fflags, frm, mstatus, dwArg58, dwArg8C, dwArg0178, out s0_20, out s1_250, out a0_251, out a1_252, out a2_253, out a3_254, out a5_255, out s2_17, out s3_119, out s4_256, out s5_257, out s6_258, out s7_259, out s9, out s10, out s11_260);
					s3_119->ptr0120->t0064 = s0_20;
				}
			}
		}
		s0_20 = *s0_20;
	}
	if (s2_17 == 0x00)
		g_b42018ECC = 0x00;
	else
	{
		word32 a1_103 = Mem21[0x44B00120:int32] + Mem21[0x42018ED0:word32];
		word32 s8_247;
		word32 s4_246;
		word32 s3_245;
		word32 s2_244;
		word32 a5_243;
		word32 a4_242;
		word32 a2_241;
		word32 a1_240;
		word32 a0_239;
		word32 s1_238;
		mm_timer_set(1107398332, a1_103, 0x44B00000, mstatus, out s1_238, out a0_239, out a1_240, out a2_241, out a4_242, out a5_243, out s2_244, out s3_245, out s4_246, out s8_247);
	}
}

word32 g_dw230038C2 = 3360309761;
// 23003966: void blmac_pwr_mgt_setf(Register ui32 a0, Register (ptr32 Eq_14314) a5)
// Called from:
//      ps_set_mode
//      ps_traffic_status_update
void blmac_pwr_mgt_setf(ui32 a0, struct Eq_14314 * a5)
{
	(a0 << 2 | a5 & ~0x04)->dw004C = a5->dw004C;
}

// 23003976: Register Eq_2 ps_dpsm_update(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack word32 dwArg10, Stack word32 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack word32 dwArg0188, Register out Eq_2 s1Out, Register out (ptr32 Eq_11723) s2Out, Register out ptr32 mstatusOut)
// Called from:
//      ps_traffic_status_update
Eq_2 ps_dpsm_update(Eq_2 ra, Eq_2 s0, word32 a0, ptr32 fflags, ptr32 frm, ptr32 mstatus, word32 dwArg10, word32 dwArg14, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, word32 dwArg0188, union Eq_2 & s1Out, struct Eq_11723 & s2Out, ptr32 & mstatusOut)
{
	struct Eq_11723 * s2_140;
	struct Eq_14314 * a5_19;
	ui32 a4_14 = (word32) g_b42018ED4;
	struct Eq_14350 * s0_139 = &g_b42018EB0;
	ui32 a5_16 = g_dw42018EB4;
	if (a0 != 0x00)
	{
		g_b42018ED4 = (byte) (a4_14 | 2);
		(a5_16 | 8)->dw0004 = 0x42018EB0;
		a5_19 = a5_16 | 8;
		s2_140 = &g_t23003D04;
	}
	else
	{
		g_b42018ED4 = (byte) (a4_14 | 4);
		(a5_16 & ~0x08)->dw0004 = 0x42018EB0;
		a5_19 = a5_16 & ~0x08;
		s2_140 = &g_t23003C02;
	}
	blmac_pwr_mgt_setf(a0 ^ 1, a5_19);
	Eq_2 s1_38 = g_t4201AFC8;
	g_b42018EB8 = 0x00;
	while (s1_38 != 0x00)
	{
		if ((word32) *((word32) s1_38 + 86) == 0x00 && (word32) (*((word32) s1_38 + 88)) != 0x00)
		{
			word32 a5_316;
			word32 a4_315;
			word32 a3_314;
			if (chan_is_on_channel(s1_38, out a3_314, out a4_315, out a5_316) != 0x00)
			{
				word32 a5_51 = (word32) s0_139->b0008;
				struct Eq_11722 * a0_52 = (word32) *((word32) s1_38 + 96);
				((word32) s1_38 + 95)->u1 = 0x00;
				s0_139->b0008 = (byte) (a5_51 + 0x01);
				word32 s7_325;
				word32 s6_324;
				word32 s5_323;
				word32 s4_322;
				word32 s3_321;
				word32 a5_320;
				word32 a4_319;
				word32 a3_318;
				word32 a0_317;
				ra = txl_frame_send_null_frame(ra, a0_52, s2_140, fflags, frm, mstatus, dwArg38, dwArg68, dwArg9C, dwArgB8, dwArgD8, dwArgF8, dwArg0188, out s0_139, out s1_38, out a0_317, out a3_318, out a4_319, out a5_320, out s2_140, out s3_321, out s4_322, out s5_323, out s6_324, out s7_325);
			}
		}
		s1_38 = *s1_38;
	}
	if ((word32) s0_139->b0008 != 0x00)
	{
		0x00 = (uint16) dwArg38;
		s1Out = s1_38;
		s2Out = s2_140;
		mstatusOut = mstatus;
		return s0;
	}
	else
	{
		0x00 = (uint16) dwArg38;
		Eq_2 s0_108;
		Eq_2 s1_111;
		struct Eq_11723 * s2_112;
		word32 t1_117;
		word32 a3_119;
		word32 frm_120;
		word32 fflags_121;
		ptr32 mstatus_122;
		word32 a6_123;
		word32 a7_124;
		word32 s3_125;
		word32 s4_126;
		word32 s5_127;
		word32 s6_128;
		word32 s8_129;
		word32 t0_130;
		word32 t3_131;
		word32 t4_132;
		word32 t5_133;
		word32 t6_134;
		word32 s10_135;
		word32 s11_136;
		word32 s7_137;
		word32 s9_138;
		s2_140();
		s1Out = s1_111;
		s2Out = s2_112;
		mstatusOut = mstatus_122;
		return s0_108;
	}
}

// 23003A2E: Register Eq_2 ps_send_pspoll(Register Eq_2 ra, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg58, Stack Eq_2 dwArg88, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_14509 s1Out, Register out ptr32 a0Out, Register out Eq_14511 a1Out, Register out ptr32 a3Out, Register out (ptr32 Eq_14513) a4Out, Register out (ptr32 Eq_14514) a5Out, Register out ptr32 s2Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      ps_polling_frame
//      ps_check_beacon
//      ps_check_frame
Eq_2 ps_send_pspoll(Eq_2 ra, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg58, Eq_2 dwArg88, Eq_2 dwArgBC, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_14509 & s1Out, ptr32 & a0Out, union Eq_14511 & a1Out, ptr32 & a3Out, struct Eq_14513 & a4Out, struct Eq_14514 & a5Out, ptr32 & s2Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out)
{
	ptr32 a0_148;
	Eq_2 a4_22;
	Eq_2 a5_23;
	phy_get_channel(fp + -40, out a4_22, out a5_23);
	struct Eq_14535 * s4_36;
	struct Eq_14536 * a0_40;
	Eq_2 s3_45;
	word32 s0_224;
	word32 s5_225;
	word32 s6_226;
	word32 s7_227;
	word32 s8_228;
	word32 s9_229;
	word32 s10_230;
	word32 s11_231;
	struct Eq_14514 * a5_129;
	struct Eq_14513 * a4_128;
	ptr32 a3_127;
	Eq_14511 a1_125;
	Eq_14509 s1_133;
	ptr32 s2_136;
	txl_frame_get(ra, (word32) ((word32) bLoc28 != 0x00), (struct Eq_14556 *) 0x10, a4_22, a5_23, fflags, frm, mstatus, dwArgD8, dwArgF8, dwArg0118, out s0_224, out s1_133, out a0_40, out a1_125, out a3_127, out a4_128, out a5_129, out s2_136, out s3_45, out s4_36, out s5_225, out s6_226, out s7_227, out s8_228, out s9_229, out s10_230, out s11_231);
	if (a0_40 != null)
	{
		word32 a4_232;
		tpc_update_frame_tx_power(ra, s3_45, fflags, frm, out a4_232);
		struct Eq_14613 * s2_65 = a0_40->ptr0068;
		s2_65->b014C = 0xA4;
		s2_65->b014D = 0x00;
		ui32 a5_77 = (word32) s4_36->w420190E8;
		s2_65->b014E = (byte) (a5_77 | 0x0C000000);
		s2_65->b014F = (byte) ((a5_77 | 0x0C000000) >> 8);
		word32 a1_233;
		word32 a2_234;
		word32 a3_235;
		word32 a4_236;
		word32 a5_237;
		word32 a6_238;
		word32 a7_239;
		memcpy(&s2_65->b014F + 1, &s4_36->b420190EB + 3, 0x06, out a1_233, out a2_234, out a3_235, out a4_236, out a5_237, out a6_238, out a7_239);
		struct Eq_14664 * a5_100;
		struct Eq_14665 * a3_104;
		word32 a1_240;
		word32 a2_241;
		word32 a4_242;
		word32 a6_243;
		word32 a7_244;
		memcpy(&s2_65->b014F + 7, (word32) s3_45 + 80, 0x06, out a1_240, out a2_241, out a3_104, out a4_242, out a5_100, out a6_243, out a7_244);
		struct Eq_14685 * s1_112 = a3_104->ptr006C;
		struct Eq_13120 * a3_115 = a5_100->ptr003C;
		(a5_100 | 0x10000053)->ptr003C = a3_115;
		s1_112->b002F = (byte) (word32) s4_36->b420190EA;
		struct Eq_13346 * a5_122 = (word32) s4_36->b420190EB;
		s1_112->b0030 = (byte) a5_122;
		word32 s0_245;
		word32 a0_246;
		word32 s3_247;
		word32 s4_248;
		word32 s11_249;
		ra = txl_frame_push(ra, (char *) s4_36 + 0x420190D0, 0x03, a3_115, a5_122, mstatus, dwArg08, dwArg58, dwArg88, dwArgBC, out s0_245, out s1_133, out a0_246, out a1_125, out a3_127, out a4_128, out a5_129, out s2_136, out s3_247, out s4_248, out s5, out s6, out s7, out s9, out s10, out s11_249);
		a0_148 = 0x00;
	}
	else
		a0_148 = 0x01;
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_133;
	a0Out = a0_148;
	a1Out = a1_125;
	a3Out = a3_127;
	a4Out = a4_128;
	a5Out = a5_129;
	s2Out = s2_136;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s9Out = s9;
	s10Out = s10;
	return ra;
}

// 23003AF2: Register Eq_2 ps_init(Register Eq_2 ra, Register out ptr32 a0Out)
// Called from:
//      mm_init
Eq_2 ps_init(Eq_2 ra, ptr32 & a0Out)
{
	ptr32 a0_12;
	word32 t1_32;
	word32 a1_33;
	word32 a2_34;
	word32 a3_35;
	word32 a4_36;
	word32 a5_37;
	Eq_2 ra_18 = memset(ra, 0x42018EB0, 0x00, 40, out t1_32, out a0_12, out a1_33, out a2_34, out a3_35, out a4_36, out a5_37);
	g_dw230038C2 = 0x42018EB0;
	a0Out = a0_12;
	return ra_18;
}

