pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 23003B20: void ps_set_mode(Register Eq_2 ra, Register ui32 a0, Register word32 a1, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack word32 dwArg00, Stack word32 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack word32 dwArg0178)
// Called from:
//      ps_enable_cfm
//      ps_disable_cfm
//      mm_set_ps_mode_req_handler
void ps_set_mode(Eq_2 ra, ui32 a0, word32 a1, ptr32 fflags, ptr32 frm, ptr32 mstatus, word32 dwArg00, word32 dwArg04, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, word32 dwArg0178)
{
	struct Eq_14314 * a5_16 = (word32) g_b42018ED4;
	g_w42018EB2 = (word16) a1;
	struct Eq_14795 * s0_170 = &g_b42018EB0;
	if ((a5_16 & 1) == 0x00 || (a5_16 & 6) == 0x00)
	{
		struct Eq_11723 * s2_172;
		if (a0 == 0x00)
		{
			g_b42018ED4 = 0x00;
			blmac_pwr_mgt_setf(a0, a5_16);
			s2_172 = &g_t23003D04;
		}
		else
		{
			if (a0 == 0x02)
			{
				g_b42018ED4 = (byte) (a5_16 | 1);
				a5_16 |= 1;
			}
			blmac_pwr_mgt_setf(0x01, a5_16);
			s2_172 = &g_t23003C02;
		}
		Eq_2 s1_114 = g_t4201AFC8;
		g_b42018EB8 = 0x00;
		g_b42018ECD = 0x00;
		word32 s3_171 = 0x01;
		while (s1_114 != 0x00)
		{
			if ((word32) *((word32) s1_114 + 86) == 0x00 && (word32) (*((word32) s1_114 + 88)) != 0x00)
			{
				word32 a5_439;
				word32 a4_438;
				word32 a3_437;
				if (chan_is_on_channel(s1_114, out a3_437, out a4_438, out a5_439) != 0x00)
				{
					word32 a5_62 = (word32) s0_170->b0008;
					((word32) s1_114 + 95)->u1 = 0x00;
					s0_170->b0008 = (byte) (a5_62 + 0x01);
					if ((word32) *((word32) s1_114 + 0x0068) != 0x00)
						s0_170->b001D = (byte) s3_171;
					word32 s5_445;
					word32 s7_447;
					word32 s6_446;
					word32 a4_442;
					word32 s4_444;
					word32 a5_443;
					word32 a3_441;
					word32 a0_440;
					ra = txl_frame_send_null_frame(ra, (word32) *((word32) s1_114 + 96), s2_172, fflags, frm, mstatus, dwArg28, dwArg58, dwArg8C, dwArgA8, dwArgC8, dwArgE8, dwArg0178, out s0_170, out s1_114, out a0_440, out a3_441, out a4_442, out a5_443, out s2_172, out s3_171, out s4_444, out s5_445, out s6_446, out s7_447);
				}
			}
			s1_114 = *s1_114;
		}
		if ((word32) s0_170->b0008 != 0x00)
			return;
		word32 t1_143;
		word32 frm_144;
		word32 fflags_145;
		word32 mstatus_146;
		word32 a7_147;
		word32 s5_148;
		word32 s6_149;
		word32 t0_150;
		word32 t4_151;
		word32 t5_152;
		word32 t6_153;
		word32 tp_154;
		word32 s10_155;
		word32 s11_156;
		word32 s7_157;
		word32 s9_158;
		s2_172();
	}
	else
	{
		g_b42018ED5 = (byte) a0;
		g_b42018ED4 = (byte) (a5_16 | 16);
	}
}

// 23003C02: void ps_enable_cfm(Register Eq_2 ra, Register (ptr32 Eq_14946) a0, Register ui32 a1, Register Eq_2 a4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack word32 dwArg00, Stack word32 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack word32 dwArg0178, Stack word32 dwArg0198)
void ps_enable_cfm(Eq_2 ra, struct Eq_14946 * a0, ui32 a1, Eq_2 a4, ptr32 fflags, ptr32 frm, ptr32 mstatus, word32 dwArg00, word32 dwArg04, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, word32 dwArg0178, word32 dwArg0198)
{
	if (a1 << 0x08 >= 0x00)
	{
		ui32 a5_17 = (word32) a0->b005F + 0x01 & 0x00FF;
		a0->b005F = (byte) a5_17;
		if (a5_17 != 0x03)
		{
			struct Eq_11722 * a0_22 = (word32) a0->b0060;
			word32 s7_573;
			word32 s3_569;
			word32 s6_572;
			word32 s4_570;
			word32 s5_571;
			word32 s2_568;
			word32 a4_566;
			word32 a5_567;
			word32 a3_565;
			word32 a0_564;
			word32 s0_562;
			word32 s1_563;
			txl_frame_send_null_frame(ra, a0_22, &g_t23003C02, fflags, frm, mstatus, dwArg48, dwArg78, dwArgAC, dwArgC8, dwArgE8, dwArg0108, dwArg0198, out s0_562, out s1_563, out a0_564, out a3_565, out a4_566, out a5_567, out s2_568, out s3_569, out s4_570, out s5_571, out s6_572, out s7_573);
			return;
		}
		word32 s1_545;
		ra = mm_send_connection_loss_ind(ra, 0x03, mstatus, dwLoc08, out s1_545, out a4);
	}
	word32 a5_78 = (word32) g_b42018EB8;
	Eq_2 s0_104 = 0x42018EB0;
	if (a5_78 != 0x00)
	{
		ui32 a5_81 = a5_78 + ~0x00 & 0x00FF;
		g_b42018EB8 = (byte) a5_81;
		if (a5_81 != 0x00)
			return;
	}
	if ((word32) g_b42018ECD != 0x00)
	{
		word32 s3_552;
		word32 s4_553;
		word32 s8_554;
		word32 s2_551;
		word32 a0_546;
		word32 a1_547;
		word32 a5_550;
		word32 a2_548;
		word32 a4_549;
		struct Eq_15038 * s1_105;
		s0_104 = mm_timer_set(1107398332, (word32) *(union Eq_2 *) 0x44B00120 + 0x44B00000, a4, mstatus, out s1_105, out a0_546, out a1_547, out a2_548, out a4_549, out a5_550, out s2_551, out s3_552, out s4_553, out s8_554);
		((word32) s0_104 + 28)->u1 = 0x01;
		for (; s1_105 != null; s1_105 = s1_105->ptr0000)
		{
			if ((word32) s1_105->b0056 == 0x00 && (word32) s1_105->b0058 != 0x00)
			{
				struct Eq_15118 * a5_118 = (word32) s1_105->b0068;
				if (a5_118 != null)
				{
					s1_105 = a5_118->ptr0004;
					(a5_118 & ~0x08)->ptr0004 = s1_105;
				}
			}
		}
	}
	ui32 a5_129 = (word32) *((word32) s0_104 + 36);
	if ((a5_129 & 5) != 0x05)
	{
		Eq_2 a1_134 = (word32) *((word32) s0_104 + 2);
		s0_104->u1 = 0x01;
		word32 s3_559;
		word32 s4_560;
		word32 s8_561;
		word32 s2_558;
		word32 a3_557;
		word32 s1_555;
		word32 a0_556;
		ra = ke_msg_send_basic(ra, 50, a1_134, 0x05, mstatus, dwLoc08, out s0_104, out s1_555, out a0_556, out a3_557, out s2_558, out s3_559, out s4_560, out s8_561);
	}
	else
		*((word32) s0_104 + 36) = (byte) (a5_129 & ~0x0C);
	ui32 a5_172 = (word32) *((word32) s0_104 + 36);
	if ((a5_172 & 16) == 0x00)
		return;
	*((word32) s0_104 + 36) = (byte) (a5_172 & ~0x10);
	word32 a1_183 = (word32) *((word32) s0_104 + 2);
	ui32 a0_184 = (word32) *((word32) s0_104 + 37);
	ps_set_mode(ra, a0_184, a1_183, fflags, frm, mstatus, dwArg00, dwArg04, dwArg28, dwArg48, dwArg58, dwArg8C, dwArgA8, dwArgC8, dwArgE8, dwArg0178);
}

