pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 23003D04: void ps_disable_cfm(Register Eq_2 ra, Register (ptr32 Eq_15182) a0, Register ui32 a1, Register Eq_2 a4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack word32 dwArg00, Stack word32 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack word32 dwArg0178, Stack word32 dwArg0198)
void ps_disable_cfm(Eq_2 ra, struct Eq_15182 * a0, ui32 a1, Eq_2 a4, ptr32 fflags, ptr32 frm, ptr32 mstatus, word32 dwArg00, word32 dwArg04, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, word32 dwArg0178, word32 dwArg0198)
{
	if (a1 << 0x08 >= 0x00)
	{
		ui32 a5_15 = (word32) a0->b005F + 0x01 & 0x00FF;
		a0->b005F = (byte) a5_15;
		if (a5_15 != 0x03)
		{
			struct Eq_11722 * a0_19 = (word32) a0->b0060;
			word32 s7_409;
			word32 s6_408;
			word32 s2_404;
			word32 s5_407;
			word32 s3_405;
			word32 s4_406;
			word32 a5_403;
			word32 a4_402;
			word32 a3_401;
			word32 a0_400;
			word32 s0_398;
			word32 s1_399;
			txl_frame_send_null_frame(ra, a0_19, &g_t23003D04, fflags, frm, mstatus, dwArg48, dwArg78, dwArgAC, dwArgC8, dwArgE8, dwArg0108, dwArg0198, out s0_398, out s1_399, out a0_400, out a3_401, out a4_402, out a5_403, out s2_404, out s3_405, out s4_406, out s5_407, out s6_408, out s7_409);
			return;
		}
		word32 s1_388;
		ra = mm_send_connection_loss_ind(ra, 0x03, mstatus, dwLoc08, out s1_388, out a4);
	}
	word32 a5_75 = (word32) g_b42018EB8;
	struct Eq_15210 * s0_116 = &g_b42018EB0;
	if (a5_75 != 0x00)
	{
		ui32 a5_78 = a5_75 + ~0x00 & 0x00FF;
		g_b42018EB8 = (byte) a5_78;
		if (a5_78 != 0x00)
			return;
	}
	word32 a2_389;
	word32 a5_390;
	mm_timer_clear(1107398332, a4, out a2_389, out a5_390);
	ui32 a5_91 = (word32) g_b42018ED4;
	g_b42018ECC = 0x00;
	if ((a5_91 & 3) != 0x03)
	{
		Eq_2 a1_98 = (word32) g_w42018EB2;
		g_b42018EB0 = 0x00;
		word32 s8_397;
		word32 a3_393;
		word32 s4_396;
		word32 s2_394;
		word32 s3_395;
		word32 a0_392;
		word32 s1_391;
		ra = ke_msg_send_basic(ra, 50, a1_98, 0x03, mstatus, dwLoc08, out s0_116, out s1_391, out a0_392, out a3_393, out s2_394, out s3_395, out s4_396, out s8_397);
	}
	else
		g_b42018ED4 = (byte) (a5_91 & ~0x02 | 8);
	ui32 a5_128 = (word32) s0_116->b0024;
	if ((a5_128 & 16) == 0x00)
		return;
	s0_116->b0024 = (byte) (a5_128 & ~0x10);
	word32 a1_138 = (word32) s0_116->w0002;
	ui32 a0_139 = (word32) s0_116->b0025;
	ps_set_mode(ra, a0_139, a1_138, fflags, frm, mstatus, dwArg00, dwArg04, dwArg28, dwArg48, dwArg58, dwArg8C, dwArgA8, dwArgC8, dwArgE8, dwArg0178);
}

// 23003DC6: Register Eq_2 ps_polling_frame(Register Eq_2 ra, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg58, Stack Eq_2 dwArg88, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_15369) s0Out, Register out ptr32 a4Out)
// Called from:
//      mm_set_ps_mode_req_handler
Eq_2 ps_polling_frame(Eq_2 ra, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg58, Eq_2 dwArg88, Eq_2 dwArgBC, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, struct Eq_15369 & s0Out, ptr32 & a4Out)
{
	ptr32 a4_12;
	struct Eq_15369 * s0_16;
	word32 s1_46;
	word32 a0_47;
	word32 a1_48;
	word32 a3_49;
	word32 a5_50;
	word32 s2_51;
	word32 s5_52;
	word32 s6_53;
	word32 s7_54;
	word32 s9_55;
	word32 s10_56;
	Eq_2 ra_29 = ps_send_pspoll(ra, fflags, frm, mstatus, dwArg08, dwArg58, dwArg88, dwArgBC, dwArgD8, dwArgF8, dwArg0118, dwArg0128, out s0_16, out s1_46, out a0_47, out a1_48, out a3_49, out a4_12, out a5_50, out s2_51, out s5_52, out s6_53, out s7_54, out s9_55, out s10_56);
	s0Out = s0_16;
	a4Out = a4_12;
	return ra_29;
}

// 23003DCA: Register Eq_2 ps_check_beacon(Register Eq_2 ra, Register (ptr32 Eq_15402) a0, Register (ptr32 Eq_15403) a2, Register Eq_2 s9, Register Eq_2 s10, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0188, Register out (ptr32 Eq_15419) a3Out, Register out ptr32 s2Out)
// Called from:
//      rxl_cntrl_evt
Eq_2 ps_check_beacon(Eq_2 ra, struct Eq_15402 * a0, struct Eq_15403 * a2, Eq_2 s9, Eq_2 s10, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0188, struct Eq_15419 & a3Out, ptr32 & s2Out)
{
	struct Eq_15421 * a7_5 = (word32) a2->b0060;
	word32 a6_12 = (word32) g_b42018EB0;
	uint32 a4_14 = (word32) a7_5->w420190E8;
	struct Eq_15435 * a2_15 = a7_5->ptr420190D4;
	word32 a3_16 = a7_5 + 0x420190D0 & -2;
	a3_16->ptr0004 = a2_15;
	if (a6_12 == 0x00 || (((word32) g_b42018ED4 & 0x08) != 0x00 || a0 == null))
	{
		a3Out = a3_16;
		s2Out = s2;
		return ra;
	}
	if ((word32) a2_15->b005E == 0x00)
	{
		if (((word32) a0->b0004 & 0x01) != 0x00)
			(a3_16 | 2)->ptr0004 = a2_15;
		else
			Mem25[(a7_5 + 0x420190D0 & ~0x03) + 4:word32] = a2_15;
	}
	ui32 a3_30 = (word32) a0->b0004;
	ui32 a6_32 = (word32) a2_15->b0068;
	struct Eq_15475 * a5_34 = a4_14 >> 0x03;
	struct Eq_15419 * a3_201 = a3_30 & 0x00FE;
	if (a4_14 >> 0x03 >= (a3_30 & 0x00FE) && ((word32) a0->b0001 + ~0x03) + (a3_30 & 0x00FE) >= a4_14 >> 0x03)
	{
		a3_201 = a4_14 & 7;
		a5_34 = (word32) (a0 + (a4_14 >> 0x03) / 5 - (a3_30 & 0x00FE))->b0005 & 0x01 << (a4_14 & 7);
		if (a5_34 != null)
		{
			ptr32 s2_126;
			Eq_2 ra_121;
			struct Eq_15419 * a3_116;
			struct Eq_15541 * a5_103;
			word32 s0_102;
			if ((a6_32 & 0x0F) == 0x0F)
			{
				word32 a0_113;
				struct Eq_15576 * a5_118;
				word32 s9_395;
				word32 s10_396;
				word32 s11_397;
				word32 s7_394;
				word32 s4_391;
				word32 s5_392;
				word32 s6_393;
				word32 s3_390;
				word32 s1_387;
				word32 a1_388;
				word32 a2_389;
				word32 s0_386;
				ra_121 = txl_frame_send_qosnull_frame(s9, s10, fflags, frm, mstatus, dwArg68, dwArg9C, dwArg0188, out s0_386, out s1_387, out a0_113, out a1_388, out a2_389, out a3_116, out a5_118, out s2_126, out s3_390, out s4_391, out s5_392, out s6_393, out s7_394, out s9_395, out s10_396, out s11_397);
				if (a0_113 != 0x00)
					goto l23003E78;
				s0_102 = a5_118->dw0004;
				a5_103 = a5_118 | 8;
			}
			else
			{
				word32 a0_74;
				struct Eq_15547 * a5_79;
				word32 s7_383;
				word32 s9_384;
				word32 s10_385;
				word32 s6_382;
				word32 a1_379;
				word32 a4_380;
				word32 s5_381;
				word32 s1_378;
				word32 s0_377;
				ra_121 = ps_send_pspoll(ra, fflags, frm, mstatus, dwLoc08, dwArg48, dwArg78, dwArgAC, dwArgC8, dwArgE8, dwArg0108, dwArg0118, out s0_377, out s1_378, out a0_74, out a1_379, out a3_116, out a4_380, out a5_79, out s2_126, out s5_381, out s6_382, out s7_383, out s9_384, out s10_385);
				if (a0_74 != 0x00)
					goto l23003E78;
				s0_102 = a5_79->dw0004;
				a5_103 = a5_79 | 4;
			}
			a5_103->dw0004 = s0_102;
l23003E78:
			a3Out = a3_116;
			s2Out = s2_126;
			return ra_121;
		}
	}
	struct Eq_15503 * a5_52;
	word32 a2_50 = a5_34->dw0004;
	if ((a6_32 & 0x0F) == 0x0F)
		a5_52 = a5_34 & ~0x08;
	else
		a5_52 = a5_34 & ~0x04;
	a5_52->dw0004 = a2_50;
	a3Out = a3_201;
	s2Out = s2;
	return ra;
}

// 23003EAA: Register Eq_2 ps_check_frame(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_15632 a1, Register Eq_2 a2, Register Eq_2 s2, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Register out Eq_2 s1Out, Register out Eq_15632 a1Out, Register out Eq_15646 a2Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_15648) s4Out, Register out Eq_15649 s5Out, Register out ptr32 s6Out, Register out Eq_15651 s7Out, Register out (ptr32 Eq_15652) s9Out, Register out (ptr32 Eq_15653) s10Out)
// Called from:
//      rxl_cntrl_evt
Eq_2 ps_check_frame(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_15632 a1, Eq_2 a2, Eq_2 s2, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, union Eq_2 & s1Out, union Eq_15632 & a1Out, union Eq_15646 & a2Out, union Eq_2 & a4Out, struct Eq_15648 & s4Out, union Eq_15649 & s5Out, ptr32 & s6Out, union Eq_15651 & s7Out, struct Eq_15652 & s9Out, struct Eq_15653 & s10Out)
{
	if ((word32) g_b42018EB0 == 0x00)
	{
l23003EE8:
		s1Out = s1;
		a1Out = a1;
		a2Out = dwArg48;
		a4Out = a4;
		s4Out = dwArg04;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s9Out = s9;
		s10Out = s10;
		return ra;
	}
	struct Eq_15667 * a5_134;
	word32 a2_133;
	s1 = (word32) *((word32) a0 + 1) << 8 | (word32) (*a0);
	if (((word32) *((word32) a0 + 4) & 0x01) != 0x00)
	{
		struct Eq_15693 * a5_135 = s1 << 0x12;
		if (s1 << 0x12 < 0x00)
		{
			a5_135 = (word32) *((word32) a2 + 94);
			if (a5_135 == null)
				goto l23003EE8;
		}
		a2_133 = a5_135->dw0004;
		a5_134 = a5_135 & ~0x02;
		goto l23003EE6;
	}
	a1 &= 0x0200;
	if ((a1 & 0x0200) != 0x00)
		goto l23003EE8;
	word32 s3_26 = (word32) g_b42018ECD;
	if (s3_26 != 0x00)
	{
		if ((s1 & 0x0088) == 0x0088)
		{
			ui32 a4_38;
			ui32 a5_39;
			if ((s1 & 0x0300) == 0x0300)
			{
				a4_38 = (word32) *((word32) a0 + 30);
				a5_39 = (word32) *((word32) a0 + 31);
			}
			else
			{
				a4_38 = (word32) *((word32) a0 + 24);
				a5_39 = (word32) *((word32) a0 + 25);
			}
			ui32 a5_45 = a5_39 << 8 | a4_38;
			a1.u0 = 587685184;
			if (((word32) *((word32) a2 + 0x0068) >> (word32) (a5_45 & 7)->b23075D40 & 0x01) != 0x00)
			{
				a4 = *(union Eq_2 *) 0x44B00120;
				*((word32) a4 + 100) = a2;
				if ((a5_45 & 0x10) == 0x00)
					goto l23003EE8;
				a2_133 = (a5_45 & 0x10)->dw0004;
				a5_134 = a5_45 & 0x10 & ~0x08;
l23003EE6:
				a5_134->dw0004 = a2_133;
				goto l23003EE8;
			}
l23003FB0:
			s3_26 = 0x00;
			goto l23003F80;
		}
		if ((s1 & 0x0C) != 0x00 || ((word32) (*((word32) a2 + 0x0068)) & 0x08) == 0x00)
			goto l23003FB0;
		*((word32) *(union Eq_2 *) 0x44B00120 + 100) = a2;
	}
l23003F80:
	a1.u0 = 0x01;
	a4 = td_pck_ps_ind(0x01);
	if (s3_26 != 0x00)
		goto l23003EE8;
	struct Eq_15775 * a5_101 = s1 << 0x12;
	if (s1 << 0x12 >= 0x00)
	{
l23003FA8:
		(a5_101 & ~0x04)->dw0004 = a5_101->dw0004;
		goto l23003EE8;
	}
	if (((word32) g_b42018ED4 & 0x08) == 0x00)
	{
		word32 a0_96;
		word32 s2_389;
		word32 s0_387;
		word32 a3_388;
		ra = ps_send_pspoll(ra, fflags, frm, mstatus, s2, dwArg38, s1, dwArg9C, dwArgB8, dwArgD8, dwArgF8, dwArg0108, out s0_387, out s1, out a0_96, out a1, out a3_388, out a4, out a5_101, out s2_389, out s5, out s6, out s7, out s9, out s10);
		if (a0_96 != 0x00)
			goto l23003FA8;
	}
	goto l23003EE8;
}

