pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 23003FB4: Register Eq_2 ps_check_tx_frame(Register (ptr32 Eq_15850) a0, Register (ptr32 Eq_15851) a1)
// Called from:
//      txl_cntrl_push
Eq_2 ps_check_tx_frame(struct Eq_15850 * a0, struct Eq_15851 * a1)
{
	if ((word32) g_b42018EB0 == 0x00 || (a0 == (struct Eq_15850 *) 0x00FF || a1 == (struct Eq_15851 *) 0x00FF))
		return a4;
	struct Eq_15861 * a4_15 = (word32) a0->b420190EA;
	a4 = (word32) a4_15->b4201AA3E;
	if (a4 != 0x00)
		return a4;
	a4 = (word32) a4_15->b4201AA40;
	if (a4 == 0x00)
		return a4;
	uint32 a4_27 = (word32) a4_15->b4201AA50 >> (word32) a1->b23075D40;
	if ((a4_27 & 0x01) == 0x00)
		return td_pck_ps_ind(0x00);
	Eq_2 a5_34 = (a4_27 & 0x01)->t0004;
	(a4_27 & 0x01 | 8)->t0004 = a5_34;
	Eq_2 a4_38 = *(union Eq_2 *) 0x44B00120;
	*((word32) a4_38 + 100) = a5_34;
	return a4_38;
}

// 23004038: Register Eq_2 ps_uapsd_set(Register (ptr32 Eq_15913) a0, Register word32 a1, Register word32 a2, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 s3Out)
// Called from:
//      mm_hw_config_handler
Eq_2 ps_uapsd_set(struct Eq_15913 * a0, word32 a1, word32 a2, Eq_2 a4, ptr32 mstatus, ptr32 & s3Out)
{
	ui32 a1_12 = 0x01 << a1;
	ui32 a5_14 = (word32) a0->b0068;
	if (a2 != 0x00)
	{
		a0->b0068 = (byte) (a5_14 | a1_12 & 0x00FF);
		if ((word32) g_b42018EB0 != 0x00 && (word32) g_b42018ECC == 0x00)
		{
			g_b42018ECD = 0x01;
			word32 s1_41;
			word32 a0_81;
			word32 a1_82;
			word32 a2_83;
			word32 a5_84;
			word32 s2_85;
			word32 s4_86;
			word32 s8_87;
			((word32) mm_timer_set(1107398332, (word32) *(union Eq_2 *) 0x44B00120 + 0x44B00000, a4, mstatus, out s1_41, out a0_81, out a1_82, out a2_83, out a4, out a5_84, out s2_85, out s3, out s4_86, out s8_87) + 28)->u1 = (byte) s1_41;
		}
	}
	else
		a0->b0068 = (byte) (a5_14 & ~(a1_12 & 0x00FF));
	s3Out = s3;
	return a4;
}

// 230040A0: Register Eq_2 ps_traffic_status_update(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_15987) a0, Register ui32 a1, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack word32 dwArg10, Stack word32 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack word32 dwArg0188, Register out Eq_16001 s1Out, Register out Eq_16002 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      td_timer_end
Eq_2 ps_traffic_status_update(Eq_2 ra, Eq_2 s0, struct Eq_15987 * a0, ui32 a1, ptr32 fflags, ptr32 frm, ptr32 mstatus, word32 dwArg10, word32 dwArg14, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, word32 dwArg0188, union Eq_16001 & s1Out, union Eq_16002 & s2Out, ptr32 & mstatusOut)
{
	if ((word32) g_b42018EB0 != 0x00)
	{
		ui32 a5_7 = (word32) g_b42018ED4;
		if ((a5_7 & 1) == 0x00 || (a5_7 & 6) != 0x00)
			goto l230040C6;
		word32 a0_37;
		if (a1 != 0x00)
		{
l230040C2:
			a0_37 = 0x01;
			if ((a5_7 & 0x08) != 0x00)
				goto l230040C6;
			goto l230040E8;
		}
		Eq_2 a4_12 = g_t4201AFC8;
		while (true)
		{
			word32 a2_20;
			if (a4_12 == 0x00)
				break;
			struct Eq_15987 * a3_18 = (word32) *((word32) a4_12 + 87);
			if (a3_18 != a0)
			{
				a2_20 = (word32) *((word32) a4_12 + 88);
				if (a2_20 != 0x00 && ((word32) (*((word32) a4_12 + 86)) == 0x00 && ((word32) a3_18->b4201A3A5 & 0x0C) != 0x00))
					goto l230040E0;
			}
			a4_12 = *a4_12;
		}
		a2_20 = 0x00;
l230040E0:
		if (a2_20 != 0x00)
			goto l230040C2;
		if ((a5_7 & 0x08) != 0x00)
		{
			a0_37 = 0x00;
l230040E8:
			Eq_16001 s1_89;
			Eq_16002 s2_92;
			ptr32 mstatus_109;
			Eq_2 s0_110 = ps_dpsm_update(ra, s0, a0_37, fflags, frm, mstatus, dwArg10, dwArg14, dwArg38, dwArg68, dwArg9C, dwArgB8, dwArgD8, dwArgF8, dwArg0188, out s1_89, out s2_92, out mstatus_109);
			s1Out = s1_89;
			s2Out = s2_92;
			mstatusOut = mstatus_109;
			return s0_110;
		}
	}
l230040C6:
	s1Out = s1;
	s2Out = s2;
	mstatusOut = mstatus;
	return s0;
}

// 23004114: Register Eq_2 mm_ps_change_ind(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Register out Eq_2 s0Out, Register out (ptr32 Eq_16089) s1Out, Register out Eq_16090 a1Out, Register out Eq_16091 a2Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out (ptr32 Eq_16095) s4Out)
// Called from:
//      rxl_cntrl_evt
Eq_2 mm_ps_change_ind(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, union Eq_2 & s0Out, struct Eq_16089 & s1Out, union Eq_16090 & a1Out, union Eq_16091 & a2Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, struct Eq_16095 & s4Out)
{
	Eq_2 a0_20;
	word32 s0_28;
	struct Eq_16098 * s1_29;
	word32 a1_79;
	word32 a2_80;
	word32 a3_81;
	word32 a4_82;
	word32 a5_83;
	word32 a6_84;
	word32 s2_85;
	word32 s3_86;
	word32 s4_87;
	word32 s8_88;
	Eq_2 ra_27 = ke_msg_alloc(ra, 73, 0x0D, 0x02, a4, mstatus, dwArg08, out s0_28, out s1_29, out a0_20, out a1_79, out a2_80, out a3_81, out a4_82, out a5_83, out a6_84, out s2_85, out s3_86, out s4_87, out s8_88);
	s1_29->b420190EC = (byte) s0_28;
	a0_20->u1 = (byte) s1_29;
	*((word32) a0_20 + 1) = (byte) s0_28;
	Eq_16091 a2_51;
	ptr32 a4_53;
	struct Eq_16089 * s1_57;
	ptr32 s2_58;
	ptr32 s3_59;
	struct Eq_16095 * s4_60;
	Eq_16090 a1_64;
	word32 a0_89;
	word32 a3_90;
	word32 a5_91;
	word32 s8_92;
	s0Out = ke_msg_send(a0_20, mstatus, out s1_57, out a0_89, out a1_64, out a2_51, out a3_90, out a4_53, out a5_91, out s2_58, out s3_59, out s4_60, out s8_92);
	s1Out = s1_57;
	a1Out = a1_64;
	a2Out = a2_51;
	a4Out = a4_53;
	s2Out = s2_58;
	s3Out = s3_59;
	s4Out = s4_60;
	return ra_27;
}

// 23004158: Register (ptr32 Eq_16164) rxl_mpdu_transfer(Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg38, Register out Eq_16168 a5Out, Register out Eq_2 s2Out)
// Called from:
//      rxu_mpdu_upload_and_indicate.constprop.11
//      rxu_cntrl_frame_handle
struct Eq_16164 * rxl_mpdu_transfer(Eq_2 a0, ptr32 mstatus, Eq_2 dwArg38, union Eq_16168 & a5Out, union Eq_2 & s2Out)
{
	struct Eq_16170 * s2_13 = *((word32) a0 + 4);
	struct Eq_14534 * s1_17 = s2_13->ptr0008;
	word32 a5_89;
	word32 a4_88;
	struct Eq_14534 * a3_18 = phy_get_channel((char *) &s2_13->ptr0008 + 60, out a4_88, out a5_89);
	s2_13->dw0054 = g_dw4201BA40;
	((word32) a0 + 29)->u1 = 0x00;
	struct Eq_16164 * a4_23 = null;
	while (true)
	{
		ui32 a5_28 = (word32) s1_17->t0010;
		if ((a5_28 & 0x01) != 0x00)
			break;
		a4_23 = a3_18->ptr0004;
		((word32) a0 + 29)->u1 = (byte) ((word32) *((word32) a0 + 29) + 0x01);
		if (a3_18 == null)
		{
			0x00 = (uint16) dwArg38;
			struct Eq_16164 * a4_57;
			Eq_16168 a5_58;
			word32 a2_90;
			assert_rec(mstatus, out a2_90, out a4_57, out a5_58);
			a5Out = a5_58;
			s2Out.u0 = <invalid>;
			return a4_57;
		}
		s1_17 = a3_18;
	}
	s1_17->t0010 = a0;
	a4_23->t000C = a0;
	0x00 = (uint16) dwArg38;
	a5Out = a5_28 & 0x01;
	s2Out.u0 = <invalid>;
	return a4_23;
}

// 230041D6: Register Eq_2 rxl_init(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg0118)
// Called from:
//      mm_init
Eq_2 rxl_init(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, Eq_2 dwArg0118)
{
	word32 a4_52;
	Eq_2 ra_17 = rxl_hwdesc_init(ra, (struct Eq_16244 *) 0x01, a4, mstatus, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0118, out a4_52);
	rx_swdesc_init();
	co_list_init(&g_t42018ED8);
	rxu_cntrl_init();
	return ra_17;
}

