pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 230041F6: void rxl_cntrl_dump(Register Eq_2 a5)
// Called from:
//      bl60x_fw_dump_statistic
void rxl_cntrl_dump(Eq_2 a5)
{
	word32 a5_33;
	if (co_list_cnt(a5, out a5_33) != null)
	{
		Eq_2 a5_13 = g_t42018ED8;
		while (a5_13 != 0x00)
			a5_13 = *a5_13;
	}
}

// 2300421C: Register Eq_2 rxl_timer_int_handler(Register Eq_2 a0, Register Eq_2 a1, Register ptr32 mstatus, Register out Eq_2 a4Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s8Out)
// Called from:
//      chan_ctxt_update
Eq_2 rxl_timer_int_handler(Eq_2 a0, Eq_2 a1, ptr32 mstatus, union Eq_2 & a4Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s8Out)
{
	*(word32 *) 0x000A007C = 0x44B08000;
	Eq_2 a5_16 = 0x44B08000;
	Eq_2 a4_17 = 0x000A0000;
	Eq_2 s1_18 = 0x42019000;
	while (true)
	{
		Eq_2 s0_26 = *((word32) a5_16 + 8);
		if (a5_16 == 0x00 || a4_17 << 0x11 >= 0x00)
			break;
		struct Eq_16309 * a5_58 = *((word32) a1 + 0x0C);
		*((word32) a4_17 + 8) = s0_26;
		a5_16 = a5_58->t0008;
		a1 = *((word32) a0 + 4);
		*((word32) a5_16 + 8) = a1;
		a4_17 = (word32) *((word32) a0 + 28);
		a0 = *((word32) a5_16 + 8);
		if (a4_17 == 0x00)
		{
			if (a5_16 == 0x00)
			{
				*((word32) a1 + 16) = 0x00;
				*((word32) a1 + 0x0C) = null;
				rxl_hd_append(a0, out a4_17, out a5_16);
				continue;
			}
l23004280:
			a1.u0 = 587678428;
			word32 a2_161;
			a0 = assert_rec(mstatus, out a2_161, out a4_17, out a5_16);
			continue;
		}
		if (a5_16 == 0x00)
			goto l23004280;
		a0 = s0_26;
		s1_18 = co_list_push_back(a1, a5_16);
	}
	if (*((word32) s1_18 - 296) == 0x00)
	{
		a4Out = a4_17;
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		s8Out.u0 = <invalid>;
		return <invalid>;
	}
	else
	{
		word32 a5_160;
		a4Out = ke_evt_set(0x00040000, a4_17, mstatus, out a5_160);
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		s8Out.u0 = <invalid>;
		return <invalid>;
	}
}

// 230042D0: Register word32 rxl_timeout_int_handler()
// Called from:
//      hal_machw_gen_handler
word32 rxl_timeout_int_handler()
{
	*(union Eq_2 *) 0x44B0808C &= -65;
	return 0x44B08000;
}

// 230042E2: void rxl_dma_int_handler()
void rxl_dma_int_handler()
{
	while (true)
		;
}

// 230042E4: void rxl_dma_evt(Register Eq_2 a4, Register ptr32 mstatus)
void rxl_dma_evt(Eq_2 a4, ptr32 mstatus)
{
	ke_evt_clear(0x00100000, a4, mstatus);
	((union Eq_2 *) 0x40)->u0 = 0x44A00000;
}

// 23004300: Register word32 rxl_frame_release(Register Eq_2 a1, Register Eq_2 a2, Stack Eq_2 dwArg28)
// Called from:
//      my_pbuf_free_custom
word32 rxl_frame_release(Eq_2 a1, Eq_2 a2, Eq_2 dwArg28)
{
	Eq_2 a0_14 = *((word32) a1 + 0x0C);
	rxl_pd_append(a0_14, a1, a2, dwArg28);
	word32 a4_35;
	word32 a5_36;
	return rxl_hd_append(a0_14, out a4_35, out a5_36);
}

// 23004320: Register word32 rxl_mpdu_free(Register (ptr32 Eq_16412) s0, Register Eq_2 a1, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_16420 a4Out, Register out ptr32 a5Out, Register out Eq_2 s8Out)
// Called from:
//      rxl_cntrl_evt
//      rxu_swdesc_upload_evt
//      my_pbuf_free_custom
word32 rxl_mpdu_free(struct Eq_16412 * s0, Eq_2 a1, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_16420 & a4Out, ptr32 & a5Out, union Eq_2 & s8Out)
{
	struct Eq_16423 * a5_14;
	vTaskEnterCritical(a4, mstatus, out a5_14);
	Eq_16431 a0_18 = a5_14->t0004;
	*((word32) a0_18 + 30) = 0x00;
	a5_14->dw0060 = 0x00;
	struct Eq_16443 * a4_17 = null;
	while (true)
	{
		ui32 a5_23 = (word32) s0->t0010;
		s0->dw0014 = 0x00;
		if ((a5_23 & 0x01) != 0x00)
			break;
		a4_17 = (a5_23 & 0x01)->ptr0004;
		if ((a5_23 & 0x01) == 0x00)
		{
			Eq_16420 a4_59;
			ptr32 a5_60;
			word32 a2_100;
			assert_rec(mstatus, out a2_100, out a4_59, out a5_60);
			a1Out.u0 = 587678428;
			a3Out = a3;
			a4Out = a4_59;
			a5Out = a5_60;
			s8Out.u0 = <invalid>;
			return s1;
		}
		s0 = a5_23 & 0x01;
	}
	s0->t0010 = a0_18;
	a4_17->t000C = a0_18;
	Eq_2 a3_35 = rxl_frame_release(a1, dwArg24, dwArg08);
	ptr32 a5_45;
	Eq_16420 a4_47;
	Eq_2 a3_46 = vTaskExitCritical(a3_35, mstatus, out a4_47, out a5_45);
	a1Out = a1;
	a3Out = a3_46;
	a4Out = a4_47;
	a5Out = a5_45;
	s8Out.u0 = <invalid>;
	return s1_38;
}

// 23004384: Register Eq_2 rxl_cntrl_evt(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register ptr32 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack word32 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 s3Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      chan_ctxt_update
Eq_2 rxl_cntrl_evt(Eq_2 ra, Eq_2 s1, Eq_2 a1, ptr32 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, Eq_2 s10, Eq_2 s11, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, word32 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_2 & s3Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	Eq_2 s6_221 = 0x42018F20;
	Eq_2 s7_226 = 0x4201A410;
	s5_211 = s5;
	s3_1717 = s3;
	while (true)
	{
		Eq_2 s3_1717;
		Eq_2 s5_211;
		Eq_2 s9_227 = g_t42018ED8;
		struct Eq_16412 * s0_42 = &g_ptr42019000;
		Eq_2 a5_49 = ke_evt_clear(0x00040000, a4, mstatus);
		if (s9_227 == 0x00)
			break;
		Eq_2 a2_121 = dwArg74;
		if (a5_49 == ~0x00)
		{
			word32 a5_1758;
			ke_evt_set(0x00040000, a4, mstatus, out a5_1758);
			break;
		}
		ptr32 frm_687;
		ptr32 fflags_686;
		__csrrc(mstatus, 0x08);
		word32 a5_1757;
		co_list_pop_front(a4, (word32) a5_49 - 1, out a5_1757);
		__csrrs(mstatus, 0x08);
		struct Eq_16566 * s8_57 = *((word32) s9_227 + 4);
		struct Eq_16571 * s2_58 = s8_57->ptr0008;
		if (s2_58 == null)
		{
l2300443A:
			word32 a2_1759;
			word32 a5_1760;
			assert_rec(mstatus, out a2_1759, out a4, out a5_1760);
			a1.u0 = 587678428;
			goto l2300443E;
		}
		Eq_15632 s11_225 = s8_57->t0040;
		a4 = s11_225 & 0x02002000;
		if ((s11_225 & 0x02002000) == 0x02002000)
		{
			uint32 a5_63 = s11_225 >> 0x0F << 16;
			s0_42 = a5_63 >> 16 & 0x03FF;
			if ((a5_63 >> 16 & 1016) == 0x00)
				goto l2300443A;
			Eq_2 s0_105 = (char *) s0_42 - 8 & 0x00FF;
			s4 = (word32) s6_221 + ((word32) s0_105 + 432);
			if ((word32) *((word32) s4 + 29) == 0x00)
			{
				s8_57->t0040 = s11_225 & ~0x02000000;
				goto l230044A2;
			}
			s1 = (word32) *((word32) s4 + 26);
			word32 a5_1761;
			*((word32) s4 + 424) = xTaskGetTickCount(out a5_1761);
			s10 = s2_58->t0008;
			Eq_2 s3_192 = (word32) s7_226 + ((word32) (((word32) s7_226 + ((word32) s1 + 0x05D8)) + 87) + 0x05D8);
			s5_211 = (word32) *s10;
			if ((word32) *((word32) s3_192 + 86) == 0x02)
			{
				if ((word32) *((word32) s4 + 28) == 0x01)
				{
					if ((s5_211 & 0x0100040C) == 0x08)
					{
						Eq_11075 s0_448;
						Eq_2 s3_451;
						Eq_2 a4_460;
						struct Eq_16796 * s3_472;
						word32 s1_1764;
						word32 a4_1767;
						word32 a2_1766;
						word32 a1_1765;
						word32 s2_1768;
						word32 s4_1769;
						ra = apm_tx_int_ps_clear(mm_ps_change_ind(ra, 0x08, mstatus, 587685184, out s0_448, out s1_1764, out a1_1765, out a2_1766, out a4_1767, out s2_1768, out s3_451, out s4_1769), s3_451, s0_448, s5_211, mstatus, 587685184, dwLoc08, dwArg08, s3, dwArgA8, out s0_105, out s1, out a1, out a2_121, out a4_460, out s3_472, out s4, out s5_211, out s6_221, out s7_226, out s9_227, out s10, out s11_225);
						ui32 a5_486 = (word32) s3_472->b034A + ~0x00 & 0x00FF;
						s3_472->b034A = (byte) a5_486;
						if (a5_486 == 0x00)
						{
							Eq_11075 s2_502;
							Eq_2 s3_503;
							word32 s0_1770;
							word32 s1_1771;
							word32 s4_1775;
							word32 a4_1776;
							word32 a1_1772;
							word32 a4_1774;
							word32 a2_1773;
							word32 s3_1777;
							ra = apm_tx_int_ps_clear(mm_ps_change_ind(ra, a4_460, mstatus, 587685184, out s0_1770, out s1_1771, out a1_1772, out a2_1773, out a4_1774, out s2_502, out s3_503, out s4_1775), s3_503, s2_502, s5_211, mstatus, 587685184, dwLoc08, dwArg08, s3, dwArgA8, out s0_105, out s1, out a1, out a2_121, out a4_1776, out s3_1777, out s4, out s5_211, out s6_221, out s7_226, out s9_227, out s10, out s11_225);
						}
						goto l2300452E;
					}
					if ((s5_211 & 252) == 0x00A4)
					{
						struct Eq_16908 * s2_154 = (word32) s6_221 + ((word32) s0_105 + 432);
						if (((word32) s2_154->b0032 & 0x02) != 0x00)
						{
							s2_154->dw0034 |= 1;
							struct Eq_16990 * s2_208;
							word32 a0_1794;
							word32 a6_1795;
							ra = sta_mgmt_send_postponed_frame(ra, s3_192, s4, s5_211, mstatus, dwArg08, 0x2308DD88, dwArg4C, dwArgB8, out s0_105, out s1, out a0_1794, out a1, out a2_121, out a3, out a6_1795, out s2_208, out s3_192, out s4, out s5_211, out s6_221, out s7_226, out s9_227, out s10, out s11_225);
							s2_208->dw0034 &= ~0x01;
						}
						else
						{
							Eq_2 a0_161;
							word32 s0_169;
							word32 s4_1787;
							word32 a2_1780;
							word32 a1_1779;
							word32 s1_1778;
							word32 a3_1781;
							word32 a5_1783;
							word32 a4_1782;
							word32 s2_1785;
							word32 s3_1786;
							word32 s8_1788;
							word32 a6_1784;
							ra = ke_msg_alloc(ra, 74, 0x0D, 0x03, 0x00A4, mstatus, dwLoc58, out s0_169, out s1_1778, out a0_161, out a1_1779, out a2_1780, out a3_1781, out a4_1782, out a5_1783, out a6_1784, out s2_1785, out s3_1786, out s4_1787, out s8_1788);
							a0_161->u1 = (byte) s0_169;
							((word32) a0_161 + 1)->u1 = 0x01;
							((word32) a0_161 + 2)->u1 = 0x00;
							word32 a4_1790;
							word32 a5_1791;
							word32 a0_1789;
							word32 s2_1792;
							word32 s8_1793;
							s0_105 = ke_msg_send(a0_161, mstatus, out s1, out a0_1789, out a1, out a2_121, out a3, out a4_1790, out a5_1791, out s2_1792, out s3_192, out s4, out s8_1793);
						}
					}
					if ((s5_211 & 0x008C) != 0x0088)
						goto l2300452E;
					ui32 a5_238;
					if ((s5_211 & 0x0300) == 0x0300)
						a5_238 = (word32) *((word32) s10 + 30);
					else
						a5_238 = (word32) *((word32) s10 + 24);
					struct Eq_17034 * s2_261 = (word32) s6_221 + ((word32) s0_105 + 432);
					s4 = s7;
					if (((word32) ((word32) (a5_238 & 0x07)->b0300 + a3) & (word32) s2_261->b00F2) == 0x00)
						goto l2300452E;
					ui32 a3_264 = (word32) s2_261->b0032;
					int32 a4_265 = s2_261->dw0034;
					a2_121 = a3_264 & 0x0C;
					if ((a3_264 & 0x0C) != 0x00)
					{
						if ((a4_265 & 0x06) != 0x00)
							goto l2300452E;
						if ((a3_264 & 0x08) != 0x00)
						{
							s2_261->dw0034 = 0x02;
							int32 a0_286;
							int32 a6_301;
							word32 a1_1797;
							word32 s3_1801;
							word32 s4_1802;
							word32 a2_1798;
							word32 s1_1796;
							word32 s2_1800;
							word32 a3_1799;
							ra = sta_mgmt_send_postponed_frame(ra, s3_192, s7, s5_211, mstatus, dwArg08, 0x2308DD88, dwArg4C, dwArgB8, out s0_105, out s1_1796, out a0_286, out a1_1797, out a2_1798, out a3_1799, out a6_301, out s2_1800, out s3_1801, out s4_1802, out s5_211, out s6_221, out s7_226, out s9_227, out s10, out s11_225);
							if (a6_301 != 0x00 && a6_301 - a0_286 <= 0x00)
								goto l23004670;
						}
						Eq_2 a4_317 = (word32) s6_221 + ((word32) s0_105 + 432);
						if (((word32) *((word32) a4_317 + 50) & 0x04) != 0x00)
						{
							*(union Eq_2 *) 0x38 = a4_317;
							Eq_2 a0_332;
							word32 a6_338;
							word32 s0_340;
							word32 a5_1811;
							word32 s4_1814;
							word32 s8_1815;
							word32 s2_1812;
							word32 s3_1813;
							word32 s1_1806;
							word32 a3_1809;
							word32 a4_1810;
							word32 a2_1808;
							word32 a1_1807;
							ra = ke_msg_alloc(ra, 74, 0x0D, 0x03, a4_317, mstatus, dwLoc58, out s0_340, out s1_1806, out a0_332, out a1_1807, out a2_1808, out a3_1809, out a4_1810, out a5_1811, out a6_338, out s2_1812, out s3_1813, out s4_1814, out s8_1815);
							a0_332->u1 = (byte) s0_340;
							*((word32) a0_332 + 1) = (byte) a6_338;
							((word32) a0_332 + 2)->u1 = 0x01;
							word32 a0_1816;
							word32 a5_1819;
							word32 s8_1822;
							word32 s2_1820;
							word32 s3_1821;
							word32 a3_1817;
							word32 a4_1818;
							s0_105 = ke_msg_send(a0_332, mstatus, out s1, out a0_1816, out a1, out a2_121, out a3_1817, out a4_1818, out a5_1819, out s2_1820, out s3_1821, out s4, out s8_1822);
							goto l2300452E;
						}
l23004670:
						goto l2300467A;
					}
					if ((a4_265 & 0x06) == 0x00)
					{
						s2_261->dw0034 = 0x02;
l2300467A:
						struct Eq_17381 * s2_423;
						word32 a5_1825;
						word32 s3_1826;
						word32 a3_1824;
						word32 a0_1823;
						ra = txl_frame_send_qosnull_frame(s9_227, s10, fflags, frm, mstatus, dwArg08, s3, dwArg0128, out s0_105, out s1, out a0_1823, out a1, out a2_121, out a3_1824, out a5_1825, out s2_423, out s3_1826, out s4, out s5_211, out s6_221, out s7_226, out s9_227, out s10, out s11_225);
						s2_423->dw0034 = 0x00;
					}
				}
				else if ((s5_211 & 0x01000400) == 0x01000000)
				{
					Eq_2 a4_101;
					struct Eq_17252 * s3_108;
					word32 s2_107;
					ra = mm_ps_change_ind(ra, 0x01000000, mstatus, 587685184, out s0_105, out s1, out a1, out a2_121, out a4_101, out s2_107, out s3_108, out s4);
					if ((word32) s3_108->b034A == 0x00)
					{
						word32 s3_1805;
						word32 a4_1804;
						ra = mm_ps_change_ind(ra, a4_101, mstatus, 587685184, out s0_105, out s1, out a1, out a2_121, out a4_1804, out s2_107, out s3_1805, out s4);
					}
					struct Eq_17272 * s2_141 = (word32) s7_226 + (s2_107 + 0x05D8);
					s2_141->b034A = (byte) ((word32) s2_141->b034A + 0x01);
				}
			}
l2300452E:
			a4 = (word32) ((word32) s7_226 + ((word32) s1 + 0x05D8) + 88);
			if (a4 == 0x00)
				goto l230044A2;
			Eq_2 s2_552 = s5_211 & 4;
			if (s2_552 == 0x00)
			{
				a2_121.u0 = 0x01;
				a1 = s0_105;
				a4 = td_pck_ind(0x01);
			}
			s1 = (word32) s7_226 + ((word32) s1 + 0x05D8);
			if ((word32) *((word32) s1 + 86) != 0x00)
				goto l230044A2;
			s5_211 &= 252;
			if (s5_211 == 0x0080)
			{
				struct Eq_17114 * a2_638;
				Eq_5614 fa0_646;
				ptr32 fflags_647;
				ptr32 frm_648;
				struct Eq_11579 * a5_668;
				struct Eq_11578 * a4_671;
				struct Eq_11576 * s1_682;
				struct Eq_15402 * a0_704;
				struct Eq_15403 * s1_714;
				Eq_2 s10_715;
				Eq_2 s9_724;
				Eq_2 a3_737;
				Eq_2 s2_747;
				struct Eq_8927 * a5_764;
				Eq_2 a3_768;
				ra = vif_mgmt_bcn_recv(ps_check_beacon(mm_check_beacon(pa_adapt(pa_input(ra, null, fflags, frm, dwLoc38, out a2_638, out fa0_646, out fflags_647, out frm_648), null, a2_638, fa0_646, fflags_647, frm_648, mstatus, dwArg58, out s1_682, out a4_671, out a5_668, out fflags_686, out frm_687), s1_682, fp + -0x0044, a4_671, a5_668, fflags_686, frm_687, mstatus, s8, s6, dwLoc14, dwLoc0C, dwArg08, dwArg28, dwArg48, dwArg68, dwArg9C, dwArgD8, out s1_714, out a0_704, out s9_724, out s10_715), a0_704, s1_714, s9_724, s10_715, fflags_686, frm_687, mstatus, dwLoc28, dwLoc08, dwArg08, s11, s3, dwArg58, dwArg78, dwArg98, dwArgA8, dwArg0118, out a3_737, out s2_747), a3_737, s2_747, mstatus, 587685184, dwLoc58, 0x2308DD88, dwArg88, dwArgE8, out s0_42, out a1, out a2_121, out a3_768, out a4, out a5_764, out s3_1717, out s4, out s5_211, out s6_221, out s7_226, out s9_227, out s10);
				dwArg24.u0 = 0x00;
				s1 = a5_764->t0040;
				if (a5_764 != null)
				{
					word32 a3_1803;
					ra = chan_tbtt_switch_update(ra, a1, a3_768, a5_764, mstatus, 587685184, s5, dwArgA8, dwArg0108, out s0_42, out s1, out a1, out a2_121, out a3_1803, out a4, out s3_1717, out s4, out s5_211, out s6_221, out s7_226, out s9_227, out s10);
				}
				frm = frm_687;
				fflags = fflags_686;
				if (s0_42 == null)
					goto l2300443E;
				frm = frm_687;
				fflags = fflags_686;
			}
			else if (s2_552 == 0x00)
				ra = ps_check_frame(ra, s1, s10, s11_225, s1, s2_552, fflags, frm, mstatus, dwLoc38, s11, dwArg48, dwArg68, dwArg88, dwArg98, out s1, out a1, out a2_121, out a4, out s4, out s5_211, out s6_221, out s7_226, out s9_227, out s10);
		}
l230044A2:
		word32 a0_909;
		ra = rxu_cntrl_frame_handle(ra, s1, s9_227, a1, a2_121, a4, s4, s5_211, s6_221, s7_226, s10, fflags, frm, mstatus, 587685184, dwLoc58, s8, s6, dwLoc38, dwLoc18, dwLoc08, dwArg04, dwArg08, (word32) a5_49 - 1, 0x2308DD88, dwArg24, dwArg28, s11, s7, s5, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg94, dwArg9C, dwArgA8, out s0_42, out s1, out a0_909, out a1, out a3, out a4, out s3_1717, out s4, out s5_211, out s6_221, out s7_226, out s10, out fflags, out frm);
		if (a0_909 != 0x00)
			continue;
l2300443E:
		word32 a5_1762;
		word32 s8_1763;
		s1 = rxl_mpdu_free(s0_42, a1, a4, mstatus, 587685184, s8, out a1, out a3, out a4, out a5_1762, out s8_1763);
	}
	s0Out = 0x42019000;
	s3Out = s3_1717;
	fflagsOut = fflags;
	frmOut = frm;
	return dwLoc24;
}

// 23004750: void bl60x_firmwre_mpdu_free(Register (ptr32 Eq_16412) s0, Register (ptr32 Eq_17428) a0, Register Eq_2 a1, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24)
// Called from:
//      my_pbuf_free_custom
void bl60x_firmwre_mpdu_free(struct Eq_16412 * s0, struct Eq_17428 * a0, Eq_2 a1, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24)
{
	word32 a5_43;
	Eq_2 a4_11 = vTaskEnterCritical(a4, mstatus, out a5_43);
	Eq_2 a3_14 = (word32) a0->b001D;
	(a4_11 - a3_14)->dw0014 = (word32) *((word32) a4_11 + 20);
	Eq_2 a4_20;
	word32 a5_44;
	vTaskExitCritical(a3_14, mstatus, out a4_20, out a5_44);
	word32 a1_45;
	word32 a3_46;
	word32 a4_47;
	word32 a5_48;
	word32 s8_49;
	rxl_mpdu_free(s0, a1, a4_20, mstatus, dwArg08, dwArg24, out a1_45, out a3_46, out a4_47, out a5_48, out s8_49);
}

