pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300477C: Register Eq_2 rxl_reset(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg0118, Register out ptr32 a4Out)
// Called from:
//      mm_force_idle_req
//      bl_reset_evt
Eq_2 rxl_reset(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, Eq_2 dwArg0118, ptr32 & a4Out)
{
	ptr32 a4_13;
	Eq_2 ra_17 = rxl_hwdesc_init(ra, null, a4, mstatus, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0118, out a4_13);
	co_list_init(&g_t42018ED8);
	co_list_init(&g_dw4201BA08);
	a4Out = a4_13;
	return ra_17;
}

// 230047A0: Register word32 rxl_hwdesc_dump(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack word32 dwArg0128)
// Called from:
//      bl60x_fw_dump_statistic
word32 rxl_hwdesc_dump(Eq_2 ra, Eq_2 a3, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, word32 dwArg0128)
{
	word32 s8_321;
	word32 s4_320;
	word32 a5_319;
	word32 a4_318;
	word32 a2_317;
	word32 a1_316;
	word32 a0_315;
	puts(587679776, out a0_315, out a1_316, out a2_317, out a4_318, out a5_319, out s4_320, out s8_321);
	word32 a4_326;
	word32 a2_325;
	word32 a1_324;
	word32 a0_323;
	word32 s1_322;
	word32 t4_339;
	word32 s9_336;
	word32 s10_337;
	word32 s11_338;
	word32 s6_333;
	word32 s7_334;
	word32 s8_335;
	word32 s3_330;
	word32 s4_331;
	word32 s5_332;
	word32 a5_327;
	word32 a7_328;
	word32 s2_329;
	Eq_2 a3_146;
	Eq_2 ra_149 = printf(ra, &g_t23074848, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_322, out a0_323, out a1_324, out a2_325, out a3_146, out a4_326, out a5_327, out a7_328, out s2_329, out s3_330, out s4_331, out s5_332, out s6_333, out s7_334, out s8_335, out s9_336, out s10_337, out s11_338, out t4_339);
	word32 s5_156 = 0x23075000;
	do
	{
		Eq_2 a3_84;
		word32 s4_93;
		struct Eq_17554 * a5_109;
		word32 s3_121;
		word32 s1_150;
		word32 s2_153;
		word32 s9_353;
		word32 s8_352;
		word32 s7_351;
		word32 s6_350;
		word32 s5_349;
		word32 s3_348;
		word32 a5_345;
		word32 a7_346;
		word32 s2_347;
		word32 a1_342;
		word32 a2_343;
		word32 a4_344;
		word32 s1_340;
		word32 a0_341;
		word32 s10_354;
		word32 s11_355;
		word32 t4_356;
		word32 s1_357;
		word32 a0_358;
		word32 a1_359;
		word32 a2_360;
		word32 a3_361;
		word32 a4_362;
		word32 a7_363;
		word32 s2_364;
		word32 s4_365;
		word32 s5_366;
		word32 s6_367;
		word32 s7_368;
		word32 s8_369;
		word32 s9_370;
		word32 s10_371;
		word32 s11_372;
		word32 t4_373;
		word32 a0_374;
		word32 a1_375;
		word32 a2_376;
		word32 a4_377;
		word32 a5_378;
		word32 a7_379;
		word32 s3_380;
		word32 s4_381;
		word32 s6_382;
		word32 s7_383;
		word32 s8_384;
		word32 s9_385;
		word32 s10_386;
		word32 s11_387;
		word32 t4_388;
		ra_149 = printf(printf(printf(ra_149, s5_156 + -0x07A0, a3_146, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_340, out a0_341, out a1_342, out a2_343, out a3_84, out a4_344, out a5_345, out a7_346, out s2_347, out s3_348, out s4_93, out s5_349, out s6_350, out s7_351, out s8_352, out s9_353, out s10_354, out s11_355, out t4_356), s4_93 + -0x0754, a3_84, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_357, out a0_358, out a1_359, out a2_360, out a3_361, out a4_362, out a5_109, out a7_363, out s2_364, out s3_121, out s4_365, out s5_366, out s6_367, out s7_368, out s8_369, out s9_370, out s10_371, out s11_372, out t4_373), s3_121 + -0x06F4, a5_109->ptr0040->t002C, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_150, out a0_374, out a1_375, out a2_376, out a3_146, out a4_377, out a5_378, out a7_379, out s2_153, out s3_380, out s4_381, out s5_156, out s6_382, out s7_383, out s8_384, out s9_385, out s10_386, out s11_387, out t4_388);
	} while (s1_150 != s2_153);
	word32 s1_389;
	word32 a0_390;
	word32 a1_391;
	word32 a2_392;
	word32 a3_393;
	word32 a5_394;
	word32 a7_395;
	word32 s2_396;
	word32 s3_397;
	word32 s4_398;
	word32 s5_399;
	word32 s6_400;
	word32 s7_401;
	word32 s8_402;
	word32 s9_403;
	word32 s10_404;
	word32 s11_405;
	word32 t4_406;
	word32 * a4_173;
	Eq_2 ra_175 = printf(ra_149, &g_t23074984, a3_146, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_389, out a0_390, out a1_391, out a2_392, out a3_393, out a4_173, out a5_394, out a7_395, out s2_396, out s3_397, out s4_398, out s5_399, out s6_400, out s7_401, out s8_402, out s9_403, out s10_404, out s11_405, out t4_406);
	struct Eq_17725 * s0_189 = &g_dw42046120;
	word32 s3_191 = 0x23075000;
	do
	{
		int32 a7_195 = s0_189->dw000C;
		int32 a6_196 = s0_189->dw0008;
		Eq_2 a3_197 = 0x00;
		if (a7_195 != 0x00)
			a3_197 = a7_195 + 1 - a6_196;
		s0_189 = *a4_173 + 52;
		word32 a5_225;
		word32 s1_233;
		word32 s2_236;
		word32 a0_407;
		word32 a1_408;
		word32 a2_409;
		word32 a3_410;
		word32 a7_411;
		word32 s4_412;
		word32 s5_413;
		word32 s6_414;
		word32 s7_415;
		word32 s8_416;
		word32 s9_417;
		word32 s10_418;
		word32 s11_419;
		word32 t4_420;
		ra_175 = printf(ra_175, s3_191 + -0x0664, a3_197, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_233, out a0_407, out a1_408, out a2_409, out a3_410, out a4_173, out a5_225, out a7_411, out s2_236, out s3_191, out s4_412, out s5_413, out s6_414, out s7_415, out s8_416, out s9_417, out s10_418, out s11_419, out t4_420);
	} while (s1_233 != s2_236);
	0x00 = dwArg0128;
	return a5_225;
}

// 230048AC: Register Eq_2 rxl_hwdesc_init(Register Eq_2 ra, Register (ptr32 Eq_16244) a0, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0128, Register out ptr32 a4Out)
// Called from:
//      rxl_init
//      rxl_reset
Eq_2 rxl_hwdesc_init(Eq_2 ra, struct Eq_16244 * a0, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArg0128, ptr32 & a4Out)
{
	word32 a5_744;
	vTaskEnterCritical(a4, mstatus, out a5_744);
	struct Eq_16244 * s3_126 = a0;
	Eq_2 a5_27 = 0x42043000;
	Eq_2 s2_125 = 0x00;
	Eq_2 s4_127 = 0x00;
	Eq_2 s0_136 = 0x00;
	int32 a1_31 = 0x00;
	ui32 a4_32;
	a0_382 = a0;
	for (a4_32 = 0x00; a4_32 != 0x0D; ++a4_32)
	{
		struct Eq_16244 * a0_382;
		Eq_2 a6_38 = (word32) a5_27 + 100;
		if (a0 == null)
		{
			a5_27 = a0_382->t0060;
			if (a0_382 != (struct Eq_16244 *) 0x01)
				goto l230049F8;
			if (s0_136 != 0x00)
				*((word32) s0_136 + 4) = 0x00;
		}
		else
		{
l230049F8:
			if (s0_136 != 0x00)
				*((word32) a5_27 + 4) = s0_136;
			struct Eq_17827 * a0_51 = a4_32 << 0x05;
			*((word32) a5_27 + 16) = 0x00;
			*((word32) a5_27 + 20) = 0x00;
			*(union Eq_2 *) ~0x45520FF2 = a5_27;
			*((word32) a5_27 + 64) = 0x00;
			*((word32) a5_27 + 24) = 0x00;
			*((word32) a5_27 + 4) = a6_38;
			*((word32) a5_27 + 8) = 0x00;
			a0_51->t4201D28C = a5_27;
			*((word32) a5_27 + 28) = 0x00;
			a0_382 = (struct Eq_16244 *) ((char *) a0_51 + 0x4201D280);
			if (a1_31 != 0x00)
			{
				if (a1_31 == 0x01)
					s4_127 = a5_27;
			}
			else
				s2_125 = a5_27;
			++a1_31;
			s0_136 = a5_27;
		}
		a5_27 = a6_38;
	}
	if (a1_31 <= 0x03)
	{
		word32 s10_758;
		word32 s11_759;
		word32 s8_756;
		word32 s9_757;
		word32 s6_754;
		word32 t4_760;
		word32 s7_755;
		word32 a2_748;
		word32 a3_749;
		word32 a4_750;
		word32 a7_752;
		word32 a5_751;
		word32 a1_747;
		word32 a0_746;
		word32 s1_745;
		word32 s5_753;
		ra = printf(ra, &g_t23074A18, ~0x45520FF2, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_745, out a0_746, out a1_747, out a2_748, out a3_749, out a4_750, out a5_751, out a7_752, out s2_125, out s3_126, out s4_127, out s5_753, out s6_754, out s7_755, out s8_756, out s9_757, out s10_758, out s11_759, out t4_760);
	}
	if (s0_136 != 0x00)
		*((word32) s0_136 + 4) = 0x00;
	*(union Eq_2 *) 0x44B081B8 = s4_127;
	((union Eq_2 *) 0x44B08180)->u0 = 0x04000000;
	Eq_2 a4_150 = 0x42046120;
	Eq_2 a3_153 = 0x42043600;
	Eq_2 s5_155 = 0x00;
	Eq_2 a5_156 = 0x00;
	Eq_2 s1_157 = 0x00;
	int32 a1_158 = 0x00;
	do
	{
		Eq_2 a0_162 = (word32) a4_150 + 52;
		if (s3_126 == null && *((word32) a4_150 + 20) == 0x01)
		{
			if (s1_157 != 0x00)
				*((word32) s1_157 + 4) = 0x00;
		}
		else
		{
			if (s1_157 != 0x00)
				*((word32) a4_150 + 4) = s1_157;
			*((word32) a0_162 + 4) = a4_150;
			*(union Eq_2 *) ~0x3F212452 = a4_150;
			*((word32) a4_150 + 16) = 0x00;
			a3_153.u27->dw0008 = (word32) a4_150;
			*((word32) a4_150 + 0x0C) = (char *) &a3_153.u27->dw0018 + 0x0337;
			a3_153.u27->dw0018 = (word32) a4_150;
			if (a1_158 != 0x00)
			{
				if (a1_158 == 0x01)
					a5_156 = a4_150;
			}
			else
				s5_155 = a4_150;
			++a1_158;
			s1_157 = a4_150;
		}
		a4_150 = a0_162;
		++a3_153.u27;
	} while (a0_162 != 0x420463C4);
	if (a1_158 <= 0x03)
	{
		word32 s8_770;
		word32 s7_769;
		word32 s9_771;
		word32 s10_772;
		word32 s11_773;
		word32 t4_774;
		word32 s3_767;
		word32 s6_768;
		word32 a7_766;
		word32 a1_762;
		word32 a0_761;
		word32 a4_765;
		word32 a3_764;
		word32 a2_763;
		ra = printf(ra, &g_t23074A30, a3_153, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_157, out a0_761, out a1_762, out a2_763, out a3_764, out a4_765, out a5_156, out a7_766, out s2_125, out s3_767, out s4_127, out s5_155, out s6_768, out s7_769, out s8_770, out s9_771, out s10_772, out s11_773, out t4_774);
	}
	*((word32) s1_157 + 4) = 0x00;
	*(union Eq_2 *) 0x44B081BC = a5_156;
	((union Eq_2 *) 0x44B08180)->u0 = 0x08000000;
	Eq_2 a3_264 = 0x08000000;
	if (s2_125 == 0x00 || (s4_127 == 0x00 || (s0_136 == 0x00 || (s5_155 == 0x00 || a5_156 == 0x00))))
	{
		word32 s8_784;
		word32 s6_782;
		word32 s7_783;
		word32 s11_787;
		word32 s9_785;
		word32 s10_786;
		word32 a5_779;
		word32 a4_778;
		word32 a2_777;
		word32 a0_775;
		word32 a1_776;
		word32 t4_788;
		word32 a7_780;
		word32 s3_781;
		ra = printf(ra, &g_t23074A50, s0_136, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_157, out a0_775, out a1_776, out a2_777, out a3_264, out a4_778, out a5_779, out a7_780, out s2_125, out s3_781, out s4_127, out s5_155, out s6_782, out s7_783, out s8_784, out s9_785, out s10_786, out s11_787, out t4_788);
	}
	g_t42018EE8 = s2_125;
	g_t42018EE0 = s4_127;
	*((word32) s0_136 + 0x0C) = 0x42018ED8;
	g_t42018EF4 = s5_155;
	s1_157->u0 = 0x42018EF0;
	0x00 = (uint16) dwArg0128;
	ptr32 a4_377;
	word32 a5_789;
	vTaskExitCritical(a3_264, mstatus, out a4_377, out a5_789);
	a4Out = a4_377;
	return ra;
}

