pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 23004A5E: Register word32 rxl_hd_append(Register Eq_2 a0, Register out (ptr32 Eq_16362) a4Out, Register out (ptr32 Eq_16363) a5Out)
// Called from:
//      rxl_timer_int_handler
//      rxl_frame_release
word32 rxl_hd_append(Eq_2 a0, struct Eq_16362 & a4Out, struct Eq_16363 & a5Out)
{
	Eq_2 s0_22 = a0;
	if (a0 != 0x00)
	{
		Eq_2 a4_19 = g_t42018EE8;
		if (a4_19 != *((union Eq_2 *) 1152419144))
		{
			*((word32) a0 + 16) = 0x42018ED8;
			s0_22 = a4_19;
		}
		((word32) s0_22 + 4)->u0 = 0x00;
		*((word32) s0_22 + 8) = null;
		((word32) s0_22 + 64)->u0 = 0x00;
		*((word32) s0_22 + 28) = 0x00;
		*((word32) s0_22 + 4) = a4_19;
		((union Eq_2 *) 0x44B08180)->u0 = 0x01000000;
		struct Eq_16363 * a5_34 = *(struct Eq_16363 **) 0x44B08008;
		*((word32) s0_22 + 0x0C) = a5_34;
		if (false)
			*((word32) s0_22 + 8) = a5_34;
		a4Out = (struct Eq_16362 *) 0x44B08000;
		a5Out = a5_34;
		return 0x01000000;
	}
	else
		assert_err();
}

// 23004ACE: void rxl_pd_append(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Stack Eq_2 dwArg38)
// Called from:
//      rxl_frame_release
void rxl_pd_append(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 dwArg38)
{
	Eq_2 s2_13 = a0;
	Eq_2 s1_15 = a1;
	Eq_2 s0_17 = a2;
	if (a2 != 0x00)
	{
		Eq_2 a3_24 = *(union Eq_2 *) 1152419148;
		Eq_2 a4_27 = g_t42018EF4;
		if (a4_27 == a3_24)
		{
			if (a1 == 0x00)
				s2_13 = a2;
			*((word32) a2 + 16) = 0x00;
			a4_27 = s2_13;
		}
		else
		{
			*((word32) a2 + 4) = 0x42018EF0;
			if (a1 != 0x00)
				*((word32) a4_27 + 4) = a0;
			else
				s1_15 = a4_27;
			*((word32) a4_27 + 16) = 0x00;
			s0_17 = s1_15;
		}
		word32 a5_45 = *a3_24;
		*((word32) s0_17 + 4) = 0x00;
		*((word32) a4_27 + 4) = a3_24;
		((union Eq_2 *) 0x44B08180)->u0 = 0x02000000;
		*s0_17 = a5_45;
		0x00 = (uint16) dwArg38;
	}
	else
		assert_err();
}

// 23004B52: Register (ptr32 Eq_18211) scan_search_ds(Register (ptr32 Eq_18211) a5)
// Called from:
//      dma_cb
//      scan_ie_download
struct Eq_18211 * scan_search_ds(struct Eq_18211 * a5)
{
	struct Eq_18211 * a5_16;
	*((word32) mac_ie_find(0x42047D04, (word32) a5->w014C, 0x03, out a5_16) + 20) = a5->dw0010;
	return a5_16;
}

// 23004B7E: Register Eq_2 scan_init(Register Eq_2 ra, Register ptr32 mstatus)
// Called from:
//      mm_init
Eq_2 scan_init(Eq_2 ra, ptr32 mstatus)
{
	word32 t1_61;
	word32 a0_62;
	word32 a1_63;
	word32 a2_64;
	word32 a3_65;
	word32 a4_66;
	word32 a5_67;
	Eq_2 ra_18 = memset(ra, 0x42018EF8, 0x00, 0x1C, out t1_61, out a0_62, out a1_63, out a2_64, out a3_65, out a4_66, out a5_67);
	word32 s1_68;
	word32 a0_69;
	word32 a1_70;
	word32 a4_71;
	word32 a5_72;
	word32 s2_73;
	word32 s3_74;
	word32 s4_75;
	Eq_2 s0_29 = ke_state_set(0x02, 0x00, mstatus, out s1_68, out a0_69, out a1_70, out a4_71, out a5_72, out s2_73, out s3_74, out s4_75);
	g_dw23004C90 = (word32) s0_29 - 264;
	*((word32) s0_29 - 252) = 0x00;
	g_ptr42047CE4 = (word32) s0_29 - 264;
	g_dw42047D08 = 0x42047CE0;
	g_dw42047D1C = 0x42047CE0;
	g_dw42047D00 = 0x00;
	*(word32 *) ~0x35010511 = 0x42047CE0;
	g_dw42047CF4 = 0x00;
	return ra_18;
}

// 23004BDE: Register Eq_2 scan_set_channel_request(Register (ptr32 Eq_18301) a5, Register ptr32 mstatus, Stack word32 dwArg0118, Register out ptr32 a0Out, Register out ptr32 a4Out)
// Called from:
//      dma_cb
//      scan_ie_download
//      mm_scan_channel_end_ind_handler
Eq_2 scan_set_channel_request(struct Eq_18301 * a5, ptr32 mstatus, word32 dwArg0118, ptr32 & a0Out, ptr32 & a4Out)
{
	struct Eq_18306 * s0_20 = a5 + ((word32) g_b42018F12 + 0x06) / 335;
	struct Eq_18313 * a1_36;
	struct Eq_18314 * s0_29 = chan_scan_req((word32) s0_20->b0002, (word32) s0_20->w0000, (int32) s0_20->b0004, 0x1AFFFDB0, (word32) a5->b014E, mstatus, dwArg0118, out a1_36);
	if (a1_36 == null)
	{
l23004C56:
		word32 s2_122;
		word32 a1_120;
		word32 a5_121;
		ptr32 a0_85;
		ptr32 a4_87;
		word32 s1_119;
		word32 s3_123;
		word32 s4_124;
		Eq_2 s0_90 = ke_state_set(0x02, 0x02, mstatus, out s1_119, out a0_85, out a1_120, out a4_87, out a5_121, out s2_122, out s3_123, out s4_124);
		a0Out = a0_85;
		a4Out = a4_87;
		return s0_90;
	}
	ui32 a5_44;
	word32 a5_51;
	word32 a3_41 = (word32) s0_29->b0002;
	word32 a4_42 = (word32) s0_29->w0000;
	if (a3_41 == 0x00)
	{
		a5_44 = 0x00;
		if ((word32) (word16) (a4_42 + 0xFF000694) > 72)
			goto l23004C52;
		a5_44 = 0x0E;
		if (a4_42 == 0x00FFF9B4)
		{
l23004C52:
			a1_36->b0002 = (byte) a5_44;
			goto l23004C56;
		}
		a5_51 = 0xFF000699;
	}
	else
	{
		a5_44 = 0x00;
		if (a3_41 != 0x01 || (word32) ((word16) (a4_42 + ~0x0100038C)) > 0x0334)
			goto l23004C52;
		a5_51 = ~0x01000387;
	}
	a5_44 = a4_42 + a5_51 ^ 0x05;
	goto l23004C52;
}

// 23004C88: void dma_cb(Register (ptr32 Eq_18211) a5, Register ptr32 mstatus, Stack word32 dwArg0118)
void dma_cb(struct Eq_18211 * a5, ptr32 mstatus, word32 dwArg0118)
{
	struct Eq_18301 * a5_10 = scan_search_ds(a5);
	word32 a0_32;
	word32 a4_33;
	scan_set_channel_request(a5_10, mstatus, dwArg0118, out a0_32, out a4_33);
}

word32 g_dw23004C90 = 0x014140B2;
// 23004C98: Register word32 scan_ie_download(Register (ptr32 Eq_18211) a5, Register ptr32 mstatus, Stack word32 dwArgF8)
// Called from:
//      scan_start_req_handler
word32 scan_ie_download(struct Eq_18211 * a5, ptr32 mstatus, word32 dwArgF8)
{
	struct Eq_18427 * a0_14;
	struct Eq_18428 * a4_18;
	word32 s0_21 = scan_set_channel_request(scan_search_ds(a5), mstatus, dwArgF8, out a0_14, out a4_18);
	struct Eq_18436 * a5_31 = a4_18->ptr0018;
	int32 a3_32 = (word32) a0_14->w014C;
	a5_31->dw0020 = 0x00;
	((char *) a4_18 - 1 + a3_32)[28] = (char) a5_31;
	return s0_21;
}

// 23004CC6: void scan_probe_req_tx(Register Eq_2 ra, Register (ptr32 Eq_18456) s1, Register Eq_2 s5, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg88, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack word32 dwArg0128)
// Called from:
//      mm_scan_channel_start_ind_handler
void scan_probe_req_tx(Eq_2 ra, struct Eq_18456 * s1, Eq_2 s5, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg88, Eq_2 dwArgBC, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, word32 dwArg0128)
{
	word32 s5_213 = (word32) s1->ptr0010->b001A;
	Eq_2 a4_202 = 0x05D8;
	struct Eq_18478 * s7_215 = (char *) &s1->ptr0010 + 0x00ED;
	int32 s4_212 = 0x00;
	while (s4_212 < (word32) s1->b0150)
	{
		ptr32 a0_45 = 0x01;
		if ((word32) *((char *) (s1 + (s5_213 + 0x06) / 338) + 2) == 0x00)
			a0_45 = (word32) s1->b0151;
		word32 a5_52 = (word32) s7_215->bFFFFFFFF;
		word32 a4_379;
		word32 a3_378;
		Eq_2 s0_74;
		struct Eq_18503 * s1_75;
		struct Eq_18504 * a0_80;
		Eq_2 s2_84;
		struct Eq_18506 * s3_85;
		word32 a1_377;
		word32 s4_381;
		word32 s5_382;
		word32 a5_380;
		word32 s6_383;
		word32 s7_384;
		word32 s9_386;
		word32 s11_388;
		word32 s8_385;
		word32 s10_387;
		txl_frame_get(ra, a0_45, (word32) s1->w014C + (a5_52 + 0x1A), a4_202, a5_52 + 0x1A, fflags, frm, mstatus, dwArgD8, dwArgF8, dwArg0118, out s0_74, out s1_75, out a0_80, out a1_377, out a3_378, out a4_379, out a5_380, out s2_84, out s3_85, out s4_381, out s5_382, out s6_383, out s7_384, out s8_385, out s9_386, out s10_387, out s11_388);
		if (a0_80 == null)
			break;
		Eq_2 s8_95 = *((word32) *((word32) s0_74 + 0x0068) + 0x006C);
		((word32) s0_74 + 332)->u1 = 0x40;
		((word32) s0_74 + 333)->u1 = 0x00;
		((word32) s0_74 + 334)->u1 = 0x00;
		((word32) s0_74 + 335)->u1 = 0x00;
		word32 a3_391;
		word32 a4_392;
		word32 a2_390;
		word32 a1_389;
		word32 a5_393;
		word32 a6_394;
		word32 a7_395;
		memcpy((word32) s0_74 + 336, 0x2308DD8C, 0x06, out a1_389, out a2_390, out a3_391, out a4_392, out a5_393, out a6_394, out a7_395);
		word32 a1_396;
		word32 a2_397;
		word32 a3_398;
		word32 a4_399;
		word32 a5_400;
		word32 a6_401;
		word32 a7_402;
		memcpy((word32) s0_74 + 342, s2_84, 0x06, out a1_396, out a2_397, out a3_398, out a4_399, out a5_400, out a6_401, out a7_402);
		word32 a1_403;
		word32 a2_404;
		word32 a4_405;
		word32 a5_406;
		word32 a6_407;
		word32 a7_408;
		struct Eq_13120 * a3_140;
		memcpy((word32) s0_74 + 348, (char *) s1_75 + 320, 0x06, out a1_403, out a2_404, out a3_140, out a4_405, out a5_406, out a6_407, out a7_408);
		word32 a5_148 = (word32) s3_85->w0054;
		((word32) s0_74 + 356)->u1 = 0x00;
		uint32 a5_151 = a5_148 + 0x01 << 16;
		s3_85->w0054 = (word16) (a5_151 >> 16);
		uint32 a5_156 = (word32) (word16) (a5_151 >> 16 << 4);
		((word32) s0_74 + 354)->u1 = (byte) a5_156;
		((word32) s0_74 + 355)->u1 = (byte) (a5_156 >> 8);
		int32 a4_160 = (word32) s7_215->bFFFFFFFF;
		((word32) s0_74 + 357)->u1 = (byte) a4_160;
		int32 a5_161;
		for (a5_161 = 0x00; a4_160 != a5_161; ++a5_161)
		{
			a3_140 = (word32) s0_74 + a5_161;
			a3_140->b0166 = (byte) (word32) s7_215[a5_161];
		}
		*((word32) s8_95 + 16) = 0x42047CF0;
		*((word32) s8_95 + 24) -= (word32) s1_75->w014C;
		a0_80->dw02CC = 0x00;
		a0_80->dw02D0 = 0x00;
		a0_80->b002F = (byte) (word32) s1_75->b014E;
		a0_80->b0030 = ~0x00;
		word32 s0_409;
		word32 a0_410;
		word32 a1_411;
		word32 a3_412;
		word32 a5_413;
		word32 s2_414;
		word32 s3_415;
		word32 s6_416;
		word32 s9_417;
		word32 s10_418;
		word32 s11_419;
		ra = txl_frame_push(ra, s0_74, 0x03, a3_140, (struct Eq_13346 *) ~0x00, mstatus, dwArg08, s5, dwArg88, dwArgBC, out s0_409, out s1, out a0_410, out a1_411, out a3_412, out a4_202, out a5_413, out s2_414, out s3_415, out s4_212, out s5_213, out s6_416, out s7_215, out s9_417, out s10_418, out s11_419);
	}
	0x00 = dwArg0128;
}

// 23004E24: Register Eq_2 scan_send_cancel_cfm(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08)
// Called from:
//      scan_cancel_req_handler
//      mm_scan_channel_end_ind_handler
Eq_2 scan_send_cancel_cfm(Eq_2 ra, Eq_2 a1, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08)
{
	Eq_2 a0_17;
	word32 s0_25;
	word32 s1_58;
	word32 a1_59;
	word32 a2_60;
	word32 a3_61;
	word32 a4_62;
	word32 a5_63;
	word32 a6_64;
	word32 s2_65;
	word32 s3_66;
	word32 s4_67;
	word32 s8_68;
	ke_msg_alloc(ra, 0x00FFF804, a1, 0x01, a4, mstatus, dwArg08, out s0_25, out s1_58, out a0_17, out a1_59, out a2_60, out a3_61, out a4_62, out a5_63, out a6_64, out s2_65, out s3_66, out s4_67, out s8_68);
	a0_17->u1 = (byte) s0_25;
	word32 s1_69;
	word32 a0_70;
	word32 a1_71;
	word32 a2_72;
	word32 a3_73;
	word32 a4_74;
	word32 a5_75;
	word32 s2_76;
	word32 s3_77;
	word32 s4_78;
	word32 s8_79;
	return ke_msg_send(a0_17, mstatus, out s1_69, out a0_70, out a1_71, out a2_72, out a3_73, out a4_74, out a5_75, out s2_76, out s3_77, out s4_78, out s8_79);
}

// 23004E48: Register Eq_2 sta_mgmt_entry_init(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a4, Stack word32 dwArg00, Stack word32 dwArg04, Register out ptr32 s1Out, Register out (ptr32 Eq_18832) a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      sta_mgmt_init
//      sta_mgmt_unregister
Eq_2 sta_mgmt_entry_init(Eq_2 ra, Eq_2 a0, Eq_2 a4, word32 dwArg00, word32 dwArg04, ptr32 & s1Out, struct Eq_18832 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	Eq_2 s0_11 = a0;
	ptr32 s1_12 = (word32) a0 + 412;
	while (true)
	{
		Eq_2 a5_15 = *((word32) s0_11 + 412);
		if (a5_15 == 0x00)
			break;
		word32 a1_89;
		word32 a5_88;
		word32 a5_90;
		ra = txl_frame_release(ra, s0_11, co_list_pop_front(a4, a5_15, out a5_88), 0x01, dwArg00, dwArg04, out s0_11, out s1_12, out a1_89, out a5_90);
	}
	word32 t1_91;
	word32 a0_92;
	word32 a1_93;
	word32 a2_94;
	word32 a3_95;
	word32 a4_96;
	word32 a5_97;
	Eq_2 ra_42 = memset(ra, s0_11, 0x00, 432, out t1_91, out a0_92, out a1_93, out a2_94, out a3_95, out a4_96, out a5_97);
	struct Eq_18832 * a5_45 = (word32) s0_11 + 292;
	struct Eq_18832 * a3_46 = (word32) s0_11 + 400;
	do
	{
		a5_45->b0000 = 0x02;
		a5_45->b0001 = 0x02;
		++a5_45;
	} while (a5_45 != a3_46);
	*((word32) s0_11 + 26) = ~0x00;
	s1Out = s1_12;
	a3Out = a3_46;
	a4Out = 0x02;
	a5Out = ~0x00;
	return ra_42;
}

