pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 23004E9E: Register Eq_2 sta_mgmt_init(Register Eq_2 ra, Register Eq_2 a4, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgBC, Register out ptr32 a3Out)
// Called from:
//      mm_init
Eq_2 sta_mgmt_init(Eq_2 ra, Eq_2 a4, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgBC, ptr32 & a3Out)
{
	co_list_init(&g_t42018F18);
	Eq_2 s1_16 = 0x42018F20;
	do
	{
		Eq_2 a5_33;
		Eq_2 s1_35;
		word32 a3_191;
		ra = sta_mgmt_entry_init(ra, s1_16, a4, dwLoc20, dwLoc1C, out s1_35, out a3_191, out a4, out a5_33);
		s1_16 = co_list_push_back(s1_35, a5_33);
	} while (s1_16 != 0x43019000);
	Eq_2 a3_52;
	word32 a5_194;
	word32 a4_193;
	word32 s1_192;
	Eq_2 ra_55 = sta_mgmt_entry_init(ra, 0x4201A000, a4, dwLoc20, dwLoc1C, out s1_192, out a3_52, out a4_193, out a5_194);
	*(word32 *) 0x4301910C = 0x420463C4;
	*(word32 *) 1124176044 = 0x4201A9D0;
	*(byte *) 0x4301901A = 0x00;
	*(byte *) 0x43019031 = 0x00;
	Eq_2 a4_83;
	word32 s2_89;
	Eq_2 a3_104;
	word32 s6_205;
	word32 s5_204;
	word32 s4_203;
	word32 s3_202;
	word32 a7_201;
	word32 a5_200;
	word32 a3_199;
	word32 a2_198;
	word32 a1_197;
	word32 a0_196;
	word32 s1_195;
	word32 s7_206;
	word32 s8_207;
	word32 s9_208;
	word32 s10_209;
	word32 s11_210;
	word32 t4_211;
	word32 s1_212;
	word32 a4_213;
	word32 a5_214;
	Eq_2 ra_107 = sta_mgmt_entry_init(printf(ra_55, &g_t23074A78, a3_52, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_195, out a0_196, out a1_197, out a2_198, out a3_199, out a4_83, out a5_200, out a7_201, out s2_89, out s3_202, out s4_203, out s5_204, out s6_205, out s7_206, out s8_207, out s9_208, out s10_209, out s11_210, out t4_211), 0x4201A1B0, a4_83, dwLoc20, dwLoc1C, out s1_212, out a3_104, out a4_213, out a5_214);
	*(byte *) 0x430191CA = 0x01;
	*(word32 *) 1124176572 = 0x42046400;
	*(byte *) 0x430191E1 = 0x00;
	*(word32 *) 1124176476 = 1107406760;
	ptr32 a3_136;
	word32 s1_215;
	word32 a0_216;
	word32 a1_217;
	word32 a2_218;
	word32 a4_219;
	word32 a5_220;
	word32 a7_221;
	word32 s2_222;
	word32 s3_223;
	word32 s4_224;
	word32 s5_225;
	word32 s6_226;
	word32 s7_227;
	word32 s8_228;
	word32 s9_229;
	word32 s10_230;
	word32 s11_231;
	word32 t4_232;
	Eq_2 ra_139 = printf(ra_107, s2_89 + -0x0588, a3_104, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_215, out a0_216, out a1_217, out a2_218, out a3_136, out a4_219, out a5_220, out a7_221, out s2_222, out s3_223, out s4_224, out s5_225, out s6_226, out s7_227, out s8_228, out s9_229, out s10_230, out s11_231, out t4_232);
	a3Out = a3_136;
	return ra_139;
}

// 23004F7A: Register Eq_2 sta_mgmt_register(Register Eq_2 ra, Register (ptr32 Eq_10270) a0, Register (ptr32 byte) a1, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out (ptr32 byte) s3Out, Register out ptr32 s4Out, Register out ptr32 s7Out)
// Called from:
//      mm_sta_add
Eq_2 sta_mgmt_register(Eq_2 ra, struct Eq_10270 * a0, byte * a1, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, union Eq_2 & s0Out, ptr32 & a0Out, byte & s3Out, ptr32 & s4Out, ptr32 & s7Out)
{
	ptr32 a0_179;
	struct Eq_19065 * s2_16 = (word32) a0->b0011;
	byte * s3_144 = a1;
	word32 a5_312;
	Eq_2 a0_23 = co_list_pop_front(a4, a5, out a5_312);
	if (a0_23 != 0x00)
	{
		word32 a4_316;
		word32 a7_319;
		word32 a5_317;
		word32 a6_318;
		word32 a3_315;
		word32 a1_313;
		word32 a2_314;
		memcpy((word32) a0_23 + 30, &a0->w0008 + 1, 0x06, out a1_313, out a2_314, out a3_315, out a4_316, out a5_317, out a6_318, out a7_319);
		s0 = a0_23;
		up32 a5_43 = (word32) a0->b0010;
		if (a5_43 < 0x10)
			a5_43 = 0x10;
		*((word32) a0_23 + 20) = (byte) a5_43;
		struct Eq_19112 * a5_50 = (word32) a0->w0008;
		*((word32) a0_23 + 0x0C) = (word16) a5_50;
		a5_50->t0008 = a0_23;
		struct Eq_19124 * s1_57 = a5_50->ptr0004;
		a5_50->t0010 = a0_23;
		((word32) a0_23 + 26)->u1 = (byte) (word32) s1_57->b0011;
		struct Eq_19139 * a5_61 = (int32) s1_57->b0013;
		*((word32) a0_23 + 36) = (byte) a5_61;
		a5_61->t0028 = a0_23;
		struct Eq_19151 * s1_65 = a5_61->ptr0018;
		a5_61->t002C = a0_23;
		((word32) a0_23 + 48)->u1 = (byte) (word32) s1_65->b001C;
		ui32 a5_75 = (a0_23 - &g_t42018F20 >> 4) + 1749801491 & 0x00FF;
		*a1 = (byte) a5_75;
		((word32) a0_23 + 27)->u1 = (byte) a5_75;
		*(union Eq_2 *) 0x19000004 = a0_23;
		*((word32) a0_23 + 0x0188) = ~0x00;
		word32 a5_83 = a0_23 + 394;
		do
		{
			a5_83->w0000 = ~0x00;
			a5_83 += 0x02;
		} while (a5_83 != a0_23 + 412);
		struct Eq_274 * a0_115;
		Eq_2 a3_113;
		word32 a5_90 = (word32) *a1;
		((word32) a0_23 + 49)->u1 = 0x00;
		*((word32) a0_23 + 268) = a5_90 + 0x42046478;
		if ((s2_16->dw4201AFAC & 0x08) != 0x00)
		{
			a3_113 = *((word32) a0_23 + 0x00A8);
			Mem119[a0_23 + 0x00AC:word32] = a0_23 + 0x00A8;
			a0_115 = (struct Eq_274 *) &g_t23074AA0;
		}
		else
		{
			*((word32) a0_23 + 0x00AC) = &s2_16->t4201AFA8;
			a3_113 = s2_16->t4201AFA8;
			a0_115 = (struct Eq_274 *) &g_t23074ACC;
		}
		word32 a1_322;
		word32 a0_321;
		word32 s1_320;
		word32 a2_323;
		word32 a4_325;
		word32 a3_324;
		word32 a7_327;
		word32 a5_326;
		word32 s2_328;
		word32 s4_329;
		word32 s5_330;
		word32 s6_331;
		word32 s8_332;
		word32 s9_333;
		word32 s10_334;
		word32 s11_335;
		word32 t4_336;
		ra = printf(ra, a0_115, a3_113, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_320, out a0_321, out a1_322, out a2_323, out a3_324, out a4_325, out a5_326, out a7_327, out s2_328, out s3_144, out s4_329, out s5_330, out s6_331, out s7, out s8_332, out s9_333, out s10_334, out s11_335, out t4_336);
		Eq_2 a3_154 = *(union Eq_2 *) 0x44B00120;
		word32 a5_158 = a0_23 + 0x011C;
		do
		{
			*a3_154 = a5_158;
			*((word32) a3_154 - 999996) = a5_158;
			a5_158 = (word32) a5_158 + 0x0C;
		} while (a5_158 != a0_23 + 0x0188);
		co_list_push_back(a0_23, a5_158);
		((word32) a0_23 + 29)->u1 = 0x01;
		a0_179 = 0x00;
	}
	else
		a0_179 = 0x01;
	s0Out = s0;
	a0Out = a0_179;
	s3Out = s3_144;
	s4Out = dwArg04;
	s7Out = s7;
	return ra;
}

