pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 23005488: Register word32 td_pck_ind(Register word32 a2)
// Called from:
//      rxl_cntrl_evt
//      txl_cntrl_push
word32 td_pck_ind(word32 a2)
{
	if (a2 == 0x00)
	{
		*(union Eq_2 *) 0x35 = *(union Eq_2 *) 52;
		return;
	}
	else
	{
		*(union Eq_2 *) 0x39 = *(union Eq_2 *) 56;
		return;
	}
}

// 230054AC: Register word32 td_pck_ps_ind(Register word32 a1)
// Called from:
//      ps_check_frame
//      ps_check_tx_frame
word32 td_pck_ps_ind(word32 a1)
{
	if (a1 == 0x00)
	{
		*(union Eq_2 *) 0x3D = *(union Eq_2 *) 60;
		return;
	}
	else
	{
		*(union Eq_2 *) 0x41 = *(union Eq_2 *) 64;
		return;
	}
}

// 230054D0: void bl_tpc_update_power_table(Register ptr32 a0)
// Called from:
//      cmd_wifi_power_table_update
void bl_tpc_update_power_table(ptr32 a0)
{
	trpc_update_power(a0);
	struct Eq_20101 * a4_18 = fp + -72;
	int8 * a5_19;
	for (a5_19 = a0 + 24; a5_19 != a0 + 38; ++a5_19)
	{
		++a4_18;
		a4_18[0x03FF] = (struct Eq_20101) (int32) *a5_19;
	}
	rf_pri_update_power_offset(fp + -72);
}

// 23005506: Register (ptr32 byte) bl_tpc_power_table_get(Register Eq_2 a0)
// Called from:
//      wifi_sta_ip_info
byte * bl_tpc_power_table_get(Eq_2 a0)
{
	trpc_power_get(a0);
	int32 a5_23;
	for (a5_23 = 0x18; a5_23 != 38; ++a5_23)
	{
		byte * a3_27 = (word32) a0 + a5_23;
		*a3_27 = 0x00;
	}
	return a3_27;
}

// 2300552E: void bl_tpc_update_power_rate_11b(Register ptr32 a0)
// Called from:
//      hal_board_cfg
void bl_tpc_update_power_rate_11b(ptr32 a0)
{
	trpc_update_power_11b(a0);
}

// 23005532: void bl_tpc_update_power_rate_11g(Register ptr32 a0)
// Called from:
//      hal_board_cfg
void bl_tpc_update_power_rate_11g(ptr32 a0)
{
	trpc_update_power_11g(a0);
}

// 23005536: void bl_tpc_update_power_rate_11n(Register ptr32 a0)
// Called from:
//      hal_board_cfg
void bl_tpc_update_power_rate_11n(ptr32 a0)
{
	trpc_update_power_11n(a0);
}

// 2300553A: Register word32 tpc_update_tx_power(Register Eq_2 ra, Register ptr32 fflags, Register ptr32 frm, Register out ptr32 a4Out, Register out Eq_20165 a5Out)
// Called from:
//      tpc_update_vif_tx_power
//      chan_tx_cfm
//      chan_ctxt_update
//      mm_start_req_handler
word32 tpc_update_tx_power(Eq_2 ra, ptr32 fflags, ptr32 frm, ptr32 & a4Out, union Eq_20165 & a5Out)
{
	word32 a1_54;
	word32 a3_55;
	word32 a4_56;
	word32 a5_57;
	*(int32 *) 0x44B000A0 = trpc_get_default_power_idx(ra, 0x02, 0x00, fflags, frm, out a1_54, out a3_55, out a4_56, out a5_57) | *((int32 *) 0x44B000A0) & -0x0100;
	word32 a3_32;
	word32 a1_58;
	word32 a4_59;
	word32 a5_60;
	Eq_2 a0_29 = trpc_get_default_power_idx(ra, 0x00, 0x00, fflags, frm, out a1_58, out a3_32, out a4_59, out a5_60);
	int32 a5_39 = *(int32 *) 0x44B000A0;
	*(int32 *) 0x44B000A0 = a0_29 << 8 | a5_39 & 0xF00000FF;
	a4Out = 0xF00000FF;
	a5Out = a5_39 & 0xF00000FF;
	return a3_32;
}

// 2300557E: Register Eq_2 tpc_update_vif_tx_power(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 byte) a1, Register (ptr32 Eq_20224) a2, Register Eq_2 a3, Register ptr32 fflags, Register ptr32 frm, Register out (ptr32 byte) s1Out, Register out Eq_2 a3Out, Register out Eq_20230 a4Out, Register out (ptr32 Eq_20224) s2Out, Register out Eq_20232 s3Out)
// Called from:
//      me_beacon_check
//      sm_assoc_rsp_handler
//      mm_set_power_req_handler
//      apm_start_req_handler
Eq_2 tpc_update_vif_tx_power(Eq_2 ra, Eq_2 a0, byte * a1, struct Eq_20224 * a2, Eq_2 a3, ptr32 fflags, ptr32 frm, byte & s1Out, union Eq_2 & a3Out, union Eq_20230 & a4Out, struct Eq_20224 & s2Out, union Eq_20232 & s3Out)
{
	Eq_20230 a4_5 = (int32) *a1;
	if (a4_5 == 0x007F)
	{
		s1Out = s1;
		a3Out = a3;
		a4Out = a4_5;
		s2Out = s2;
		s3Out = s3;
		return s0;
	}
	else
	{
		Eq_20232 s3_21 = (int32) *((word32) a0 + 89);
		word32 a4_185;
		Eq_2 a3_142;
		Eq_2 a0_27 = phy_get_rf_gain_idx(a1, a2, a3, out a3_142, out a4_185);
		Eq_20230 a4_144 = (int32) *a1;
		Eq_20230 a5_35 = (int32) *((word32) a0 + 90);
		*((word32) a0 + 89) = (byte) a4_144;
		Eq_2 s0_157 = a0;
		if (a5_35 < a4_144)
		{
			*a1 = (byte) a5_35;
			a0_27 = phy_get_rf_gain_idx(a1, a2, a3_142, out a3_142, out a4_144);
		}
		if ((int32) *a1 != s3_21)
		{
			struct Eq_20290 * a5_52;
			for (a5_52 = *((word32) a0 + 848); a5_52 != null; a5_52 = a5_52->ptr0000)
			{
				ui32 a4_55 = (word32) a5_52->b011A;
				a5_52->b011A = (byte) (a4_55 | 16);
				a4_144 = a4_55 | 16;
			}
			s0_157 = *((word32) a0_27 + 64);
			if (a0_27 != 0x00)
			{
				chan_update_tx_power(a0_27, a3_142);
				struct Eq_20319 * a5_70;
				if (chan_is_on_channel(s0_157, out a3_142, out a4_144, out a5_70) != 0x00)
				{
					Eq_2 s0_83 = a5_70->t0040;
					Eq_20230 a4_103;
					word32 a5_186;
					Eq_2 a3_102 = tpc_update_tx_power(ra, fflags, frm, out a4_103, out a5_186);
					s1Out = a1;
					a3Out = a3_102;
					a4Out = a4_103;
					s2Out = a2;
					s3Out = s3_21;
					return s0_83;
				}
			}
		}
		s1Out = a1;
		a3Out = a3_142;
		a4Out = a4_144;
		s2Out = a2;
		s3Out = s3_21;
		return s0_157;
	}
}

// 23005618: Register Eq_2 tpc_get_vif_tx_power_vs_rate(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 fflags, Register ptr32 frm, Register out (ptr32 Eq_20345) a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_2) a5Out)
// Called from:
//      tpc_update_frame_tx_power
//      txl_frame_get
//      me_init_rate
//      txu_cntrl_push
Eq_2 tpc_get_vif_tx_power_vs_rate(Eq_2 ra, Eq_2 a0, ptr32 fflags, ptr32 frm, struct Eq_20345 & a1Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out)
{
	uint32 a0_12;
	int32 a1_11 = a0 & 0x00FF & 0x007F;
	if ((a0 >> 11 & 0x07) == 0x00)
	{
		a0_12 = a0 & 0x00FF & 0x007C;
		if (a0_12 != 0x00)
		{
			a1_11 = a1_11 + ~0x03 & 0x00FF;
			a0_12 = 0x01;
		}
	}
	else
		a0_12 = 0x02;
	struct Eq_20345 * a1_22;
	ptr32 a3_24;
	ptr32 a4_25;
	union Eq_2 * a5_26;
	Eq_2 a0_21 = trpc_get_default_power_idx(ra, a0_12, a1_11, fflags, frm, out a1_22, out a3_24, out a4_25, out a5_26);
	a1Out = a1_22;
	a3Out = a3_24;
	a4Out = a4_25;
	a5Out = a5_26;
	return a0_21;
}

// 2300563C: Register word32 tpc_update_frame_tx_power(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 fflags, Register ptr32 frm, Register out ptr32 a4Out)
// Called from:
//      mm_bcn_transmit
//      ps_send_pspoll
//      txl_frame_send_null_frame
//      txl_frame_send_qosnull_frame
//      txl_frame_send_eapol_frame
//      sm_disconnect
//      sm_auth_send
//      sm_assoc_req_send
//      sm_handle_supplicant_result
//      bam_send_air_action_frame
word32 tpc_update_frame_tx_power(Eq_2 ra, Eq_2 a0, ptr32 fflags, ptr32 frm, ptr32 & a4Out)
{
	word32 a3_18;
	ptr32 a4_19;
	word32 a1_33;
	word32 a5_34;
	*((word32) tpc_get_vif_tx_power_vs_rate(ra, a0, fflags, frm, out a1_33, out a3_18, out a4_19, out a5_34) + 36) = *((word32) a0 + 20);
	a4Out = a4_19;
	return a3_18;
}

// 23005656: void txl_int_fake_transfer(Register Eq_2 a1, Register Eq_2 a5)
// Called from:
//      txl_cntrl_push_int
//      txl_cntrl_push
//      txl_frame_push_force
void txl_int_fake_transfer(Eq_2 a1, Eq_2 a5)
{
	Eq_2 a0_5 = *((word32) a5 + 0x0068);
	*(union Eq_2 *) 3405708054 = a5;
	*((word32) a0_5 + 20) = a5;
	struct Eq_20412 * a2_13 = (word32) a1 + 22 << 0x03;
	struct Eq_20417 * a3_15 = a2_13->ptr0004;
	if (a2_13 == null)
		*((word32) a5 + 4) = a3_15;
	else
		*((word32) a5 + 16) = a3_15->ptr0008;
	*((word32) a5 + 8) = ((word32) a1 + 22 << 3) + 1107416100;
	*((word32) a5 + 16) = null;
}

