pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 23005690: Register (ptr32 Eq_20444) blmac_abs_timer_set(Register int32 a0, Register (ptr32 Eq_20444) a1)
// Called from:
//      txl_payload_handle_backup
//      txl_transmit_trigger
struct Eq_20444 * blmac_abs_timer_set(int32 a0, struct Eq_20444 * a1)
{
	if (a0 <= 0x09)
	{
		a1->dw0000 = a0 + 0x112C004A << 2;
		return a1;
	}
	else
		assert_err();
}

// 230056D4: void txl_machdr_format(Register (ptr32 Eq_20458) a0)
// Called from:
//      txl_payload_handle_backup
void txl_machdr_format(struct Eq_20458 * a0)
{
	ui32 a5_5 = (word32) a0->b0016;
	if ((a5_5 & 0x0F) == 0x00)
		g_w4201A3FC = (word16) ((word32) g_w4201A3FC + 0x01);
	uint32 a5_20 = (word32) (word16) ((word32) g_w4201A3FC << 4 | a5_5 & 0x0F);
	a0->b0016 = (byte) a5_20;
	a0->b0017 = (byte) (a5_20 >> 8);
}

// 2300570C: Register Eq_2 txl_cntrl_init(Register Eq_2 ra, Register (ptr32 Eq_8573) a0, Stack word32 dwArg0108, Stack Eq_2 dwArg0178, Register out ptr32 a4Out)
// Called from:
//      mm_init
Eq_2 txl_cntrl_init(Eq_2 ra, struct Eq_8573 * a0, word32 dwArg0108, Eq_2 dwArg0178, ptr32 & a4Out)
{
	txl_hwdesc_init();
	txl_buffer_init(a0, dwArg0108);
	ptr32 a4_71;
	word32 a5_136;
	word32 a3_135;
	word32 a2_134;
	word32 a1_133;
	word32 a0_132;
	word32 t1_131;
	Eq_2 ra_73 = memset(txl_frame_init(txl_cfm_init(ra), 0x00, dwArg0178), 0x4201A3A8, 0x00, 88, out t1_131, out a0_132, out a1_133, out a2_134, out a3_135, out a4_71, out a5_136);
	struct Eq_20535 * s0_77 = g_a4201A3A8;
	int32 * s3_78 = (int32 *) 0x44A00080;
	do
	{
		co_list_init(&s0_77->dw0000 + 1);
		s0_77->dw0000 = 0x00;
		int32 a5_85 = *s3_78;
		s0_77->b000E = 0x00;
		s0_77->w000C = (word16) a5_85;
		++s3_78;
		++s0_77;
	} while (s3_78 != (int32 *) 0x44A00094);
	g_w4201A3FC = 0x00;
	a4Out = a4_71;
	return ra_73;
}

// 23005782: Register Eq_2 txl_cntrl_tx_check(Register Eq_2 a0, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      sta_mgmt_send_postponed_frame
//      txl_cntrl_push_int
//      txu_cntrl_push
Eq_2 txl_cntrl_tx_check(Eq_2 a0, ptr32 & a3Out, ptr32 & a4Out)
{
	if ((word32) g_b4201A3FE != 0x00)
	{
		a3Out = a3;
		a4Out = a4;
		return 0x00;
	}
	else
	{
		ptr32 a3_10;
		ptr32 a4_11;
		Eq_2 a0_8 = chan_is_tx_allowed(a0, out a3_10, out a4_11);
		a3Out = a3_10;
		a4Out = a4_11;
		return a0_8;
	}
}

// 23005794: void txl_cntrl_halt_ac(Register up32 a0)
// Called from:
//      mm_tbtt_evt
//      txl_cntrl_clear_bcn_ac
//      txl_cntrl_clear_all_ac
void txl_cntrl_halt_ac(up32 a0)
{
	if (a0 > 0x04)
		assert_err();
	else
		g_t23074B4C();
}

// 2300585C: Register Eq_2 txl_cntrl_flush_ac(Register ui32 a0, Stack Eq_2 dwArgA8, Register out ptr32 s0Out, Register out ptr32 a1Out, Register out ptr32 a4Out, Register out Eq_8831 a5Out, Register out ptr32 s2Out, Register out ptr32 s5Out, Register out Eq_2 mstatusOut)
// Called from:
//      mm_tbtt_evt
//      txl_cntrl_clear_bcn_ac
//      txl_cntrl_clear_all_ac
Eq_2 txl_cntrl_flush_ac(ui32 a0, Eq_2 dwArgA8, ptr32 & s0Out, ptr32 & a1Out, ptr32 & a4Out, union Eq_8831 & a5Out, ptr32 & s2Out, ptr32 & s5Out, union Eq_2 & mstatusOut)
{
	ui32 s5_36;
	word32 s4_44;
	ptr32 a4_59;
	ptr32 s5_60;
	ptr32 a1_61;
	ptr32 s0_64;
	ptr32 s2_66;
	struct Eq_20600 * s3_67;
	int32 s4_68;
	ui32 s6_69;
	word32 s0_117;
	word32 s1_118;
	word32 a1_119;
	word32 a4_120;
	word32 a5_121;
	word32 s2_122;
	word32 s3_123;
	word32 s6_124;
	word32 s8_125;
	word32 s1_127;
	word32 a5_128;
	word32 s8_129;
	Eq_2 ra_63 = txl_cfm_flush(txl_cfm_flush(ra, (a0 << 0x03) + 0x4201D500, a1, 0x4201D500, a5, mstatus, out s0_117, out s1_118, out a1_119, out a4_120, out a5_121, out s2_122, out s3_123, out s4_44, out s5_36, out s6_124, out s8_125), s4_44 + 0x4201A3AC, s5_36, a4, a5, mstatus, out s0_64, out s1_127, out a1_61, out a4_59, out a5_128, out s2_66, out s3_67, out s4_68, out s5_60, out s6_69, out s8_129);
	s0_64 + s4_68 = 0x00;
	txl_buffer_reset();
	Eq_8831 a5_81 = ~s2_66 & s6_69;
	s3_67->t008C = a5_81;
	s3_67->ptr0088 = s2_66;
	0x00 = (uint16) dwArgA8;
	s0Out = s1;
	a1Out = a1_61;
	a4Out = a4_59;
	a5Out = a5_81;
	s2Out = s2_66;
	s5Out = s5_60;
	mstatusOut.u0 = <invalid>;
	return ra_63;
}

// 230058DE: Register Eq_2 txl_cntrl_clear_bcn_ac(Register ptr32 mstatus, Stack Eq_2 dwArg98, Register out ptr32 s0Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s5Out)
// Called from:
//      vif_mgmt_unregister
Eq_2 txl_cntrl_clear_bcn_ac(ptr32 mstatus, Eq_2 dwArg98, ptr32 & s0Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s5Out)
{
	__csrrc(mstatus, 0x08);
	txl_cntrl_halt_ac(0x04);
	ptr32 a4_17;
	ptr32 s0_21;
	ptr32 s2_23;
	ptr32 s5_26;
	word32 a1_40;
	word32 a5_41;
	word32 mstatus_42;
	Eq_2 ra_20 = txl_cntrl_flush_ac(0x04, dwArg98, out s0_21, out a1_40, out a4_17, out a5_41, out s2_23, out s5_26, out mstatus_42);
	__csrrs(mstatus, 0x08);
	s0Out = s0_21;
	a4Out = a4_17;
	s2Out = s2_23;
	s5Out = s5_26;
	return ra_20;
}

// 23005900: Register Eq_2 txl_cntrl_clear_all_ac(Register ptr32 mstatus, Register out Eq_2 s1Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_2) a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out)
// Called from:
//      txl_frame_get
Eq_2 txl_cntrl_clear_all_ac(ptr32 mstatus, union Eq_2 & s1Out, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out)
{
	__csrrc(mstatus, 0x08);
	txl_cntrl_halt_ac(0x04);
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg168 = <invalid>;
	word32 s0_95;
	word32 a1_96;
	word32 a4_97;
	word32 a5_98;
	word32 s2_99;
	word32 s5_100;
	word32 mstatus_101;
	txl_cntrl_flush_ac(0x04, stackArg168, out s0_95, out a1_96, out a4_97, out a5_98, out s2_99, out s5_100, out mstatus_101);
	txl_cntrl_halt_ac(0x00);
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg168 = <invalid>;
	word32 s0_103;
	word32 a1_104;
	word32 a4_105;
	word32 a5_106;
	word32 s2_107;
	word32 s5_108;
	word32 mstatus_109;
	txl_cntrl_flush_ac(0x00, stackArg168, out s0_103, out a1_104, out a4_105, out a5_106, out s2_107, out s5_108, out mstatus_109);
	txl_cntrl_halt_ac(0x01);
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg168 = <invalid>;
	word32 s0_111;
	word32 a1_112;
	word32 a4_113;
	word32 a5_114;
	word32 s2_115;
	word32 s5_116;
	word32 mstatus_117;
	txl_cntrl_flush_ac(0x01, stackArg168, out s0_111, out a1_112, out a4_113, out a5_114, out s2_115, out s5_116, out mstatus_117);
	txl_cntrl_halt_ac(0x02);
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg168 = <invalid>;
	word32 s0_119;
	word32 a1_120;
	word32 a4_121;
	word32 a5_122;
	word32 s2_123;
	word32 s5_124;
	word32 mstatus_125;
	txl_cntrl_flush_ac(0x02, stackArg168, out s0_119, out a1_120, out a4_121, out a5_122, out s2_123, out s5_124, out mstatus_125);
	txl_cntrl_halt_ac(0x03);
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg168 = <invalid>;
	ptr32 mstatus_72;
	ptr32 a1_74;
	union Eq_2 * a5_76;
	word32 s0_127;
	word32 a4_128;
	word32 s2_129;
	word32 s5_130;
	txl_cntrl_flush_ac(0x03, stackArg168, out s0_127, out a1_74, out a4_128, out a5_76, out s2_129, out s5_130, out mstatus_72);
	__csrrs(mstatus_72, 0x08);
	s1Out.u0 = <invalid>;
	a1Out = a1_74;
	a3Out.u0 = <invalid>;
	a4Out.u0 = <invalid>;
	a5Out = a5_76;
	s2Out.u0 = <invalid>;
	s3Out.u0 = <invalid>;
	s4Out.u0 = <invalid>;
	return <invalid>;
}

// 23005962: Register word32 txl_cntrl_inc_pck_cnt(Register (ptr32 Eq_20844) a4)
// Called from:
//      txu_cntrl_push
word32 txl_cntrl_inc_pck_cnt(struct Eq_20844 * a4)
{
	word32 a5_6 = a4->dw0050;
	a4->dw0051 = a5_6;
	return a5_6;
}

