pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 23005DF2: Register Eq_2 txl_cntrl_push(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgFC, Register out Eq_2 s1Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out)
// Called from:
//      txu_cntrl_push
Eq_2 txl_cntrl_push(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgC8, Eq_2 dwArgFC, union Eq_2 & s1Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out)
{
	Eq_2 a0_14 = *((word32) a5 + 0x006C);
	word32 a4_16 = Mem9[a0 + 94:byte] + Mem9[a0 + 96:byte];
	Eq_21564 a3_17 = (word32) *((word32) a0_14 + 0x0C);
	*((word32) a5 + 0x0C) = 0x00;
	Mem23[a4_16 + a3_17 + 0x20:word32] = a5;
	*(union Eq_2 *) ~0x3501453D = a5;
	*((word32) a5 + 8) = null;
	*((word32) a5 + 16) = null;
	((word32) a5 + 40)->u0 = 0x00;
	((word32) a5 + 60)->u0 = 0x00;
	*((word32) a5 + 20) = 0x00;
	*((word32) a5 + 24) = 0x00;
	((word32) a5 + 32)->u0 = 0x00;
	((word32) a5 + 64)->u0 = 0x00;
	__csrrc(mstatus, 0x08);
	struct Eq_20436 * a0_36 = *((word32) a5 + 8);
	if (a5 == 0x00)
		txl_int_fake_transfer(a1, a5);
	else
	{
		struct Eq_21620 * a2_39;
		Eq_2 a3_40;
		struct Eq_21622 * a5_42;
		struct Eq_21623 * a0_38 = txl_buffer_alloc(a0_36, a1, 0x00, out a2_39, out a3_40, out a5_42);
		a0_38->t0068 = a0_14;
		*((word32) a0_14 + 20) = a0_38;
		a5 = txl_buffer_update_thd(ra, a2_39, a3_40, a5_42, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C);
	}
	Eq_2 a5_73;
	Eq_2 s0_76;
	ptr32 s2_80;
	ptr32 s3_81;
	ptr32 s5_83;
	ptr32 s6_84;
	ptr32 s7_85;
	ptr32 s8_86;
	word32 s1_152;
	word32 a1_153;
	word32 a3_154;
	word32 a4_155;
	word32 s9_156;
	word32 s10_157;
	word32 s11_158;
	Eq_2 ra_75 = txl_payload_handle_backup(ra, a5, mstatus, dwArg98, dwArgC8, dwArgFC, out s0_76, out s1_152, out a1_153, out a3_154, out a4_155, out a5_73, out s2_80, out s3_81, out s5_83, out s6_84, out s7_85, out s8_86, out s9_156, out s10_157, out s11_158);
	co_list_push_back(s0_76, a5_73);
	__csrrs(mstatus, 0x08);
	Eq_2 s1_100 = *((word32) a5_73 + 80);
	*((word32) a5_73 + 81) = s1_100;
	td_pck_ind(0x00);
	ptr32 a4_114 = ps_check_tx_frame((word32) *((word32) s0_76 + 48), (word32) *((word32) s0_76 + 46));
	s1Out = s1_100;
	a4Out = a4_114;
	s2Out = s2_80;
	s3Out = s3_81;
	s5Out = s5_83;
	s6Out = s6_84;
	s7Out = s7_85;
	s8Out = s8_86;
	return ra_75;
}

// 23005EAA: void txl_transmit_trigger(Register ui32 a0, Register (ptr32 Eq_20444) a1, Register ptr32 mstatus, Stack word32 dwArg010C)
void txl_transmit_trigger(ui32 a0, struct Eq_20444 * a1, ptr32 mstatus, word32 dwArg010C)
{
	if ((a0 & 0x07C0) == 0x00)
		return;
	word32 a4_361;
	ui32 s0_38 = 0x19 - __clzsi2(a0 & 0x07C0, out a4_361);
	if ((s0_38 & 0x00FF) <= 0x04)
	{
		(0x01 << (s0_38 & 0x00FF) + 6)->dw007C = 0x44B08000;
		struct Eq_21746 * s6_50 = (s0_38 & 0x00FF) << 0x04;
		struct Eq_21750 * s7_60 = (s0_38 & 0x00FF) << 0x02;
		int32 s1_172 = ~(0x01 << (s0_38 & 0x00FF));
		while (true)
		{
			Eq_2 s2_69 = s6_50->t4201A3AC;
			if (s2_69 == 0x00)
				break;
			if (a1 >= null)
				goto l23005FFE;
			Eq_2 a4_101 = *((word32) s2_69 + 8);
			if (a4_101 != 0x00)
			{
				a4_101 = *((word32) s2_69 + 0x0068);
				if (a4_101 != 0x00)
					((word32) s2_69 + 0x0068)->u0 = 0x00;
			}
			Eq_2 a5_114;
			struct Eq_21782 * a5_103 = *a4_101;
			a1->t0010 = a4_101;
			struct Eq_21789 * a5_106 = a5_103->ptr0008;
			if (a5_106 != null)
			{
				a5_114 = a5_106->t003C;
				if (a5_114 >= 0x00)
				{
					Eq_2 a1_184 = *(union Eq_2 *) 0x44B00120;
					int32 a5_186 = s7_60->dw23074B60;
					0x00 = dwArg010C;
					struct Eq_20444 * a1_199 = (word32) a1_184 + a5_186;
					blmac_abs_timer_set(s0_38 & 0x00FF, a1_199);
					return;
				}
			}
			else
			{
				Eq_2 a5_109 = *(union Eq_2 *) 0x44B0808C;
				s6_50->dw4201A3A8 = 0x00;
				a5_114 = a5_109 & s1_172;
				*(union Eq_2 *) 0x44B0808C = a5_114;
			}
			word32 a5_362;
			co_list_pop_front(a4_101, a5_114, out a5_362);
			Eq_2 a5_130 = *((word32) s2_69 + 8);
			if (a5_130 == 0x00)
			{
				word32 a5_365;
				word32 a4_364;
				txl_frame_cfm(s2_69, a4_101, a5_130, mstatus, out a4_364, out a5_365);
			}
			else
			{
				word32 a4_363;
				txl_cfm_push(a1, s0_38 & 0x00FF, a5_130, mstatus, out a4_363);
			}
			a1 = (word32) *(union Eq_2 *) 0x44B00120 + s7_60->dw23074B60;
			s1_172 = blmac_abs_timer_set(s0_38 & 0x00FF, a1);
		}
		Eq_2 a4_71 = *(union Eq_2 *) 0x44B0808C;
		s6_50->dw4201A3A8 = 0x00;
		*(union Eq_2 *) 0x44B0808C = s1_172 & a4_71;
l23005FFE:
		0x00 = dwArg010C;
	}
	else
		assert_err();
}

// 2300601E: Register Eq_2 txl_reset(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_10222) s5Out)
// Called from:
//      mm_force_idle_req
//      bl_reset_evt
Eq_2 txl_reset(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0128, struct Eq_10222 & s5Out)
{
	word32 s6_29 = (word32) g_w4201A3FC;
	ke_evt_clear(0x1F000000, a4, mstatus);
	do
	{
		uint32 a4_41 = a4 << 16;
		a4 = a4_41 >> 16;
	} while (a4_41 >> 16 != 0x0FFFFFFF);
	g_b4201A3FE = 0x01;
	Eq_2 s4_49 = 0x4201D500;
	word32 s2_51 = 0x00;
	Eq_2 s1_53 = 0x44A00000;
	do
	{
		Eq_2 a5_57 = 0x01 << s2_51;
		*((word32) a5_57 + 32) = s1_53;
		Eq_2 a5_70;
		Eq_2 s3_75;
		word32 s0_220;
		word32 a4_223;
		word32 a1_222;
		word32 s1_221;
		word32 s5_226;
		word32 s4_225;
		word32 s2_224;
		word32 s8_228;
		word32 s6_227;
		txl_cfm_flush(ra, s4_49, 0x40000000, a4_41 >> 16, a5_57, mstatus, out s0_220, out s1_221, out a1_222, out a4_223, out a5_70, out s2_224, out s3_75, out s4_225, out s5_226, out s6_227, out s8_228);
		word32 s0_89;
		word32 s4_93;
		struct Eq_10222 * s5_94;
		word32 s8_95;
		word32 a5_231;
		word32 s3_232;
		word32 s6_233;
		word32 a4_230;
		word32 a1_229;
		txl_cfm_flush(ra, s3_75, 0x40000000, a4_41 >> 16, a5_70, mstatus, out s0_89, out s1_53, out a1_229, out a4_230, out a5_231, out s2_51, out s3_232, out s4_93, out s5_94, out s6_233, out s8_95);
		s4_49 = s4_93 + 0x08;
	} while (s2_51 != s8_95);
	txl_hwdesc_reset();
	txl_buffer_reinit();
	word32 * a5_119;
	word32 a2_237;
	word32 a3_238;
	word32 a4_239;
	word32 t1_234;
	word32 a0_235;
	word32 a1_236;
	Eq_2 ra_120 = memset(txl_cfm_init(ra), s0_89 + 936, 0x00, 88, out t1_234, out a0_235, out a1_236, out a2_237, out a3_238, out a4_239, out a5_119);
	s5_94->w0054 = (word16) s6_29;
	struct Eq_21996 * s0_123 = s0_89 + 936;
	do
	{
		co_list_init(&s0_123->dw0000 + 1);
		s0_123->dw0000 = 0x00;
		word32 s1_133 = *a5_119;
		s0_123->b000E = 0x00;
		s0_123->w000C = (word16) a5_119;
		++s0_123;
	} while (s1_133 != ~0x44A0008F);
	0x00 = (uint16) dwArg0128;
	s5Out = s5_94;
	return ra_120;
}

// 23006110: void txl_cntrl_env_dump(Register Eq_2 a5)
// Called from:
//      bl60x_fw_dump_statistic
void txl_cntrl_env_dump(Eq_2 a5)
{
	word32 s0_15;
	for (s0_15 = 0x4201A3AC; s0_15 != ~0x4201A353; s0_15 += 0x10)
	{
		union Eq_2 * s2_20 = s0_15 + 0x00;
		if (co_list_cnt(a5, out a5) != null)
		{
			a5 = *s2_20;
			Eq_2 a4_27 = a5;
			while (a4_27 != 0x00)
				a4_27 = *a4_27;
			while (a5 != 0x00)
			{
				Eq_2 a5_34 = *((word32) a4_27 + 0x006C);
				a4_27 = *((word32) a4_27 + 16);
				while (a4_27 != 0x00)
					a4_27 = *((word32) a4_27 + 4);
				a5 = *a5_34;
			}
		}
	}
}

