pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 23006506: void txl_frame_push_force(Register Eq_2 ra, Register Eq_2 a1, Register (ptr32 Eq_22629) a3, Register Eq_2 a5, Register ptr32 mstatus, Stack word32 dwArg38, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgFC)
// Called from:
//      scanu_raw_send_req_handler
void txl_frame_push_force(Eq_2 ra, Eq_2 a1, struct Eq_22629 * a3, Eq_2 a5, ptr32 mstatus, word32 dwArg38, Eq_2 dwArg98, Eq_2 dwArgC8, Eq_2 dwArgFC)
{
	if ((a5 & 0x01) == 0x00)
	{
		struct Eq_22640 * s0_27 = a3->ptr0014;
		s0_27->dw0008 = 0x00;
		s0_27->dw000C = 0x00;
		(a5 & 0x01 & ~0x00780000)->ptr003C = s0_27;
		ui32 a5_33 = (word32) a3->b0004;
		s0_27->dw0040 = 0x00;
		ui32 a5_37 = (word32) ((a5_33 & 0x01) < 1);
		((Eq_362967[]) 56)[a5_37].ptr0000 = s0_27;
		0x00 = dwArg38;
		txl_cntrl_push_int_force(ra, a1, (struct Eq_21458 *) ~0x00780000, a5_37 << 9, mstatus, dwArg98, dwArgC8, dwArgFC);
	}
	else
		assert_err();
}

// 2300656E: Register Eq_2 txl_frame_cfm(Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Register out Eq_2 a4Out, Register out ptr32 a5Out)
// Called from:
//      txl_transmit_trigger
//      txl_cfm_flush
Eq_2 txl_frame_cfm(Eq_2 a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, union Eq_2 & a4Out, ptr32 & a5Out)
{
	co_list_push_back(a0, a5);
	ptr32 a5_20;
	a4Out = ke_evt_set(0x00020000, a4, mstatus, out a5_20);
	a5Out = a5_20;
	return a0;
}

// 2300658C: Register Eq_2 txl_frame_release(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Stack word32 dwArg10, Stack word32 dwArg14, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a1Out, Register out Eq_2 a5Out)
// Called from:
//      sta_mgmt_entry_init
//      txl_cntrl_push_int
Eq_2 txl_frame_release(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, word32 dwArg10, word32 dwArg14, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a1Out, union Eq_2 & a5Out)
{
	Eq_2 a5_11 = (word32) *((word32) a0 + 724);
	Eq_2 s1_14 = a1;
	if (a5_11 == 0x00)
	{
		a1 = a0;
		s1_14 = co_list_push_back(a0, a5_11);
	}
	if (s1_14 != 0x00)
	{
		struct Eq_11723 * t1_24 = *((word32) a0 + 0x02CC);
		if (t1_24 != null)
		{
			Eq_2 s0_40;
			Eq_2 s1_41;
			Eq_2 ra_42;
			Eq_2 a5_43;
			Eq_2 a1_45;
			word32 t1_46;
			t1_24();
			s0Out = s0_40;
			s1Out = s1_41;
			a1Out = a1_45;
			a5Out = a5_43;
			return ra_42;
		}
	}
	s0Out = s0;
	s1Out = s1_14;
	a1Out = a1;
	a5Out = a5_11;
	return ra;
}

// 230065D0: Register Eq_2 txl_frame_evt(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      txl_cfm_flush
Eq_2 txl_frame_evt(Eq_2 ra, Eq_2 a1, Eq_2 a4, ptr32 mstatus, ptr32 & s2Out, ptr32 & s3Out)
{
	ptr32 s3_16 = 0x4201A000;
	Eq_2 a5_20 = ke_evt_clear(0x00020000, a4, mstatus);
	Eq_2 s1_21 = 0x4201A3A8;
	ptr32 s2_22 = 0x4201A000;
	while (true)
	{
		Eq_2 a1_59;
		__csrrc(mstatus, 0x08);
		struct Eq_22735 * a5_29;
		Eq_2 a0_28 = co_list_pop_front(a4, a5_20, out a5_29);
		__csrrs(mstatus, 0x08);
		Eq_2 s0_30 = a0_28;
		if (a0_28 == 0x00)
			break;
		s1_21 = a5_29->t0050;
		a5_29->t004F = s1_21;
		struct Eq_11723 * a5_42 = *((word32) a0_28 + 0x02CC);
		if (a5_42 != null)
		{
			word32 tp_88;
			a5_42();
			a5_20 = (word32) *((word32) s0_30 + 726);
			a1 = a1_59;
			if (a5_20 != 0x00)
			{
				((word32) s0_30 + 726)->u1 = 0x00;
				a1 = a1_59;
				continue;
			}
		}
		a5_20 = (word32) *((word32) s0_30 + 724);
		if (a5_20 == 0x00)
		{
			a1 = s0_30;
			s1_21 = co_list_push_back(s0_30, a5_20);
		}
	}
	s2Out = s2_22;
	s3Out = s3_16;
	return s1_21;
}

// 2300664A: Register Eq_2 txl_frame_send_null_frame(Register Eq_2 ra, Register (ptr32 Eq_11722) a0, Register (ptr32 Eq_11723) a1, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack word32 dwArg0198, Register out (ptr32 Eq_11734) s0Out, Register out (ptr32 Eq_11735) s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_11739) a5Out, Register out (ptr32 Eq_11740) s2Out, Register out Eq_11741 s3Out, Register out Eq_11742 s4Out, Register out (ptr32 Eq_11723) s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out)
// Called from:
//      mm_check_beacon
//      mm_sta_tbtt
//      ps_set_mode
//      ps_enable_cfm
//      ps_disable_cfm
//      ps_traffic_status_update
//      chan_goto_idle_cb
//      chan_tx_cfm
Eq_2 txl_frame_send_null_frame(Eq_2 ra, struct Eq_11722 * a0, struct Eq_11723 * a1, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, word32 dwArg0198, struct Eq_11734 & s0Out, struct Eq_11735 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_11739 & a5Out, struct Eq_11740 & s2Out, union Eq_11741 & s3Out, union Eq_11742 & s4Out, struct Eq_11723 & s5Out, ptr32 & s6Out, ptr32 & s7Out)
{
	ptr32 a0_185;
	ptr32 s6_177 = (word32) a0->b420190EA;
	Eq_2 a4_37;
	Eq_2 a5_38;
	phy_get_channel(fp + -56, out a4_37, out a5_38);
	Eq_2 s0_49;
	Eq_2 s4_51;
	word32 a0_55;
	word32 a1_268;
	word32 s5_269;
	word32 s6_270;
	word32 s7_271;
	word32 s8_272;
	word32 s9_273;
	word32 s10_274;
	word32 s11_275;
	struct Eq_11735 * s1_170;
	struct Eq_11739 * a5_166;
	ptr32 a4_165;
	ptr32 a3_164;
	struct Eq_11740 * s2_173;
	Eq_11741 s3_174;
	txl_frame_get(ra, (word32) ((word32) bLoc38 != 0x00), (struct Eq_14556 *) 0x18, a4_37, a5_38, fflags, frm, mstatus, dwArgC8, dwArgE8, dwArg0108, out s0_49, out s1_170, out a0_55, out a1_268, out a3_164, out a4_165, out a5_166, out s2_173, out s3_174, out s4_51, out s5_269, out s6_270, out s7_271, out s8_272, out s9_273, out s10_274, out s11_275);
	struct Eq_11723 * s5_176 = a1;
	if (a0_55 != 0x00)
	{
		word32 a4_276;
		tpc_update_frame_tx_power(ra, s6_177 + 1107405288, fflags, frm, out a4_276);
		Eq_2 s1_86 = *((word32) s0_49 + 0x0068);
		((word32) s0_49 + 332)->u1 = 0x48;
		((word32) s0_49 + 333)->u1 = 0x01;
		((word32) s0_49 + 334)->u1 = 0x00;
		((word32) s0_49 + 335)->u1 = 0x00;
		word32 a1_277;
		word32 a2_278;
		word32 a3_279;
		word32 a4_280;
		word32 a5_281;
		word32 a6_282;
		word32 a7_283;
		memcpy((word32) s0_49 + 336, &s2_173->b001A + 4, 0x06, out a1_277, out a2_278, out a3_279, out a4_280, out a5_281, out a6_282, out a7_283);
		word32 a1_284;
		word32 a2_285;
		word32 a3_286;
		word32 a4_287;
		word32 a5_288;
		word32 a6_289;
		word32 a7_290;
		memcpy((word32) s0_49 + 342, s6_177 + 0x4201AA38, 0x06, out a1_284, out a2_285, out a3_286, out a4_287, out a5_288, out a6_289, out a7_290);
		struct Eq_13120 * a3_133;
		word32 a1_291;
		word32 a2_292;
		word32 a4_293;
		word32 a5_294;
		word32 a6_295;
		word32 a7_296;
		memcpy((word32) s0_49 + 348, &s2_173->b001A + 4, 0x06, out a1_291, out a2_292, out a3_133, out a4_293, out a5_294, out a6_295, out a7_296);
		uint32 a5_147 = (word32) g_w4201A3FC + 0x01 << 16;
		g_w4201A3FC = (word16) (a5_147 >> 16);
		uint32 a5_152 = (word32) (word16) (a5_147 >> 16 << 4);
		((word32) s0_49 + 354)->u1 = (byte) a5_152;
		((word32) s0_49 + 355)->u1 = (byte) (a5_152 >> 8);
		*((word32) s1_86 + 0x02CC) = a1;
		*((word32) s1_86 + 720) = s4_51;
		struct Eq_13346 * a5_158 = (word32) s2_173->b001A;
		*((word32) s1_86 + 48) = (byte) s3_174;
		((word32) s1_86 + 47)->u1 = (byte) a5_158;
		word32 s0_297;
		word32 a0_298;
		word32 a1_299;
		word32 s4_300;
		word32 s9_301;
		word32 s10_302;
		word32 s11_303;
		ra = txl_frame_push(ra, s0_49, 0x03, a3_133, a5_158, mstatus, dwLoc08, dwArg48, dwArg78, dwArgAC, out s0_297, out s1_170, out a0_298, out a1_299, out a3_164, out a4_165, out a5_166, out s2_173, out s3_174, out s4_300, out s5_176, out s6_177, out s7, out s9_301, out s10_302, out s11_303);
		a0_185 = 0x00;
	}
	else
		a0_185 = 0x01;
	0x00 = dwArg0198;
	s0Out = dwArg0158;
	s1Out = s1_170;
	a0Out = a0_185;
	a3Out = a3_164;
	a4Out = a4_165;
	a5Out = a5_166;
	s2Out = s2_173;
	s3Out = s3_174;
	s4Out = dwArgF4;
	s5Out = s5_176;
	s6Out = s6_177;
	s7Out = s7;
	return ra;
}

