pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300674E: Register Eq_2 txl_frame_send_qosnull_frame(Register Eq_2 s9, Register Eq_2 s10, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgAC, Stack Eq_2 dwArg0198, Register out (ptr32 Eq_14272) s0Out, Register out (ptr32 Eq_14273) s1Out, Register out ptr32 a0Out, Register out Eq_14275 a1Out, Register out Eq_14276 a2Out, Register out ptr32 a3Out, Register out ptr32 a5Out, Register out (ptr32 int32) s2Out, Register out (ptr32 Eq_14280) s3Out, Register out (ptr32 Eq_14281) s4Out, Register out Eq_14282 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out (ptr32 Eq_14285) s9Out, Register out (ptr32 Eq_14286) s10Out, Register out Eq_14287 s11Out)
// Called from:
//      ps_uapsd_timer_handle
//      ps_check_beacon
//      rxl_cntrl_evt
//      txu_cntrl_cfm
Eq_2 txl_frame_send_qosnull_frame(Eq_2 s9, Eq_2 s10, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgAC, Eq_2 dwArg0198, struct Eq_14272 & s0Out, struct Eq_14273 & s1Out, ptr32 & a0Out, union Eq_14275 & a1Out, union Eq_14276 & a2Out, ptr32 & a3Out, ptr32 & a5Out, int32 & s2Out, struct Eq_14280 & s3Out, struct Eq_14281 & s4Out, union Eq_14282 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, struct Eq_14285 & s9Out, struct Eq_14286 & s10Out, union Eq_11095 & s11Out)
{
	ptr32 a0_211;
	word32 a4_334;
	word32 a5_335;
	phy_get_channel(fp + -56, out a4_334, out a5_335);
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg264 = <invalid>;
	Eq_2 stackArg296 = <invalid>;
	Eq_2 stackArg328 = <invalid>;
	word32 a0_52;
	ptr32 s4_53;
	struct Eq_11723 * s8_58;
	Eq_2 s0_60;
	word32 a4_341;
	Eq_14275 a1_188;
	ptr32 a3_190;
	ptr32 a5_192;
	struct Eq_14273 * s1_196;
	struct Eq_14286 * s10_197;
	Eq_14287 s11_198;
	int32 * s2_199;
	struct Eq_14280 * s3_200;
	Eq_14282 s5_202;
	ptr32 s6_203;
	Eq_2 s7_204;
	struct Eq_14285 * s9_206;
	Eq_2 ra_194 = txl_frame_get(ra, (word32) ((word32) (byte) s10 != 0x00), (struct Eq_14556 *) 0x1A, a4, a5, fflags, frm, mstatus, stackArg264, stackArg296, stackArg328, out s0_60, out s1_196, out a0_52, out a1_188, out a3_190, out a4_341, out a5_192, out s2_199, out s3_200, out s4_53, out s5_202, out s6_203, out s7_204, out s8_58, out s9_206, out s10_197, out s11_198);
	if (a0_52 != 0x00)
	{
		Eq_2 a1_140;
		word32 a4_342;
		tpc_update_frame_tx_power(ra_194, (char *) &s3_200->ptr0120 + 1107405000, fflags, frm, out a4_342);
		Eq_2 s1_96 = *((word32) s0_60 + 0x0068);
		((word32) s0_60 + 332)->u1 = 200;
		((word32) s0_60 + 333)->u1 = 0x00;
		((word32) s0_60 + 334)->u1 = 0x00;
		((word32) s0_60 + 335)->u1 = 0x00;
		word32 a3_345;
		word32 a2_344;
		word32 a1_343;
		word32 a4_346;
		word32 a5_347;
		word32 a6_348;
		word32 a7_349;
		memcpy((word32) s0_60 + 336, (char *) s2_199 + 30, 0x06, out a1_343, out a2_344, out a3_345, out a4_346, out a5_347, out a6_348, out a7_349);
		word32 a1_350;
		word32 a2_351;
		word32 a3_352;
		word32 a4_353;
		word32 a5_354;
		word32 a6_355;
		word32 a7_356;
		memcpy((word32) s0_60 + 342, (char *) &s3_200->ptr0120 + 1107405080, 0x06, out a1_350, out a2_351, out a3_352, out a4_353, out a5_354, out a6_355, out a7_356);
		word32 a5_134 = (word32) s3_200->b4201AA3E;
		((word32) s0_60 + 332)->u1 = 200;
		if (a5_134 == 0x00)
		{
			((word32) s0_60 + 333)->u1 = 0x01;
			a1_140 = (char *) s2_199 + 30;
		}
		else
		{
			((word32) s0_60 + 333)->u1 = 0x02;
			a1_140 = (char *) &s3_200->ptr0120 + 1107405080;
		}
		struct Eq_13120 * a3_153;
		word32 a1_357;
		word32 a2_358;
		word32 a4_359;
		word32 a5_360;
		word32 a6_361;
		word32 a7_362;
		memcpy((word32) s0_60 + 348, a1_140, 0x06, out a1_357, out a2_358, out a3_153, out a4_359, out a5_360, out a6_361, out a7_362);
		((word32) s0_60 + 356)->u1 = (byte) s5_202;
		((word32) s0_60 + 354)->u1 = 0x00;
		((word32) s0_60 + 355)->u1 = 0x00;
		((word32) s0_60 + 357)->u1 = (byte) (s5_202 >> 0x08);
		*((word32) s1_96 + 0x02CC) = s8_58;
		*((word32) s1_96 + 720) = s7_204;
		struct Eq_13346 * a5_180 = (word32) (s4_53 + -224 + (s6_203 + 432))->b001A;
		*((word32) s1_96 + 48) = (byte) s6_203;
		((word32) s1_96 + 47)->u1 = (byte) a5_180;
		word32 s0_363;
		word32 a0_364;
		word32 a4_365;
		word32 s4_366;
		ra_194 = txl_frame_push(ra_194, s0_60, 0x03, a3_153, a5_180, mstatus, dwLoc08, s9, dwArg78, dwArgAC, out s0_363, out s1_196, out a0_364, out a1_188, out a3_190, out a4_365, out a5_192, out s2_199, out s3_200, out s4_366, out s5_202, out s6_203, out s7_204, out s9_206, out s10_197, out s11_198);
		a0_211 = 0x00;
	}
	else
		a0_211 = 0x01;
	0x00 = (uint16) dwArg0198;
	s0Out = dwArg0158;
	s1Out = s1_196;
	a0Out = a0_211;
	a1Out = a1_188;
	a2Out = dwArg0138;
	a3Out = a3_190;
	a5Out = a5_192;
	s2Out = s2_199;
	s3Out = s3_200;
	s4Out = dwLoc14;
	s5Out = s5_202;
	s6Out = s6_203;
	s7Out = s7_204;
	s9Out = s9_206;
	s10Out = s10_197;
	s11Out = s11_198;
	return ra_194;
}

// 23006876: Register Eq_2 txl_frame_send_eapol_frame(Register Eq_2 ra, Register (ptr32 Eq_23253) a0, Register (ptr32 Eq_11723) a1, Register Eq_2 a4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg48, Stack Eq_2 dwArg74, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Register out ptr32 a0Out, Register out ptr32 s10Out)
// Called from:
//      UpdateEAPOLWcbLenAndTransmit
Eq_2 txl_frame_send_eapol_frame(Eq_2 ra, struct Eq_23253 * a0, struct Eq_11723 * a1, Eq_2 a4, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg48, Eq_2 dwArg74, Eq_2 dwArg7C, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, ptr32 & a0Out, ptr32 & s10Out)
{
	struct Eq_23268 * s11_47 = (word32) a0->b420190EA;
	Eq_2 a4_49;
	Eq_2 a5_50;
	phy_get_channel((word32) fp - 88, out a4_49, out a5_50);
	struct Eq_23282 * s1_62;
	struct Eq_23283 * s4_63;
	struct Eq_23284 * a0_67;
	word32 s3_72;
	word32 s9_1054;
	word32 s10_1055;
	word32 s11_1056;
	word32 a1_1045;
	word32 a3_1046;
	word32 s6_1051;
	word32 s7_1052;
	word32 s8_1053;
	word32 a5_1048;
	word32 s5_1050;
	word32 s2_1049;
	word32 s0_1044;
	word32 a4_1047;
	txl_frame_get(ra, (word32) ((word32) bLoc58 != 0x00), (struct Eq_14556 *) 0x0100, a4_49, a5_50, fflags, frm, mstatus, dwArg98, dwArgB8, dwArgD8, out s0_1044, out s1_62, out a0_67, out a1_1045, out a3_1046, out a4_1047, out a5_1048, out s2_1049, out s3_72, out s4_63, out s5_1050, out s6_1051, out s7_1052, out s8_1053, out s9_1054, out s10_1055, out s11_1056);
	struct Eq_11723 * s7_37 = a1;
	if (a0_67 == null)
	{
l23006C2A:
		a0Out = 0x00;
		s10Out = s10;
		return dwLoc24;
	}
	Eq_23330 s5_146;
	struct Eq_23331 * s2_135;
	a0_67->b002F = (byte) s11_47;
	a0_67->b0030 = (byte) a0;
	a0_67->b002E = 0x00;
	word32 a4_81 = (word32) s4_63->w00F8;
	s4_63->w00F8 = (word16) (word32) (word12) (a4_81 + 1);
	a0_67->w0020 = ~0x0177;
	a0_67->w002A = (word16) a4_81;
	struct Eq_23365 * s9_93 = (char *) s1_62 + 30 + (s3_72 + -224);
	a0_67->w0014 = (word16) (word32) s9_93->w0000;
	a0_67->w0016 = (word16) (word32) s9_93->w0002;
	a0_67->w0018 = (word16) (word32) s9_93->w0004;
	a0_67->w001A = (word16) (word32) s11_47->w4201AA38;
	a0_67->w001C = (word16) (word32) s11_47->w4201AA3A;
	a0_67->w001E = (word16) (word32) s11_47->w4201AA3C;
	word32 a4_1057;
	tpc_update_frame_tx_power(ra, (char *) s11_47 + 1107405288, fflags, frm, out a4_1057);
	Eq_2 s0_127 = s1_62->t0068;
	if ((s11_47->dw4201ADC8 & 0x01) != 0x00)
	{
		s1_62->b014C = 0x88;
		s1_62->b014D = 0x00;
		uint32 a4_155 = (word32) *((word32) s0_127 + 42) << 20 >> 16;
		s1_62->b0162 = (byte) a4_155;
		s1_62->b0163 = (byte) (a4_155 >> 8);
		word32 a4_159 = (word32) *((word32) s0_127 + 46);
		s1_62->b0165 = 0x00;
		s1_62->b0164 = (byte) a4_159;
		s2_135 = (struct Eq_23331 *) (&s1_62->b0165 + 1);
		s5_146 = (word32) a4 + 0x0022;
	}
	else
	{
		s1_62->b014C = 0x08;
		word32 a4_133 = (word32) g_w4201A3FC;
		s1_62->b014D = 0x00;
		uint32 a4_137 = a4_133 + 0x01 << 16;
		g_w4201A3FC = (word16) (a4_137 >> 16);
		uint32 a4_142 = (word32) (word16) (a4_137 >> 16 << 4);
		s1_62->b0162 = (byte) a4_142;
		s1_62->b0163 = (byte) (a4_142 >> 8);
		s2_135 = (struct Eq_23331 *) &s1_62->b0164;
		s5_146 = (word32) a4 + 32;
	}
	if (s5_146 > 0x0100)
		assert_err();
	ui32 a4_175 = (word32) s1_62->b014D << 8 | (word32) s1_62->b014C;
	Eq_2 a1_173 = 0x02;
	uint32 a2_182 = a4_175 | 0x0100;
	if ((word32) s11_47->b4201AA3E == 0x02)
		a2_182 = a4_175 | 0x0200;
	word32 a5_218;
	s1_62->b014C = (byte) a2_182;
	s1_62->b014D = (byte) (a2_182 >> 8);
	s1_62->b014E = 0x00;
	s1_62->b014F = 0x00;
	s1_62->w0150 = (word16) (word32) s9_93->w0000;
	s1_62->w0152 = (word16) (word32) s9_93->w0002;
	s1_62->w0154 = (word16) (word32) s9_93->w0004;
	s1_62->w0156 = (word16) (word32) s11_47->w4201AA38;
	s1_62->w0158 = (word16) (word32) s11_47->w4201AA3A;
	s1_62->w015A = (word16) (word32) s11_47->w4201AA3C;
	if ((word32) s11_47->b4201AA3E == 0x02)
	{
		s1_62->w015C = (word16) (word32) s11_47->w4201AA38;
		s1_62->w015E = (word16) (word32) s11_47->w4201AA3A;
		a5_218 = (word32) s11_47->w4201AA3C;
	}
	else
	{
		s1_62->w015C = (word16) (word32) s9_93->w0000;
		s1_62->w015E = (word16) (word32) s9_93->w0002;
		a5_218 = (word32) s9_93->w0004;
	}
	s1_62->w0160 = (word16) a5_218;
	up32 s11_232 = 0x00;
	if ((word32) (&g_b4201AA3E)[(word32) *((word32) s0_127 + 47)] != 0x00)
	{
l23006B64:
		s2_135->w0000 = ~0x0555;
		s2_135->w0002 = 0x03;
		s2_135->w0004 = 0x00;
		s2_135->w0006 = (word16) (word32) *((word32) s0_127 + 32);
		struct Eq_23682 * a1_492;
		word32 a2_1058;
		word32 a6_1059;
		word32 a7_1060;
		struct Eq_23686 * a4_489;
		struct Eq_23687 * a5_490;
		struct Eq_13120 * a3_494;
		memcpy(&s2_135->w0006 + 1, a1_173, a4, out a1_492, out a2_1058, out a3_494, out a4_489, out a5_490, out a6_1059, out a7_1060);
		if (s11_232 != 0x00)
		{
			a5_490 = (struct Eq_23687 *) 0x01;
			a4_489 = (word32) a1_492->b0060;
			if (a4_489 == (struct Eq_23686 *) 0x01)
			{
				int32 s8_537;
				word32 s3_1081;
				word32 s4_1082;
				word32 s2_1080;
				word32 s1_1079;
				me_mic_init((word32) fp - 80, (word32) s0_127 + 20, (word32) s0_127 + 26, (word32) *((word32) s0_127 + 46), out s1_1079, out s2_1080, out s3_1081, out s4_1082, out s8_537);
				Eq_2 s1_551;
				word32 s6_557;
				word32 s8_559;
				word32 a2_1084;
				word32 s2_1085;
				word32 s3_1086;
				word32 s9_1088;
				word32 s10_1089;
				word32 s4_1087;
				word32 a1_1083;
				me_mic_calc((word32) fp - 80, s8_537, (word32) a4 + 8, dwLoc54, dwArgB8, out s1_551, out a1_1083, out a2_1084, out s2_1085, out s3_1086, out s4_1087, out s5_146, out s6_557, out s7_37, out s8_559, out s9_1088, out s10_1089);
				word32 a5_1093;
				word32 a2_1090;
				word32 a4_1092;
				word32 a3_1091;
				me_mic_end(s1_551, (word32) fp - 80, out a2_1090, out a3_1091, out a4_1092, out a5_1093);
				word32 s1_571 = s6_557 + s8_559;
				a5_490 = null;
				a4_489 = (struct Eq_23686 *) 0x08;
				do
				{
					a3_494 = (struct Eq_13120 *) (a5_490 + s1_571);
					a3_494->b0000 = (byte) (word32) a5_490[(word32) fp - 80];
					++a5_490;
				} while (a5_490 != (struct Eq_23687 *) 0x08);
			}
		}
		Eq_2 s0_587 = a4_489->t006C;
		struct Eq_24014 * a4_589 = a5_490[20];
		word32 a5_598 = a5_490 + ~0x00 + s5_146;
		*((word32) a5_598 + 24) = a4_589;
		a4_589->t001C = (word32) s5_146 + 4;
		if (s7_37 != null)
		{
			*((word32) dwArg74 + 0x02CC) = s7_37;
			*((word32) dwArg74 + 720) = a5_598;
			s0_587 = dwArg74;
		}
		struct Eq_24155 * a4_621 = (word32) *((word32) s0_587 + 46);
		word32 a4_1099;
		word32 a5_1100;
		word32 s2_1101;
		word32 s4_1103;
		word32 s11_1108;
		word32 s5_1104;
		word32 s6_1105;
		word32 s9_1107;
		word32 s7_1106;
		word32 s3_1102;
		word32 a0_1096;
		word32 a1_1097;
		word32 a3_1098;
		word32 s1_1095;
		word32 s0_1094;
		txl_frame_push(ra, s0_587, (word32) a4_621->b23075D40, a3_494, &a4_621->b23075D40, mstatus, dwLoc38, dwArg18, dwArg48, dwArg7C, out s0_1094, out s1_1095, out a0_1096, out a1_1097, out a3_1098, out a4_1099, out a5_1100, out s2_1101, out s3_1102, out s4_1103, out s5_1104, out s6_1105, out s7_1106, out s9_1107, out s10, out s11_1108);
		goto l23006C2A;
	}
	struct Eq_23703 * a4_245 = (word32) ((word32) *((word32) s0_127 + 48) + 432 + (s3_72 + -224))->b0031;
	if (a4_245 != (struct Eq_23703 *) 0x02)
		goto l23006B64;
	word32 a5_275;
	word32 s11_300;
	struct Eq_23703 * a5_251 = (word32) *(byte *) 0x62;
	if (a5_251 != (struct Eq_23703 *) 0x01)
	{
		if (a5_251 == null)
		{
l23006A9E:
			Eq_2 a1_308 = *(union Eq_2 *) 77;
			((Eq_2[]) 77)[(word32) ((char *) a5_251 + 1 < a5_251) / 4] = a1_308;
			a5_251->t0049 = a1_308;
			word32 a4_1069;
			word32 a5_1070;
			word32 a6_1071;
			word32 a7_1072;
			word32 a2_1067;
			word32 a3_1068;
			memcpy((word32) s0_127 + 0x0022, (word32) a1_308 + 72, 0x04, out a1_173, out a2_1067, out a3_1068, out a4_1069, out a5_1070, out a6_1071, out a7_1072);
			a5_275 = 0x04;
			s11_300 = 0x04;
			goto l23006AC2;
		}
		if (a5_251 != a4_245)
		{
			if (a5_251 == (struct Eq_23703 *) 0x03)
				goto l23006A9E;
			a5_275 = 0x00;
			s11_300 = 0x00;
l23006AC2:
			s11_232 = s11_300 + a5_275;
			if (s11_232 != 0x00)
			{
				ui32 a5_351 = (word32) s1_62->b014D << 8 | (word32) s1_62->b014C;
				s1_62->b014C = (byte) (a5_351 | 0x04000000);
				s1_62->b014D = (byte) ((a5_351 | 0x04000000) >> 8);
				s5_146 = (word32) s5_146 + s11_232;
				int32 a4_366 = (word32) (&g_b4201AA3E)[(word32) *((word32) s0_127 + 47)];
				if (a4_366 != 0x00)
				{
					a4_366 = 0x00;
					goto l23006B60;
				}
				struct Eq_23874 * a2_376 = (word32) ((word32) *((word32) s0_127 + 48) + 432 + (s3_72 + -224))->b0031;
				if (a2_376 != (struct Eq_23874 *) 0x02)
				{
l23006B60:
					s2_135 += a4_366 / 8;
					goto l23006B64;
				}
				ui32 a5_404;
				s0_127 = *((word32) *(union Eq_2 *) 0x02 + 0x006C);
				struct Eq_23874 * a5_384 = (word32) *(byte *) 0x62;
				if (a5_384 != (struct Eq_23874 *) 0x01)
				{
					if (a5_384 == null)
					{
l23006B32:
						s2_135->w0000 = (word16) (word32) *((word32) s0_127 + 0x0022);
						a5_384 = (word32) *(byte *) 99 << 0x0E | (word32) (*((word32) s0_127 + 36));
						s2_135->w0002 = (word16) a5_384;
						a4_366 = 0x04;
						goto l23006B4C;
					}
					if (a5_384 != a2_376)
					{
						if (a5_384 == (struct Eq_23874 *) 0x03)
							goto l23006B32;
						goto l23006B4C;
					}
					s2_135->w0000 = (word16) (word32) *((word32) s0_127 + 0x0022);
					a5_404 = (word32) *(byte *) 99 << 0x0E | 0x02000000;
				}
				else
				{
					uint32 a2_385 = (word32) *((word32) s0_127 + 0x0022);
					s2_135->w0000 = (word16) ((a2_385 | 0x02000000) & 0x07FFFF00 | a2_385 >> 8);
					a5_404 = (word32) *((word32) s0_127 + 0x0022) | (word32) (*((byte *) 99)) << 0x0E | 0x02000000;
				}
				s2_135->w0002 = (word16) a5_404;
				s2_135->w0004 = (word16) (word32) *((word32) s0_127 + 36);
				a5_384 = (word32) *((word32) s0_127 + 38);
				s2_135->w0006 = (word16) a5_384;
				a4_366 = 0x08;
l23006B4C:
				a1_173 = a5_384->t000C;
				(a5_384 & 0x000FFC00 | (word32) (*((byte *) 100)))->t000C = a1_173;
				goto l23006B60;
			}
			goto l23006B64;
		}
		Eq_2 a1_277 = *(union Eq_2 *) 77;
		((Eq_2[]) 77)[(word32) ((char *) a5_251 + 1 < a5_251) / 4] = a1_277;
		a5_251->t0049 = a1_277;
		word32 a2_1073;
		word32 a7_1078;
		word32 a3_1074;
		word32 a4_1075;
		word32 a6_1077;
		word32 a5_1076;
		memcpy((word32) s0_127 + 0x0022, (word32) a1_277 + 72, 0x06, out a1_173, out a2_1073, out a3_1074, out a4_1075, out a5_1076, out a6_1077, out a7_1078);
		a5_275 = 0x08;
	}
	else
	{
		Eq_2 a1_253 = *(union Eq_2 *) 77;
		((Eq_2[]) 77)[(word32) ((char *) a5_251 + 1 < a5_251) / 4] = a1_253;
		a5_251->t0049 = a1_253;
		word32 a7_1066;
		word32 a4_1063;
		word32 a6_1065;
		word32 a5_1064;
		word32 a3_1062;
		word32 a2_1061;
		memcpy((word32) s0_127 + 0x0022, (word32) a1_253 + 72, 0x06, out a1_173, out a2_1061, out a3_1062, out a4_1063, out a5_1064, out a6_1065, out a7_1066);
		a5_275 = 0x0C;
	}
	s11_300 = 0x08;
	goto l23006AC2;
}

// 23006D44: Register Eq_2 txl_frame_dump(Register Eq_2 a5)
// Called from:
//      bl60x_fw_dump_statistic
Eq_2 txl_frame_dump(Eq_2 a5)
{
	Eq_2 a5_12;
	if (co_list_cnt(a5, out a5_12) != null)
	{
		struct Eq_24227 * a4_13;
		for (a4_13 = g_ptr4201A400; a4_13 != null; a4_13 = a4_13->ptr0000)
			;
		a5_12 = g_t4201A408;
		while (a5_12 != 0x00)
			a5_12 = *a5_12;
	}
	return a5_12;
}

// 23006D78: void txl_hwdesc_init()
// Called from:
//      txl_cntrl_init
void txl_hwdesc_init()
{
}

// 23006D7A: void txl_hwdesc_reset()
// Called from:
//      txl_reset
void txl_hwdesc_reset()
{
}

// 23006D7C: Register Eq_2 vif_mgmt_bcn_to_evt(Register Eq_2 ra, Register Eq_2 a3, Register (ptr32 Eq_24244) a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg88, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0158, Register out ptr32 s0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_24244) a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      vif_mgmt_bcn_recv
Eq_2 vif_mgmt_bcn_to_evt(Eq_2 ra, Eq_2 a3, struct Eq_24244 * a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg88, Eq_2 dwArgF8, Eq_2 dwArg0158, ptr32 & s0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, struct Eq_24244 & a5Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out)
{
	struct Eq_24265 * a0_5 = a5->ptr0040;
	if (a5 == null)
	{
		s0Out = s0;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s9Out = s9;
		s10Out = s10;
		return ra;
	}
	else
	{
		ptr32 a2_10;
		ptr32 a4_11;
		struct Eq_24244 * a5_12;
		ptr32 s0_14;
		ptr32 s4_16;
		ptr32 a1_20;
		Eq_2 a3_24;
		ptr32 s10_26;
		ptr32 s5_28;
		ptr32 s6_29;
		ptr32 s7_30;
		ptr32 s9_31;
		Eq_2 ra_25 = chan_bcn_to_evt(ra, a0_5, a3, s2, mstatus, dwArg08, dwArg18, dwArg88, dwArgF8, dwArg0158, out s0_14, out a1_20, out a2_10, out a3_24, out a4_11, out a5_12, out s4_16, out s5_28, out s6_29, out s7_30, out s9_31, out s10_26);
		s0Out = s0_14;
		a1Out = a1_20;
		a2Out = a2_10;
		a3Out = a3_24;
		a4Out = a4_11;
		a5Out = a5_12;
		s3Out = s3_22;
		s4Out = s4_16;
		s5Out = s5_28;
		s6Out = s6_29;
		s7Out = s7_30;
		s9Out = s9_31;
		s10Out = s10_26;
		return ra_25;
	}
}

// 23006D86: Register Eq_2 vif_mgmt_init(Register Eq_2 ra, Register out ptr32 a4Out, Register out ptr32 s2Out)
// Called from:
//      mm_init
Eq_2 vif_mgmt_init(Eq_2 ra, ptr32 & a4Out, ptr32 & s2Out)
{
	word32 t1_108;
	word32 a0_109;
	word32 a1_110;
	word32 a2_111;
	word32 a3_112;
	word32 a4_113;
	word32 a5_114;
	Eq_2 ra_28 = memset(ra, 0x4201AFC0, 0x00, 0x14, out t1_108, out a0_109, out a1_110, out a2_111, out a3_112, out a4_113, out a5_114);
	co_list_init(&g_dw4201AFC0);
	co_list_init(&g_t4201AFC8);
	Eq_2 a5_43;
	word32 t1_115;
	word32 a0_116;
	word32 a1_117;
	word32 a2_118;
	word32 a3_119;
	word32 a4_120;
	Eq_2 ra_44 = memset(ra_28, 0x4201A410, 0x00, 0x05D8, out t1_115, out a0_116, out a1_117, out a2_118, out a3_119, out a4_120, out a5_43);
	g_b4201A466 = 0x04;
	g_b4201A469 = 0x7F;
	g_b4201A46A = 0x7F;
	g_dw4201A43C = 587230588;
	g_dw4201A440 = 0x4201A410;
	co_list_push_back(0x4201A410, a5_43);
	ptr32 a4_70;
	word32 t1_121;
	word32 a0_122;
	word32 a1_123;
	word32 a2_124;
	word32 a3_125;
	word32 a5_126;
	Eq_2 ra_72 = memset(ra_44, 1107405288, 0x00, 0x05D8, out t1_121, out a0_122, out a1_123, out a2_124, out a3_125, out a4_70, out a5_126);
	g_b4201AA3E = 0x04;
	g_b4201AA41 = 0x7F;
	g_b4201AA42 = 0x7F;
	g_dw4201AA14 = 587230588;
	g_dw4201AA18 = 1107405288;
	co_list_push_back(1107405288, 1107405288);
	a4Out = a4_70;
	s2Out = 587230588;
	return ra_72;
}

struct Eq_24791 * g_ptr23006DA8 = &g_t70EFFC04;
// 23006E42: Register Eq_2 vif_mgmt_register(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register ptr32 a1, Register ui32 a2, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg8C, Register out ptr32 s2Out)
// Called from:
//      mm_hw_config_handler
Eq_2 vif_mgmt_register(Eq_2 ra, Eq_2 s1, Eq_2 a0, ptr32 a1, ui32 a2, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg8C, ptr32 & s2Out)
{
	Eq_2 a0_18;
	if (g_dw4201AFC0 == 0x00)
	{
		a0_18.u0 = 0x01;
		goto l23006F02;
	}
	Eq_2 a4_54;
	Eq_2 a5_55;
	Eq_2 a5_20 = g_t4201AFC8;
	s2 = a1;
	if (a5_20 == 0x00)
		a4_54 = mm_hw_info_set(a0, a5_20, out a5_55);
	else
	{
		struct Eq_24462 * a4_36 = (word32) *((word32) a0 + 1) << 8 | (word32) (*a0) | (word32) (*((word32) a0 + 2)) << 16;
		a0_18.u0 = 0x01;
		if (((word32) *((word32) a0 + 3) << 24 | a4_36) != a2)
			goto l23006F02;
		Eq_11748 a3_44 = a4_36->t001C;
		struct Eq_24574 * a5_49 = (((word32) *((word32) a0 + 5) << 8 | (word32) (*((word32) a0 + 4))) ^ a2) & ~a4_36;
		if (a5_49 != null)
		{
l23006F02:
			s2Out = s2;
			return a0_18;
		}
		union Eq_2 * a4_51 = a5_49->ptr0004;
		(a5_49 | 16)->ptr0004 = a4_51;
		a4_54 = *a4_51;
		a5_55 = a5_49 | 16 | a4_54;
		*((word32) a5_55 + 96) = a3_44;
	}
	word32 a5_303;
	Eq_2 a0_66 = co_list_pop_front(a4_54, a5_55, out a5_303);
	((word32) a0_66 + 86)->u1 = (byte) a1;
	word32 a1_304;
	word32 a2_305;
	word32 a3_306;
	word32 a4_307;
	word32 a5_308;
	word32 a6_309;
	word32 a7_310;
	memcpy((word32) a0_66 + 80, a0, 0x06, out a1_304, out a2_305, out a3_306, out a4_307, out a5_308, out a6_309, out a7_310);
	*(union Eq_2 *) 0x00FFFA4F = a0_66;
	*(union Eq_2 *) 0x0005E442 = a0_66;
	ui32 a5_104 = (a0_66 - &g_t4201A410 >> 3) + 0xA18A4473 & 0x00FF;
	((word32) a0_66 + 87)->u1 = (byte) a5_104;
	*(union Eq_2 *) 0x00FFFA4F = a0_66;
	*(union Eq_2 *) 193334 = a0_66;
	((word32) a0_66 + 64)->u0 = 0x00;
	*((word32) a0_66 + 76) = (byte) a5_104;
	Eq_2 a3_142 = 16775751;
	if (a1 != 0x00)
	{
		if (a1 == 0x02)
		{
			Eq_2 a5_123 = (word32) g_b4201AFD1;
			if (a5_123 == 0x00)
				mm_hw_ap_info_set((struct Eq_10098 *) 16775751, a5_123);
			g_b4201AFD1 = (byte) ((word32) g_b4201AFD1 + 0x01);
			ra = mm_bcn_init_vif(ra, a0_66, dwArg18, out a3_142);
		}
	}
	else
	{
		word32 a5_111 = (word32) g_b4201AFD0;
		*((word32) a0_66 + 32) = a0_66;
		((word32) a0_66 + 121)->u1 = 0x00;
		g_b4201AFD0 = (byte) (a5_111 + 0x01);
		g_t23002CC8 = a0_66;
		((word32) a0_66 + 96)->u1 = ~0x00;
		((word32) a0_66 + 122)->u1 = 0x00;
	}
	byte * s3_180;
	Eq_2 s0_175 = td_start(ra, (word32) *((word32) a0_66 + 87), a3_142, mstatus, dwLoc08, dwArg40, dwArg44, s1, dwArg8C, out s2, out s3_180);
	Eq_2 a5_190 = (word32) *((word32) s0_175 + 87);
	*s3_180 = (byte) a5_190;
	co_list_push_back(s0_175, a5_190);
	a0_18.u0 = 0x00;
	goto l23006F02;
}

