pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 23006FB2: Register Eq_2 vif_mgmt_unregister(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_24669) a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Register out (ptr32 Eq_24679) a4Out, Register out ptr32 s3Out)
// Called from:
//      mm_hw_config_handler
Eq_2 vif_mgmt_unregister(Eq_2 ra, Eq_2 s1, struct Eq_24669 * a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg78, Eq_2 dwArg8C, struct Eq_24679 & a4Out, ptr32 & s3Out)
{
	word32 s2_102 = (char *) a0 + 0x05D8;
	struct Eq_24669 * s5_120 = a0;
	word32 a5_249;
	word32 a5_34 = (word32) co_list_extract(1107406792, (char *) a0 + 1107405288, a4, a5, out a5_249)->b0056;
	word32 s0_106 = 0x4201A410;
	if (a5_34 != 0x00)
	{
		if (a5_34 == 0x02)
		{
			Eq_2 a5_44 = (word32) g_b4201AFD1 + ~0x00 & 0x00FF;
			g_b4201AFD1 = (byte) a5_44;
			if (a5_44 == 0x00)
				a3 = mm_hw_ap_info_reset(a5_44);
		}
	}
	else
		g_b4201AFD0 = (byte) ((word32) g_b4201AFD0 + ~0x00);
	Eq_24724 a5_55 = g_b4201AFD1 + g_b4201AFD0;
	if (a5_55 == 0x01)
	{
		ui32 * a4_58 = *((word32) a5_55 + 4);
		(a5_55 & ~0x10)->ptr0004 = a4_58;
		struct Eq_24748 * a5_63 = a5_55 & ~0x10 | *a4_58;
		a5_63->dw0060 = 0x44B00000;
		a3 = a5_63->t0038;
		a5_63->dw0020 = 0x44B00000;
		((word32[]) 36)[(word32) *((word32) a3 + 60) / 4] = 0x44B00000;
	}
	Eq_2 a4_108 = (word32) a0->b4201AA3E;
	if (a4_108 == 0x02)
		ra = txl_cntrl_clear_bcn_ac(mstatus, dwArg78, out s0_106, out a4_108, out s2_102, out s5_120);
	word32 a2_250;
	word32 a5_251;
	mm_timer_clear(s2_102 + 24 + s0_106, a4_108, out a2_250, out a5_251);
	word32 a5_253;
	word32 a2_252;
	mm_timer_clear(s2_102 + 40 + s0_106, a4_108, out a2_252, out a5_253);
	struct Eq_24791 * s0_122 = (char *) s5_120 + 0x05D8 + s0_106;
	Eq_2 s1_141;
	ptr32 s3_145;
	struct Eq_24679 * a4_164;
	word32 a2_259;
	word32 a3_260;
	word32 a5_261;
	word32 t1_256;
	word32 a0_257;
	word32 a1_258;
	word32 a3_254;
	word32 s4_255;
	Eq_2 ra_166 = memset(td_reset(ra, a3, dwLoc08, dwArg18, dwArg40, dwArg44, s1, dwArg8C, out s1_141, out a3_254, out s3_145, out s4_255), s1_141, 0x00, 0x05D8, out t1_256, out a0_257, out a1_258, out a2_259, out a3_260, out a4_164, out a5_261);
	s0_122->b0056 = 0x04;
	s0_122->b0059 = 0x7F;
	s0_122->b005A = 0x7F;
	g_ptr23006DA8 = s0_122;
	*((word32) s1_141 + 48) = s0_122;
	co_list_push_back(s1_141, 587230588);
	a4Out = a4_164;
	s3Out = s3_145;
	return ra_166;
}

// 230070D6: Register Eq_2 vif_mgmt_add_key(Register Eq_2 ra, Register (ptr32 Eq_9677) a0, Register ui32 a1, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out (ptr32 Eq_9728) s3Out)
// Called from:
//      mm_sec_machwkey_wr
Eq_2 vif_mgmt_add_key(Eq_2 ra, struct Eq_9677 * a0, ui32 a1, ptr32 & s0Out, ptr32 & s1Out, struct Eq_9728 & s3Out)
{
	struct Eq_9728 * s3_19 = (word32) a0->b0029;
	word32 s1_20 = (word32) a0->b0000;
	struct Eq_24865 * a3_28 = (char *) s3_19 + 0x05D8 + (s1_20 + 0x0068);
	a3_28->b4201A892 = (byte) a1;
	a3_28->b4201A890 = (byte) (word32) a0->b0028;
	a3_28->b4201A891 = (byte) (word32) a0->b0000;
	word32 t1_161;
	word32 a0_162;
	word32 a1_163;
	word32 a2_164;
	word32 a3_165;
	word32 a4_166;
	word32 a5_167;
	Eq_2 ra_47 = memset(ra, (char *) a3_28 + 1107404848, 0x00, 72, out t1_161, out a0_162, out a1_163, out a2_164, out a3_165, out a4_166, out a5_167);
	word32 a4_50 = (word32) a3_28->b4201A890;
	word32 * a3_51 = (word32 *) 0x01;
	if (a4_50 == 0x01)
	{
		a3_28->dw4201A878 = 0x00;
		a3_28->dw4201A87C = 0x00;
		a3_28->dw4201A880 = a0->dw0018;
		a3_28->dw4201A884 = a0->dw001C;
		a3_28->dw4201A888 = a0->dw0020;
		a3_28->dw4201A88C = a0->dw0024;
		goto l23007186;
	}
	if (a4_50 != 0x00)
	{
		a3_51 = (word32 *) 0x03;
		if (a4_50 != 0x03)
		{
			a3_28->dw4201A878 = 0x00;
			a3_28->dw4201A87C = 0x00;
l23007186:
			struct Eq_24991 * s1_100 = (char *) s3_19 + 0x05D8 + (s1_20 + 0x0068);
			s1_100->b4201A893 = 0x01;
			s3_19->ptr4201AFA8 = (char *) a3_28 + 1107404848;
			s0Out = s1;
			s1Out = (char *) s1_100 + 0x4201A410;
			s3Out = s3_19;
			return ra_47;
		}
	}
	struct Eq_24955 * a3_76 = (char *) a3_51 + 1103515245;
	a3_76->dw3000039 = *a3_51;
	struct Eq_24964 * a4_88 = (char *) s3_19 + 0x05D8 + (s1_20 + 0x0068);
	a4_88->dw4201A878 = &a3_76->dw3000039 >> 16;
	a4_88->dw4201A87C = 0x00;
	goto l23007186;
}

// 230071F4: void vif_mgmt_del_key(Register (ptr32 Eq_8261) a0, Register word32 a1)
// Called from:
//      RemoveAPKeyInfo
void vif_mgmt_del_key(struct Eq_8261 * a0, word32 a1)
{
	*((char *) &(a0 + (a1 + 0x0068) / 0x05C4)->dw00A8 + 987) = (struct Eq_8261 *) 0x00;
	if (a0->dw05C0 == a0 + (a1 + 0x0488) / 0x05C4)
	{
		a0->dw05C0 = 0x00;
		struct Eq_25026 * a4_13 = (char *) &a0->dw00A8 + 987;
		word32 a5_14;
		for (a5_14 = 0x0488; a5_14 != ~0x0483; ++a5_14)
		{
			if ((word32) a4_13->b0000 != 0x00)
			{
				a0->dw05C0 = a0 + (a5_14 + 0) / 0x05C4;
				return;
			}
			++a4_13;
		}
	}
}

// 23007244: Register Eq_2 vif_mgmt_send_postponed_frame(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArgAC, Stack Eq_2 dwArg0118, Register out Eq_2 s1Out, Register out (ptr32 Eq_25058) s2Out, Register out Eq_25059 s3Out, Register out Eq_25060 s4Out, Register out Eq_2 s5Out)
// Called from:
//      vif_mgmt_reset
//      chan_tx_cfm
Eq_2 vif_mgmt_send_postponed_frame(Eq_2 ra, Eq_2 a0, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArgAC, Eq_2 dwArg0118, union Eq_2 & s1Out, struct Eq_25058 & s2Out, union Eq_25059 & s3Out, union Eq_25060 & s4Out, union Eq_2 & s5Out)
{
	Eq_2 s0_11 = *((word32) a0 + 848);
	Eq_2 s1_12 = a0;
	while (s0_11 != 0x00)
	{
		union Eq_2 * s0_25;
		word32 a0_110;
		word32 a1_111;
		word32 a2_112;
		word32 a3_113;
		word32 a6_114;
		word32 s6_115;
		word32 s7_116;
		word32 s9_117;
		word32 s10_118;
		word32 s11_119;
		ra = sta_mgmt_send_postponed_frame(ra, s1_12, s0_11, s5, mstatus, dwArg68, dwArg78, dwArgAC, dwArg0118, out s0_25, out s1_12, out a0_110, out a1_111, out a2_112, out a3_113, out a6_114, out s2, out s3, out s4, out s5, out s6_115, out s7_116, out s9_117, out s10_118, out s11_119);
		s0_11 = *s0_25;
	}
	s1Out = s1_12;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	return ra;
}

