pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300726C: void vif_mgmt_reset(Register Eq_2 ra, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg9C, Stack Eq_2 dwArg0108)
// Called from:
//      bl_reset_evt
void vif_mgmt_reset(Eq_2 ra, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg9C, Eq_2 dwArg0108)
{
	Eq_2 s0_10 = g_t4201AFC8;
	while (s0_10 != 0x00)
	{
		word32 s1_98;
		word32 s2_99;
		word32 s3_100;
		word32 s4_101;
		ra = vif_mgmt_send_postponed_frame(ra, s0_10, s5, mstatus, dwArg58, dwArg68, dwArg9C, dwArg0108, out s1_98, out s2_99, out s3_100, out s4_101, out s5);
		s0_10 = *s0_10;
	}
}

// 2300728E: Register word32 vif_mgmt_bcn_to_prog(Register Eq_2 a0, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      mm_tbtt_evt
//      mm_sta_tbtt
word32 vif_mgmt_bcn_to_prog(Eq_2 a0, Eq_2 a4, ptr32 mstatus, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out)
{
	Eq_2 a1_5 = *(union Eq_2 *) 0x44B00120;
	ptr32 a5_16;
	word32 s1_19;
	ptr32 s2_20;
	ptr32 s3_21;
	word32 a0_29;
	word32 a1_30;
	word32 a2_31;
	word32 a4_32;
	word32 s4_33;
	word32 s8_34;
	mm_timer_set((word32) a0 + 40, (word32) a1_5 + 0x02000710, a4, mstatus, out s1_19, out a0_29, out a1_30, out a2_31, out a4_32, out a5_16, out s2_20, out s3_21, out s4_33, out s8_34);
	a5Out = a5_16;
	s2Out = s2_20;
	s3Out = s3_21;
	return s1_19;
}

// 230072A6: Register Eq_2 vif_mgmt_bcn_recv(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg88, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0158, Register out Eq_17140 s0Out, Register out Eq_17141 a1Out, Register out Eq_17142 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_17145 a5Out, Register out ptr32 s3Out, Register out (ptr32 Eq_17147) s4Out, Register out Eq_17148 s5Out, Register out ptr32 s6Out, Register out Eq_17150 s7Out, Register out (ptr32 Eq_17151) s9Out, Register out (ptr32 Eq_17152) s10Out)
// Called from:
//      rxl_cntrl_evt
Eq_2 vif_mgmt_bcn_recv(Eq_2 ra, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg88, Eq_2 dwArgF8, Eq_2 dwArg0158, union Eq_17140 & s0Out, union Eq_17141 & a1Out, union Eq_17142 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_17145 & a5Out, ptr32 & s3Out, struct Eq_17147 & s4Out, union Eq_17148 & s5Out, ptr32 & s6Out, union Eq_17150 & s7Out, struct Eq_17151 & s9Out, struct Eq_17152 & s10Out)
{
	Eq_17145 a5_4 = 0x42018EB0;
	Eq_2 a4_6 = (word32) g_b42018EB0;
	if (a4_6 != 0x00)
	{
		ui32 a5_7 = g_dw42018EB4;
		a5_4 = a5_7 & 0x08;
		if ((a5_7 & 0x08) == 0x00)
		{
			word32 a0_9 = (a5_7 & 0x08)->dw0004;
			if ((a5_7 & 0x08) == 0x00)
			{
				struct Eq_24244 * a5_20;
				word32 a2_141;
				mm_timer_clear(a0_9 + 40, a4_6, out a2_141, out a5_20);
				Eq_17141 a1_29;
				Eq_17142 a2_30;
				Eq_2 a3_31;
				Eq_2 a4_32;
				Eq_17145 a5_33;
				Eq_17140 s0_36;
				struct Eq_17152 * s10_38;
				ptr32 s3_41;
				struct Eq_17147 * s4_42;
				Eq_17148 s5_43;
				ptr32 s6_44;
				Eq_17150 s7_45;
				struct Eq_17151 * s9_47;
				Eq_2 ra_35 = vif_mgmt_bcn_to_evt(ra, a3, a5_20, s2, mstatus, dwArg08, dwArg18, dwArg88, dwArgF8, dwArg0158, out s0_36, out a1_29, out a2_30, out a3_31, out a4_32, out a5_33, out s3_41, out s4_42, out s5_43, out s6_44, out s7_45, out s9_47, out s10_38);
				s0Out = s0_36;
				a1Out = a1_29;
				a2Out = a2_30;
				a3Out = a3_31;
				a4Out = a4_32;
				a5Out = a5_33;
				s3Out = s3_41;
				s4Out = s4_42;
				s5Out = s5_43;
				s6Out = s6_44;
				s7Out = s7_45;
				s9Out = s9_47;
				s10Out = s10_38;
				return ra_35;
			}
		}
	}
	s0Out = s0;
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4_6;
	a5Out = a5_4;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s9Out = s9;
	s10Out = s10;
	return ra;
}

// 230072DC: Register uint32 vif_mgmt_set_ap_bcn_int(Register (ptr32 Eq_25234) a0, Register uint32 a1, Register ptr32 mstatus)
// Called from:
//      mm_hw_config_handler
uint32 vif_mgmt_set_ap_bcn_int(struct Eq_25234 * a0, uint32 a1, ptr32 mstatus)
{
	uint32 a4_16;
	Eq_2 a5_14;
	a0->w033E = (word16) a1;
	__csrrc(mstatus, 0x08);
	if ((word32) g_b4201AFD1 > 0x01)
	{
		a4_16 = (word32) g_a4201AD26[(word32) g_b4201AFD2];
		if (a1 < a4_16)
		{
			g_b4201AFD2 = (byte) (word32) a0->b0057;
			a4_16 = a1;
		}
		a5_14 = g_t4201AFC8;
		while (a5_14 != 0x00)
		{
			uint32 a3_33 = (word32) *((word16) a5_14.u0 + 0x033E);
			((word16) a5_14.u0 + 833)->u1 = 0x01;
			((word16) a5_14.u0 + 832)->u1 = (byte) (a3_33 >> a4_16);
			a5_14 = *a5_14.u0;
		}
	}
	else
	{
		g_b4201AFD2 = (byte) (word32) a0->b0057;
		a0->w0340 = 0x0101;
		a5_14.u0 = 0x0101;
		a4_16 = a1;
	}
	(a5_14 & 0xF0000000 | a4_16)->dw0064 = (word32) *((word16) a5_14.u0 + 100);
	__csrrs(mstatus, 0x08);
	return a4_16;
}

// 23007364: void vif_mgmt_switch_channel(Register Eq_2 ra, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0148)
// Called from:
//      mm_sta_tbtt
//      mm_bcn_transmitted
void vif_mgmt_switch_channel(Eq_2 ra, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgE8, Eq_2 dwArg0148)
{
	Eq_2 a3_23;
	word32 s8_303;
	word32 s4_302;
	word32 s3_301;
	word32 s2_300;
	word32 s1_304;
	word32 s6_306;
	word32 s10_307;
	word32 a4_305;
	word32 a4_297;
	word32 a6_299;
	word32 a5_298;
	word32 a2_296;
	word32 a1_295;
	word32 a0_294;
	word32 s1_293;
	Eq_2 s0_112;
	Eq_2 ra_49 = chan_ctxt_unlink(ke_msg_alloc(ra, 88, 0x0D, 0x03, a4, mstatus, dwLoc08, out s0_112, out s1_293, out a0_294, out a1_295, out a2_296, out a3_23, out a4_297, out a5_298, out a6_299, out s2_300, out s3_301, out s4_302, out s8_303), s0_112, (word32) *((word32) s0_112 + 87), a3_23, mstatus, s2, dwArg08, dwArg18, dwArg78, dwArgE8, dwArg0148, out s1_304, out a4_305, out s6_306, out s10_307);
	struct Eq_25374 * a1_108 = (word32) *((word32) s0_112 + 0x05CA);
	Eq_2 a3_69;
	struct Eq_25380 * a0_114 = me_freq_to_chan_ptr((word32) *((word32) s0_112 + 0x05C8), a1_108, out a3_69);
	word32 a5_72 = (word32) *((word32) s0_112 + 0x05CC);
	*((word32) s0_112 + 932) = a0_114;
	*((word32) s0_112 + 936) = (word16) a5_72;
	*((word32) s0_112 + 0x03AA) = (word16) (word32) *((word32) s0_112 + 0x05CE);
	word32 a5_78 = (word32) *((word32) s0_112 + 1481);
	((word32) s0_112 + 987)->u1 = (byte) a5_78;
	Eq_2 a4_120 = 0x04;
	if (a5_78 == 0x04)
		a5_78 = 0x03;
	Eq_2 s1_131;
	((word32) s0_112 + 986)->u1 = (byte) a5_78;
	if (a0_114 != null)
	{
		((word32) s0_112 + 1488)->u1 = (byte) (int32) a0_114->b0004;
		Eq_2 s2_100;
		word32 s5_309;
		word32 s6_310;
		word32 s3_308;
		s0_112 = chan_ctxt_add((word32) s0_112 + 0x05C8, fp + ~0x10, 0x04, dwArg88, out s1_131, out a0_114, out a4_120, out s2_100, out s3_308, out s5_309, out s6_310);
		*((word32) s1_131 + 1) = (byte) a0_114;
		((word32) s1_131 + 2)->u1 = ~0x00;
		a1_108 = (struct Eq_25374 *) 0xFF;
		word32 a5_111 = (word32) *((word32) s0_112 + 86);
		if (a5_111 != 0x00)
		{
			if (a5_111 == 0x02)
			{
				((word32) s0_112 + 839)->u1 = 0x00;
				if (a0_114 == null)
				{
					word32 a4_322;
					word32 s2_323;
					word32 s3_324;
					word32 s4_325;
					chan_ctxt_link(ra_49, (word32) *((word32) s0_112 + 87), (struct Eq_25374 *) 0xFF, a3_69, s2_100, mstatus, out s1_131, out a4_322, out s2_323, out s3_324, out s4_325);
					g_b42019E8D = 0x01;
				}
			}
			goto l2300745A;
		}
	}
	else
		__ebreak();
	((word32) s0_112 + 121)->u1 = 0x00;
	if (a0_114 == null)
	{
		Eq_2 a4_150;
		struct Eq_25566 * s2_155;
		word32 s1_327;
		word32 s3_328;
		word32 s4_329;
		Eq_2 s0_153 = chan_ctxt_link(ra_49, (word32) *((word32) s0_112 + 87), a1_108, a3_69, (word32) *((word32) s0_112 + 96), mstatus, out s1_327, out a4_150, out s2_155, out s3_328, out s4_329);
		word32 a2_330;
		word32 a5_331;
		mm_timer_clear((word32) s0_153 + 40, a4_150, out a2_330, out a5_331);
		word32 a0_332;
		word32 a1_333;
		word32 a2_334;
		word32 a4_335;
		word32 a5_336;
		word32 s2_337;
		word32 s3_338;
		word32 s4_339;
		word32 s8_340;
		Eq_2 s0_180 = mm_timer_set((word32) s0_153 + 24, (word32) *(union Eq_2 *) 0x44B00120 + s2_155->dw420190D4, 432, mstatus, out s1_131, out a0_332, out a1_333, out a2_334, out a4_335, out a5_336, out s2_337, out s3_338, out s4_339, out s8_340);
		((word32) s0_180 + 116)->u1 = 0x00;
		((word32) s0_180 + 122)->u1 = 0x01;
	}
	else
	{
		word32 a4_326;
		mm_send_connection_loss_ind(ra_49, a4_120, mstatus, s2, out s1_131, out a4_326);
	}
l2300745A:
	word32 s1_311;
	word32 a0_312;
	word32 a1_313;
	word32 a2_314;
	word32 a3_315;
	word32 a4_316;
	word32 a5_317;
	word32 s2_318;
	word32 s3_319;
	word32 s4_320;
	word32 s8_321;
	ke_msg_send(s1_131, mstatus, out s1_311, out a0_312, out a1_313, out a2_314, out a3_315, out a4_316, out a5_317, out s2_318, out s3_319, out s4_320, out s8_321);
}

// 23007474: Register (ptr32 Eq_25633) vif_mgmt_get_first_ap_inf()
// Called from:
//      rxu_cntrl_frame_handle
//      apm_probe_req_handler
struct Eq_25633 * vif_mgmt_get_first_ap_inf()
{
	struct Eq_25633 * a0_10 = null;
	if ((word32) g_b4201AFD1 != 0x00)
	{
		while (a0_10 != null && (word32) a0_10->b0056 != 0x02)
			a0_10 = a0_10->ptr0000;
	}
	return a0_10;
}

