pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 23007498: Register Eq_2 me_init(Register Eq_2 ra, Register ptr32 mstatus, Register out ptr32 s0Out)
// Called from:
//      mm_reset_req_handler
//      bl_init
Eq_2 me_init(Eq_2 ra, ptr32 mstatus, ptr32 & s0Out)
{
	word32 t1_104;
	word32 a0_105;
	word32 a1_106;
	word32 a2_107;
	word32 a3_108;
	word32 a4_109;
	word32 a5_110;
	Eq_2 ra_16 = memset(ra, 1107406804, 0x00, 308, out t1_104, out a0_105, out a1_106, out a2_107, out a3_108, out a4_109, out a5_110);
	word32 s1_111;
	word32 a0_112;
	word32 a1_113;
	word32 a4_114;
	word32 a5_115;
	word32 s2_116;
	word32 s3_117;
	word32 s4_118;
	ke_state_set(0x05, 0x00, mstatus, out s1_111, out a0_112, out a1_113, out a4_114, out a5_115, out s2_116, out s3_117, out s4_118);
	Eq_2 ra_60 = apm_init(scanu_init(ra_16, mstatus), mstatus);
	sm_init(mstatus);
	s0Out = bam_init(mstatus);
	return ra_60;
}

// 230074CA: Register (ptr32 Eq_25383) me_freq_to_chan_ptr(Register (ptr32 Eq_25383) a0, Register (ptr32 Eq_25374) a1, Register out (ptr32 Eq_25374) a3Out)
// Called from:
//      vif_mgmt_switch_channel
//      rxu_mgt_ind_handler
//      apm_start_req_handler
struct Eq_25383 * me_freq_to_chan_ptr(struct Eq_25383 * a0, struct Eq_25374 * a1, struct Eq_25374 & a3Out)
{
	struct Eq_25383 * a5_12;
	word32 a4_10;
	if (a0 != null)
	{
		a4_10 = (word32) g_b4201B101;
		a5_12 = &g_t4201B058;
	}
	else
	{
		a4_10 = (word32) g_b4201B100;
		a5_12 = &g_t4201B004;
	}
	struct Eq_25374 * a3_13 = (struct Eq_25374 *) 0x06;
	struct Eq_25383 * a4_17 = a5_12 + (a4_10 + 0x06) / 6;
	do
	{
		if (a5_38 == a4_17)
		{
			a3Out = a3_13;
			return null;
		}
		a5_12 = a5_38 + 1;
		a3_13 = (word32) a5_12->wFFFFFFFA;
		a5_38 = a5_12;
	} while (a3_13 != a1);
	a3Out = a3_13;
	return a5_38;
}

// 2300750C: Register (ptr32 (ptr32 Eq_24046)) michael_block(Register (ptr32 (ptr32 Eq_24046)) a1, Register (ptr32 Eq_24046) a4, Register (ptr32 (ptr32 Eq_24046)) a5, Register out ptr32 a2Out, Register out Eq_25746 a3Out, Register out Eq_25747 a4Out, Register out (ptr32 Eq_25748) a5Out)
// Called from:
//      me_mic_init
//      me_mic_calc
//      me_mic_end
struct Eq_24046 ** michael_block(struct Eq_24046 ** a1, struct Eq_24046 * a4, struct Eq_24046 ** a5, ptr32 & a2Out, union Eq_25746 & a3Out, union Eq_25747 & a4Out, struct Eq_25748 & a5Out)
{
	uint32 a1_10 = a1 ^ a5;
	ui32 a4_14 = a4 ^ (a1_10 >> 0x0F | a1_10 << 0x11);
	uint32 a1_15 = a1_10 + a4_14;
	ui32 a5_24 = (a1_15 >> 0x08 & 0x00FF00FF | a1_15 << 0x08 & 0xFF00FF00) ^ a4_14;
	uint32 a1_25 = a1_15 + a5_24;
	Eq_25747 a4_29 = (a1_25 << 0x03 | a1_25 >> 0x1D) ^ a5_24;
	uint32 a1_30 = (word32) a4_29.u0 + a1_25;
	struct Eq_25748 * a5_34 = (a1_30 >> 0x02 | a1_30 << 0x1E) ^ a4_29;
	struct Eq_24046 * a0_7 = a4->ptr0004;
	a5_34->ptr0004 = a0_7;
	struct Eq_24046 ** a1_35 = a5_34 + a1_30 / 8;
	*a1_35 = (struct Eq_24046 **) a0_7;
	a2Out = 0xFF00FF00;
	a3Out = a1_30 << 0x1E;
	a4Out = a4_29;
	a5Out = a5_34;
	return a1_35;
}

// 23007564: Register (ptr32 (ptr32 Eq_24046)) me_mic_init(Register (ptr32 Eq_24046) a0, Register (ptr32 Eq_24047) a2, Register (ptr32 Eq_24048) a3, Register (ptr32 Eq_24046) a4, Register out (ptr32 Eq_24046) s1Out, Register out (ptr32 (ptr32 Eq_24046)) s2Out, Register out (ptr32 (ptr32 Eq_24046)) s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      txl_frame_send_eapol_frame
//      rxu_cntrl_frame_handle
//      txu_cntrl_tkip_mic_append
struct Eq_24046 ** me_mic_init(struct Eq_24046 * a0, struct Eq_24047 * a2, struct Eq_24048 * a3, struct Eq_24046 * a4, struct Eq_24046 & s1Out, struct Eq_24046 & s2Out, struct Eq_24046 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	struct Eq_24046 ** s3_30 = a4 & 7;
	struct Eq_24046 ** a5_32 = (word32) a2->b0003 << 24 | (((word32) a2->b0001 << 8 | (word32) a2->b0000) | (word32) a2->b0002 << 16);
	struct Eq_24046 ** s0_40 = ((word32) a3->b0001 << 8 | (word32) a3->b0000) << 16 | ((word32) a2->b0005 << 8 | (word32) a2->b0004);
	struct Eq_24046 ** s2_50 = (word32) a3->b0005 << 24 | ((word32) a3->b0004 << 16 | ((word32) a3->b0003 << 8 | (word32) a3->b0002));
	if (a4 == (struct Eq_24046 *) 0x00FF)
		s3_30 = null;
	a4->ptr0000 = a0;
	a0->dw0008 = 0x00;
	a4->ptr0004 = a0;
	a0->b000C = 0x00;
	struct Eq_24046 * a4_68;
	struct Eq_24046 ** a5_69;
	word32 a2_124;
	word32 a3_125;
	michael_block(a5_32, a4, a5_32, out a2_124, out a3_125, out a4_68, out a5_69);
	struct Eq_24046 * a4_77;
	struct Eq_24046 ** a5_78;
	word32 a2_126;
	word32 a3_127;
	michael_block(s0_40, a4_68, a5_69, out a2_126, out a3_127, out a4_77, out a5_78);
	struct Eq_24046 * a4_86;
	struct Eq_24046 ** a5_87;
	word32 a2_128;
	word32 a3_129;
	michael_block(s2_50, a4_77, a5_78, out a2_128, out a3_129, out a4_86, out a5_87);
	word32 a2_130;
	word32 a3_131;
	word32 a4_132;
	word32 a5_133;
	michael_block(s3_30, a4_86, a5_87, out a2_130, out a3_131, out a4_132, out a5_133);
	s1Out = a0;
	s2Out = s2_50;
	s3Out = s3_30;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return s0_40;
}

// 23007616: Register word32 me_mic_calc(Register (ptr32 Eq_24083) a0, Register int32 a1, Register Eq_2 a2, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg0128, Register out (ptr32 (ptr32 Eq_24046)) s1Out, Register out Eq_24089 a1Out, Register out ptr32 a2Out, Register out (ptr32 Eq_24091) s2Out, Register out (ptr32 Eq_24083) s3Out, Register out ptr32 s4Out, Register out (ptr32 Eq_24094) s5Out, Register out (ptr32 Eq_24095) s6Out, Register out (ptr32 Eq_24096) s7Out, Register out ptr32 s8Out, Register out Eq_24098 s9Out, Register out Eq_24099 s10Out)
// Called from:
//      txl_frame_send_eapol_frame
//      rxu_cntrl_frame_handle
//      txu_cntrl_tkip_mic_append
word32 me_mic_calc(struct Eq_24083 * a0, int32 a1, Eq_2 a2, Eq_2 dwArg1C, Eq_2 dwArg0128, struct Eq_24046 & s1Out, union Eq_24089 & a1Out, ptr32 & a2Out, struct Eq_24091 & s2Out, struct Eq_24083 & s3Out, ptr32 & s4Out, struct Eq_24094 & s5Out, struct Eq_24095 & s6Out, struct Eq_24096 & s7Out, ptr32 & s8Out, union Eq_24098 & s9Out, union Eq_24099 & s10Out)
{
	ui32 s0_34 = 0x04 - (a1 & 0x03);
	ui32 s4_30 = (a1 & -4) + 4;
	ui32 s0_35 = s0_34 & 0x00FF;
	ui32 a3_39 = (word32) a0->b000C;
	Eq_24089 a1_120 = *(a1 & -4) >> ((a1 & 0x03) << 3);
	struct Eq_24046 ** a0_41 = a0->ptr0008;
	uint32 s8_43 = a2 - (s0_34 & 0x00FF);
	if (a2 < (s0_34 & 0x00FF))
	{
		a1_120 &= ~0x00 >> (0x04 - a2 << 3);
		s0_35 = a2 & 0x00FF;
		s8_43 = 0x00;
	}
	uint32 s0_152 = s0_35 + a3_39;
	struct Eq_24046 ** a5_101 = (struct Eq_24046 **) 0x03;
	struct Eq_24046 ** s1_107 = a1_120 << (a3_39 << 0x03) | a0_41;
	if (s0_152 > 0x03)
	{
		ui32 a4_62 = 0x04 - a3_39;
		struct Eq_24046 ** s2_65 = null;
		if (a4_62 << 3 != 32)
			s2_65 = a1_120 >> (a4_62 << 3);
		s0_152 += ~0x03;
		word32 a4_381;
		word32 a3_380;
		word32 a2_379;
		a1_120 = michael_block(s1_107, a4_62 << 3, (struct Eq_24046 **) 32, out a2_379, out a3_380, out a4_381, out a5_101);
		s1_107 = s2_65;
	}
	ui32 s2_86 = 0x04 - s0_152;
	struct Eq_24096 * s6_90 = s8_43 >> 0x02;
	struct Eq_24094 * s5_154 = s0_152 << 0x03;
	struct Eq_24096 * s7_100 = null;
	while (s6_90 != s7_100)
	{
		struct Eq_24046 * a4_103 = *a5_101;
		s10 = &a4_103->ptr0004;
		struct Eq_24046 ** a1_108 = a5_101 << s5_154 | s1_107;
		s1_107 = null;
		if (s2_86 << 3 != 32)
			s1_107 = a5_101 >> (s2_86 << 3);
		word32 a2_382;
		word32 a3_383;
		word32 a4_384;
		a1_120 = michael_block(a1_108, a4_103, a5_101, out a2_382, out a3_383, out a4_384, out a5_101);
		s7_100 = (struct Eq_24096 *) ((char *) s7_100 + 1);
	}
	int32 * s4_135 = s4_30 + (s6_90 << 2);
	if ((s8_43 & -4) < s8_43)
	{
		ui32 a5_136 = s8_43 & 3;
		ui32 a4_138 = 0x04 - a5_136;
		a1_120.u0 = 32;
		int32 a3_141 = *s4_135;
		uint32 a2_142 = 0x00;
		if (a4_138 << 3 != 32)
			a2_142 = ~0x00 >> (a4_138 << 3);
		struct Eq_24046 * a4_147 = a3_141 & a2_142;
		s5_154 = a4_147 << s5_154;
		s0_152 += a5_136;
		s1_107 |= s5_154;
		if (s0_152 > 0x03)
		{
			struct Eq_24046 ** s4_159 = null;
			if (s2_86 << 3 != 32)
				s4_159 = a4_147 >> (s2_86 << 3);
			s0_152 += ~0x03;
			word32 a5_388;
			word32 a4_387;
			word32 a3_386;
			word32 a2_385;
			a1_120 = michael_block(s1_107, a4_147, (struct Eq_24046 **) 32, out a2_385, out a3_386, out a4_387, out a5_388);
			s1_107 = s4_159;
		}
	}
	a0->b000C = (byte) s0_152;
	a0->ptr0008 = s1_107;
	0x00 = (uint16) dwArg0128;
	0x00 = (uint16) dwArg1C;
	s1Out = s1_107;
	a1Out = a1_120;
	a2Out = dwArgB8;
	s2Out = s2_86 << 3;
	s3Out = a0;
	s4Out = dwArg78;
	s5Out = s5_154;
	s6Out = s6_90 << 2;
	s7Out = s7_100;
	s8Out = s5;
	s9Out.u0 = 32;
	s10Out = s10;
	return s4;
}

// 2300775A: Register Eq_24089 me_mic_end(Register Eq_2 s1, Register (ptr32 Eq_24125) a0, Register out ptr32 a2Out, Register out Eq_24127 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      txl_frame_send_eapol_frame
//      rxu_cntrl_frame_handle
//      txu_cntrl_tkip_mic_append
Eq_24089 me_mic_end(Eq_2 s1, struct Eq_24125 * a0, ptr32 & a2Out, union Eq_24127 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	struct Eq_24046 * a4_11 = (word32) a0->b000C;
	if (a4_11 <= (struct Eq_24046 *) 0x03)
	{
		ui32 a1_20 = (word32) a0->b000C;
		struct Eq_24046 * a4_30;
		struct Eq_24046 ** a5_31;
		word32 a2_53;
		word32 a3_54;
		michael_block(90 << (a1_20 << 0x03) | s1, a4_11, a1_20 << 0x03, out a2_53, out a3_54, out a4_30, out a5_31);
		ptr32 a2_40;
		Eq_24127 a3_41;
		ptr32 a4_42;
		ptr32 a5_43;
		Eq_24089 a1_39 = michael_block(null, a4_30, a5_31, out a2_40, out a3_41, out a4_42, out a5_43);
		a2Out = a2_40;
		a3Out = a3_41;
		a4Out = a4_42;
		a5Out = a5_43;
		return a1_39;
	}
	else
		assert_err();
}

// 230077B0: Register (ptr32 Eq_26180) me_set_sta_ht_vht_param(Register (ptr32 Eq_26180) a0, Register (ptr32 Eq_26181) a1, Register out Eq_26182 a4Out)
// Called from:
//      me_sta_add_req_handler
//      mm_sta_add_cfm_handler
struct Eq_26180 * me_set_sta_ht_vht_param(struct Eq_26180 * a0, struct Eq_26181 * a1, union Eq_26182 & a4Out)
{
	Eq_26183 a5_5 = (word32) a0->w00C0;
	uint32 a7_8 = (word32) g_b4201B103;
	uint32 a3_11 = a5_5 >> 0x01 & 0x01;
	Eq_26182 a2_12 = a5_5 >> 0x08 & 0x03;
	if (a7_8 < a3_11)
		a3_11 = a7_8;
	a0->b00F0 = (byte) a3_11;
	uint32 a4_19 = (word32) a1->b0083;
	if (a4_19 == 0x04)
		a4_19 = 0x02;
	if (a3_11 < a4_19)
		a4_19 = a3_11;
	a0->b00F1 = (byte) a4_19;
	Eq_26182 a4_32 = (word32) g_b4201B102;
	if (a2_12 < a4_32)
		a4_32 = a2_12;
	a0->b00F4 = (byte) a4_32;
	a4Out = a4_32;
	return (word32) ((a5_5 & 0x0C) != ~0x0B);
}

