pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 23007806: Register (ptr32 Eq_26234) me_11n_nss_max(Register (ptr32 Eq_26234) a0)
// Called from:
//      me_sta_bw_nss_max_upd
//      rc_init
struct Eq_26234 * me_11n_nss_max(struct Eq_26234 * a0)
{
	struct Eq_26234 * a5_10;
	if ((word32) a0->b0003 == 0x00)
	{
		a5_10 = (struct Eq_26234 *) 0x02;
		if ((word32) a0->b0002 == 0x00)
		{
			a5_10 = (word32) a0->b0001;
			if (a5_10 != null)
				a5_10 = (struct Eq_26234 *) 0x01;
		}
	}
	else
		a5_10 = (struct Eq_26234 *) 0x03;
	return a5_10;
}

// 23007824: Register int32 me_legacy_ridx_min(Register int32 a0)
// Called from:
//      rc_init
int32 me_legacy_ridx_min(int32 a0)
{
	ui32 a5_10;
	for (a5_10 = 0x00; a5_10 != 0x0C; ++a5_10)
	{
		int32 a3_12 = a5_10 & 0x00FF;
		if ((a0 >> a5_10 & 0x01) != 0x00)
			return a3_12;
	}
	a3_12 = 0x0C;
	return a3_12;
}

// 23007840: Register int32 me_legacy_ridx_max(Register int32 a0)
// Called from:
//      rc_init
int32 me_legacy_ridx_max(int32 a0)
{
	if (a0 == 0x00)
		return 0x0C;
	ui32 a5_15;
	for (a5_15 = 11; a5_15 != ~0x00; a5_15 += ~0x00)
	{
		ui32 a4_14 = 11 - a5_15 & 0x00FF;
		if ((a0 >> a5_15 & 0x01) != 0x00)
			return 11 - a4_14 & 0x00FF;
	}
	a4_14 = 0x0C;
	return 11 - a4_14 & 0x00FF;
}

// 2300786E: Register int32 me_rate_translate(Register int32 a0, Register out Eq_26299 a4Out)
// Called from:
//      me_legacy_rate_bitfield_build
//      me_init_bcmc_rate
//      apm_assoc_req_handler
int32 me_rate_translate(int32 a0, union Eq_26299 & a4Out)
{
	int32 a0_10;
	Eq_26299 a4_11 = 22;
	if ((a0 & 0x007F) == 22)
	{
		a0_10 = 0x03;
		goto l230078E8;
	}
	if ((a0 & 0x007F) > 22)
	{
		a4_11.u0 = 48;
		a0_10 = 0x08;
		if ((a0 & 0x007F) == 48)
			goto l230078E8;
		if ((a0 & 0x007F) <= 48)
		{
			a4_11.u0 = 0x18;
			a0_10 = 0x06;
			if ((a0 & 0x007F) != 0x18)
			{
				a4_11.u0 = 36;
				a0_10 = 0x07;
				goto l23007894;
			}
		}
		else
		{
			a4_11.u0 = 96;
			a0_10 = 0x0A;
			if ((a0 & 0x007F) != 96)
			{
				a4_11.u0 = 0x006C;
				a0_10 = 11;
				if ((a0 & 0x007F) != 0x006C)
				{
					a4_11.u0 = 72;
					a0_10 = 0x09;
					goto l23007894;
				}
			}
		}
l230078E8:
		a4Out = a4_11;
		return a0_10;
	}
	else
	{
		a4_11.u0 = 11;
		a0_10 = 0x02;
		if ((a0 & 0x007F) == 11)
			goto l230078E8;
		if ((a0 & 0x007F) <= 11)
		{
			a4_11.u0 = 0x02;
			a0_10 = 0x00;
			if ((a0 & 0x007F) == 0x02)
				goto l230078E8;
			a4_11.u0 = 0x04;
			a0_10 = 0x01;
		}
		else
		{
			a4_11.u0 = 0x0C;
			a0_10 = 0x04;
			if ((a0 & 0x007F) == 0x0C)
				goto l230078E8;
			a4_11.u0 = 0x12;
			a0_10 = 0x05;
		}
l23007894:
		if ((a0 & 0x007F) != a4_11)
		{
			a4Out = a4_11;
			return 0x00FF;
		}
		goto l230078E8;
	}
}

// 230078EA: void me_get_basic_rates(Register (ptr32 byte) a0, Register Eq_2 a1)
// Called from:
//      apm_start_req_handler
void me_get_basic_rates(byte * a0, Eq_2 a1)
{
	a1->u1 = 0x00;
	int32 a5_21;
	for (a5_21 = 0x00; a5_21 < (word32) (*a0); ++a5_21)
	{
		word32 a3_11 = (word32) (a0 + a5_21)[1];
		if ((int32) (byte) a3_11 < 0x00)
		{
			int32 a4_15 = (word32) *a1;
			(word32) a1 + a4_15 + 1 = (ptr32) (byte) a3_11;
			a1->u1 = (byte) (a4_15 + 0x01);
		}
	}
}

// 23007922: Register word32 me_legacy_rate_bitfield_build(Register (ptr32 Eq_26405) a0, Register word32 a1, Stack Eq_2 dwArg0128, Register out Eq_26408 s1Out, Register out Eq_26409 a0Out, Register out ptr32 a4Out, Register out (ptr32 Eq_26405) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out (ptr32 Eq_26414) s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out)
// Called from:
//      rc_init
//      sm_set_bss_param
//      apm_set_bss_param
//      apm_assoc_req_handler
//      rxu_mgt_ind_handler
//      apm_start_req_handler
word32 me_legacy_rate_bitfield_build(struct Eq_26405 * a0, word32 a1, Eq_2 dwArg0128, union Eq_26408 & s1Out, union Eq_26409 & a0Out, ptr32 & a4Out, struct Eq_26405 & s2Out, ptr32 & s3Out, ptr32 & s4Out, struct Eq_26414 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out)
{
	Eq_26409 s0_26 = 0x00;
	Eq_26408 s1_27 = 0x00;
	while (s1_27 < (word32) a0->b0000)
	{
		word32 a0_37 = CONVERT(Mem21[a0 + s1_27 + 1:byte], byte, word32);
		if (a1 == 0x00 || (int32) ((byte) a0_37) < 0x00)
		{
			Eq_26439 a0_42 = me_rate_translate(a0_37, out a4);
			if (a0_42 > 11)
				assert_warn();
			else
				s0_26 = (word32) (word16) (s0_26 | 0x01 << a0_42);
		}
		s1_27 = (word32) s1_27.u0 + 1;
	}
	0x00 = (uint16) dwArg0128;
	s1Out = s1_27;
	a0Out = s0_26;
	a4Out = a4;
	s2Out = a0;
	s3Out = 0x01;
	s4Out = dwArg78;
	s5Out = (struct Eq_26414 *) 11;
	s6Out = 0x23074000;
	s7Out = 0x23075000;
	s8Out = s5;
	return dwArgE4;
}

// 230079A8: Register (ptr32 Eq_26465) me_build_capability(Register (ptr32 Eq_26465) a0, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_26468 a4Out, Register out ptr32 a5Out)
// Called from:
//      me_build_associate_req
//      me_build_beacon
//      me_build_probe_rsp
//      me_build_associate_rsp
struct Eq_26465 * me_build_capability(struct Eq_26465 * a0, ptr32 & a2Out, ptr32 & a3Out, union Eq_26468 & a4Out, ptr32 & a5Out)
{
	ptr32 a2_11 = (word32) a0->b4201AA3E;
	Eq_26468 a4_12 = 0x11;
	if (a2_11 != 0x00)
	{
		a4_12.u0 = 0x01;
		if (a2_11 == 0x02)
		{
			a2_11 = 0x12FFFA00;
			if ((a0->dw4201ADD0 & 0x12FFFA00) != 0x00)
				a4_12.u0 = 0x11;
		}
	}
	struct Eq_26465 * a0_28 = a4_12 | 1312;
	ptr32 a3_29 = (word32) a0->ptr4201AD8C->b0002;
	if (a3_29 != 0x01)
		a0_28 = a4_12 | 0x0420;
	a2Out = a2_11;
	a3Out = a3_29;
	a4Out = a4_12;
	a5Out = 0x01;
	return a0_28;
}

// 23007A00: Register word32 me_init_bcmc_rate(Register (ptr32 Eq_26508) a0, Register out ptr32 a4Out)
// Called from:
//      apm_start_cfm
word32 me_init_bcmc_rate(struct Eq_26508 * a0, ptr32 & a4Out)
{
	if ((word32) a0->b00B0 != 0x00)
	{
		int32 a3_16 = (word32) a0->b00B0;
		int32 a5_17;
		int32 a0_18 = 0x00;
		for (a5_17 = 0x00; a5_17 < a3_16; ++a5_17)
		{
			ui32 a4_24 = (word32) (&(a0 + a5_17 / 0x011B)->b00B0)[1];
			if (a0_18 < (a4_24 & -0x0081))
				a0_18 = a4_24 & 0x007F;
		}
		ptr32 a4_38;
		word32 a4_58;
		word32 a3_37 = rc_init_bcmc_rate(a0, me_rate_translate(a0_18, out a4_58), out a4_38);
		a0->b011A = 0x00;
		a4Out = a4_38;
		return a3_37;
	}
	else
		assert_err();
}

// 23007A62: Register (ptr32 Eq_26558) me_tx_cfm_singleton(Register (ptr32 Eq_26558) a5, Stack word32 dwArg1C, Stack uint32 dwArg24, Stack word32 dwArg0128)
// Called from:
//      txl_cfm_evt
struct Eq_26558 * me_tx_cfm_singleton(struct Eq_26558 * a5, word32 dwArg1C, uint32 dwArg24, word32 dwArg0128)
{
	struct Eq_26562 * a0_17;
	uint32 a5_8 = a5->ptr0000->dw0010;
	ui32 a2_11 = a5_8 >> 0x08 & 0x00FF;
	struct Eq_26575 * a0_5 = a5->ptr006C;
	uint32 a2_14 = a2_11 + (word32) ((a5_8 & 0x10000000) != 0x00);
	if ((a5_8 & 0x10000000) != 0x00)
	{
		rf_dump_status();
		a2_14 = dwArg24;
		a0_17 = (word32) a0_5->b0030;
	}
	else
		a0_17 = (word32) a0_5->b0030;
	return rc_update_counters(a0_17, a2_11 + 1, a2_14, dwArg1C, dwArg0128);
}

// 23007AAE: Register Eq_2 me_check_rc(Register Eq_2 ra, Register (ptr32 Eq_26611) a0, Register Eq_2 s6, Stack (ptr32 Eq_26613) dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg58, Stack word32 dwArg010C, Register out ptr32 s0Out, Register out ptr32 s2Out)
// Called from:
//      txu_cntrl_push
Eq_2 me_check_rc(Eq_2 ra, struct Eq_26611 * a0, Eq_2 s6, struct Eq_26613 * dwArg14, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg58, word32 dwArg010C, ptr32 & s0Out, ptr32 & s2Out)
{
	ptr32 s0_14;
	ptr32 s2_26;
	Eq_2 ra_13 = rc_check(ra, a0, s6, dwArg14, dwArg28, dwArg30, dwArg58, dwArg010C, out s0_14, out s2_26);
	s0Out = s0_14;
	s2Out = s2_26;
	return ra_13;
}

// 23007AB2: Register word32 me_update_buffer_control(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack word32 dwArg0198, Register out (ptr32 Eq_26645) a0Out, Register out (ptr32 Eq_26645) s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      me_init_rate
//      txu_cntrl_push
word32 me_update_buffer_control(Eq_2 ra, Eq_2 a0, ptr32 fflags, ptr32 frm, ptr32 mstatus, word32 dwArg0198, struct Eq_26645 & a0Out, struct Eq_26645 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	ui32 a2_21 = (word32) *((word32) a0 + 282);
	struct Eq_26645 * s3_22 = *((word32) a0 + 268);
	if (a2_21 != 0x00)
	{
		int32 s2_106 = s3_22->dw0004;
		struct Eq_26664 * s1_215 = &s3_22->dw0004 + 4;
		struct Eq_26667 * a4_25 = &s3_22->dw0004 + 4;
		int32 a5_26;
		for (a5_26 = 0x00; a5_26 != 0x10; a5_26 += 0x04)
		{
			((char *) fp - 64)[a5_26] = (char) a4_25->dw0000;
			++a4_25;
			Mem41[fp + -48 + a5_26:word32] = Mem36[a4_25 + 0x0C:int32];
		}
		if ((a2_21 & 1) != 0x00)
		{
			struct Eq_26696 * a7_46 = *((word32) a0 + 272);
			uint32 t6_47 = (word32) *((word32) a0 + 244);
			word32 t5_49 = (word32) a7_46->b00B0;
			struct Eq_26710 * a6_50 = (char *) fp - 64;
			word32 s0_107 = 0x00;
			uint32 a4_108 = 0x00;
			word32 a1_53;
			for (a1_53 = 0x00; a1_53 != 0x04; ++a1_53)
			{
				uint32 a5_76 = (word32) *((char *) (a7_46 + ((word32) (*((char *) (a7_46 + ((t5_49 + a1_53 & 0x03) + 0x0E << 3) / 177) + 16)) + 0x0C) / 177) + 0x0A) & 0x03FFFFFF | 0x80000000;
				if ((a5_76 >> 11 & 0x06) != 0x00)
				{
					uint32 a3_80 = a5_76 >> 0x03 & 0x03;
					if (a1_53 == 0x00)
					{
						if (a3_80 < t6_47)
						{
							a4_108 = a3_80;
							s0_107 = 0x01;
						}
					}
					else if (s0_107 != 0x00)
						s0_107 = (word32) (a3_80 - a4_108 < 1);
				}
				++a6_50;
				a6_50[0x03FF] = (struct Eq_26710) (a5_76 | a6_50->dw0000 & 0x1FFFC000);
			}
			s2_106 &= -0x0181;
			if (s0_107 != 0x00)
				s2_106 = s2_106 & -0x0181 | a4_108 + 0x01 << 7;
			((word32) a0 + 282)->u1 = (byte) (a2_21 | 2);
		}
		ui32 a2_122 = (word32) *((word32) a0 + 282);
		word32 * a5_123 = a2_122 & 2;
		if ((a2_122 & 2) != 0x00)
		{
			do
			{
				word32 a4_133 = *a5_123;
				if ((a5_123 >> 11 & 0x07 | a5_123 & 0x007C) != 0x00)
				{
					a5_123 = a5_123 & ~0x1FFFC000 | *((word32) a0 + 0x0114);
					*a5_123 = a4_133;
				}
			} while (fp + -48 != a4_133 + 0x04);
		}
		if ((a2_122 & 0x10) != 0x00)
		{
			int32 s5_155;
			a0_157 = a0;
			for (s5_155 = 0x00; s5_155 != 0x10; s5_155 += 0x04)
			{
				Eq_2 a0_157;
				word32 a3_529;
				word32 a5_531;
				word32 a4_530;
				word32 a1_528;
				a0_157 = tpc_get_vif_tx_power_vs_rate(ra, a0_157, fflags, frm, out a1_528, out a3_529, out a4_530, out a5_531);
				Mem176[a0_157 + 0x00:word32] = fp + -48 + s5_155;
			}
		}
		__csrrc(mstatus, 0x08);
		s3_22->dw0004 = s2_106;
		int32 a5_190;
		for (a5_190 = 0x00; a5_190 != 0x10; a5_190 += 0x04)
		{
			++s1_215;
			s1_215[0x03FF] = (struct Eq_26664) ((char *) fp - 64)[a5_190];
			Mem222[Mem217[fp + -48 + a5_190:word32] + 0x0C:word32] = s1_215;
		}
		__csrrs(mstatus, 0x08);
		((word32) a0 + 282)->u1 = 0x00;
	}
	0x00 = dwArg0198;
	a0Out = s3_22;
	s3Out = s3_22;
	s4Out = dwArgF4;
	s8Out = dwArgD4;
	return dwArg0158;
}

// 23007C34: Register Eq_2 me_init_rate(Register Eq_2 ra, Register (ptr32 Eq_8573) a0, Register Eq_2 s9, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack word32 dwArg0C, Stack (ptr32 Eq_26613) dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Stack word32 dwArg0198, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out (ptr32 Eq_26912) s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out (ptr32 Eq_26915) s8Out, Register out ptr32 s9Out)
// Called from:
//      sm_assoc_rsp_handler
//      me_sta_add_req_handler
Eq_2 me_init_rate(Eq_2 ra, struct Eq_8573 * a0, Eq_2 s9, ptr32 fflags, ptr32 frm, ptr32 mstatus, word32 dwArg0C, struct Eq_26613 * dwArg24, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArgE8, Eq_2 dwArg0118, word32 dwArg0198, ptr32 & s1Out, ptr32 & a3Out, ptr32 & a5Out, ptr32 & s3Out, ptr32 & s4Out, struct Eq_26912 & s5Out, ptr32 & s6Out, ptr32 & s7Out, struct Eq_26915 & s8Out, ptr32 & s9Out)
{
	ptr32 a3_14;
	ptr32 a5_16;
	Eq_2 s0_20;
	ptr32 s1_21;
	struct Eq_26912 * s5_27;
	ptr32 s6_28;
	ptr32 s7_29;
	ptr32 s9_31;
	Eq_2 ra_19 = rc_init(ra, a0, s9, dwLoc08, dwArg0C, dwArg24, dwArg38, dwArg68, dwArgE8, dwArg0118, out s0_20, out s1_21, out a3_14, out a5_16, out s5_27, out s6_28, out s7_29, out s9_31);
	ptr32 s3_50;
	ptr32 s4_51;
	struct Eq_26915 * s8_52;
	word32 a0_76;
	me_update_buffer_control(ra_19, s0_20, fflags, frm, mstatus, dwArg0198, out a0_76, out s3_50, out s4_51, out s8_52);
	s1Out = s1_21;
	a3Out = a3_14;
	a5Out = a5_16;
	s3Out = s3_50;
	s4Out = s4_51;
	s5Out = s5_27;
	s6Out = s6_28;
	s7Out = s7_29;
	s8Out = s8_52;
	s9Out = s9_31;
	return ra_19;
}

