pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 23007C4C: Register (ptr32 Eq_26967) me_bw_check(Register Eq_2 a0, Register (ptr32 Eq_26969) a5)
// Called from:
//      me_beacon_check
//      rxu_mgt_ind_handler
struct Eq_26967 * me_bw_check(Eq_2 a0, struct Eq_26969 * a5)
{
	struct Eq_26967 * a2_5 = a5->ptr004C;
	word32 a4_20 = (word32) a5->w0000;
	ui32 a5_10 = 0x00;
	if (a0 != 0x00)
	{
		a5_10 = (word32) g_b4201B103;
		if (a5_10 != 0x00)
		{
			ui32 a5_11 = (word32) *((word32) a0 + 3);
			a5_10 = a5_11 & 0x03;
			if ((a5_11 & 0x03) != 0x00)
			{
				word32 a3_14 = 0x0A;
				if ((a5_11 & 0x03) != 0x01)
					a3_14 = ~0x09;
				a4_20 = (word32) (word16) (a4_20 + a3_14);
				a5_10 = 0x01;
			}
		}
	}
	a2_5->b0082 = (byte) a5_10;
	a2_5->b0083 = (byte) a5_10;
	a2_5->w0050 = (word16) a4_20;
	a2_5->w0052 = 0x00;
	return a2_5;
}

// 23007C8C: Register Eq_2 me_beacon_check(Register Eq_2 ra, Register (ptr32 Eq_13564) a0, Register word32 a1, Register Eq_2 a2, Register Eq_2 s2, Register ui32 s8, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg68, Stack Eq_2 dwArg0198, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 byte) s3Out, Register out Eq_13577 s4Out, Register out (ptr32 Eq_13578) s5Out, Register out Eq_2 s6Out, Register out Eq_13580 s7Out)
// Called from:
//      mm_bcn_change
//      rxu_mgt_frame_check
Eq_2 me_beacon_check(Eq_2 ra, struct Eq_13564 * a0, word32 a1, Eq_2 a2, Eq_2 s2, ui32 s8, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg68, Eq_2 dwArg0198, union Eq_2 & a3Out, union Eq_2 & a4Out, byte & s3Out, union Eq_13577 & s4Out, struct Eq_13578 & s5Out, union Eq_2 & s6Out, union Eq_13580 & s7Out)
{
	struct Eq_27024 * a5_30 = a0->ptr4201AD8C;
	a0->w4201ADC0 = 0x00;
	byte bLoc33_364 = SLICE(s8, byte, 8);
	uint32 s3_35 = a1 + -36 << 0x10;
	if ((word32) a5_30->b0002 == 0x00)
	{
		word32 a5_533;
		Eq_2 a0_48 = mac_ie_find((word32) a2 + 36, s3_35 >> 0x10, 42, out a5_533);
		if (a0_48 != 0x00)
		{
			uint32 a5_52 = ((word32) a0->w4201ADC0 & ~0x07) << 16;
			ui32 a4_50 = (word32) *((word32) a0_48 + 2);
			uint32 a5_54 = a5_52 >> 16;
			if ((a4_50 & 1) != 0x00)
				a5_54 = a5_52 >> 16 | 1;
			a0->w4201ADC0 = (word16) a5_54;
			if ((a4_50 & 2) != 0x00)
				a0->w4201ADC0 = (word16) ((word32) a0->w4201ADC0 | 2);
			if ((a4_50 & 0x04) != 0x00)
				a0->w4201ADC0 = (word16) ((word32) a0->w4201ADC0 | 4);
		}
	}
	struct Eq_26969 * a5_106 = (word32) g_b4201B002;
	Eq_2 a0_107 = 0x00;
	if (a5_106 != null)
		a0_107 = mac_ie_find((word32) a2 + 36, s3_35 >> 0x10, 61, out a5_106);
	me_bw_check(a0_107, a5_106);
	Eq_2 a3_114 = &a0->w4201ADC0 + 0x00F8;
	ui32 a0_125;
	struct Eq_13578 * s5_134;
	Eq_2 s6_140;
	struct Eq_27113 * s8_135;
	Eq_2 s4_133;
	Eq_2 s1_131;
	ptr32 s2_132;
	byte * s3_139;
	Eq_2 s0_130 = me_extract_csa((word32) a2 + 36, s3_35 >> 0x10, fp + -0x0033, &a0->w4201ADC0 + 0x00F8, dwArg68, out s1_131, out a0_125, out s2_132, out s3_139, out s4_133, out s5_134, out s6_140, out s8_135);
	if ((a0_125 & 0x00FF) != 0x00)
	{
		struct Eq_27181 * a5_144 = (word32) s0_130 + (s2_132 + 0x05D8);
		word32 a4_145 = (word32) a5_144->b0056;
		if (a4_145 == 0x00)
		{
			if ((word32) a5_144->b0079 == 0x00)
			{
				a3_114 = (word32) bLoc33_364;
				if (a3_114 == 0x01)
					ra = mm_send_csa_traffic_ind(ra, 0x01, mstatus, dwLoc38, out s0_130, out s1_131, out a3_114, out s2_132, out s3_139, out s4_133, out s8_135);
			}
			(word32) s0_130 + (s2_132 + 0x05D8) + 121 = (ptr32) (byte) (a0_125 & 0x00FF);
		}
		else
		{
			a3_114.u0 = 0x02;
			if (a4_145 == 0x02)
				a5_144->b0347 = (byte) (a0_125 & 0x00FF);
		}
	}
	me_extract_power_constraint(s4_133, s3_139, s8_135);
	Eq_2 a4_206 = (word32) ((word32) s0_130 + (s2_132 + 0x05D8) + 988);
	if (a4_206 != s6_140)
	{
		word32 s1_534;
		s0_130 = tpc_update_vif_tx_power(ra, s1_131, fp + -50, fp + -49, a3_114, fflags, frm, out s1_534, out a3_114, out a4_206, out s2_132, out s3_139);
	}
	if (s5_134 < (word32) (((word32) s0_130 + (s2_132 + 0x05D8)) + 987))
	{
		Eq_2 a0_274;
		struct Eq_27258 * s1_283;
		struct Eq_27259 * s4_286;
		word32 a1_536;
		word32 a2_537;
		word32 a5_540;
		word32 a3_538;
		word32 a4_539;
		word32 s0_535;
		word32 s8_544;
		word32 s3_543;
		word32 a6_541;
		word32 s2_542;
		ra = ke_msg_alloc(ra, 59, 0x00, 0x0C, a4_206, mstatus, s2, out s0_535, out s1_283, out a0_274, out a1_536, out a2_537, out a3_538, out a4_539, out a5_540, out a6_541, out s2_542, out s3_543, out s4_286, out s8_544);
		if (s4_286->dw0040 == 0x00)
			assert_err();
		a0_274->u1 = (byte) (word32) *(byte *) 1519;
		*((word32) a0_274 + 1) = (byte) (word32) s1_283->ptr03A4->b0002;
		*((word32) a0_274 + 2) = (byte) (word32) s1_283->b03DB;
		*((word32) a0_274 + 4) = (word16) (word32) s1_283->ptr03A4->w0000;
		*((word32) a0_274 + 6) = (word16) (word32) s1_283->w03A8;
		struct Eq_27338 * a5_315 = (word32) s1_283->w03AA;
		*((word32) a0_274 + 8) = (word16) a5_315;
		*((word32) a0_274 + 0x0A) = (byte) (int32) a5_315->b000C;
		word32 s8_552;
		word32 a2_548;
		word32 a5_549;
		word32 s2_550;
		word32 s4_551;
		word32 s1_545;
		word32 a1_547;
		word32 a0_546;
		ke_msg_send(a0_274, mstatus, out s1_545, out a0_546, out a1_547, out a2_548, out a3_114, out a4_206, out a5_549, out s2_550, out s3_139, out s4_551, out s8_552);
	}
	0x00 = (uint16) dwArg0198;
	a3Out = a3_114;
	a4Out = a4_206;
	s3Out = s3_139;
	s4Out = dwArgF4;
	s5Out = s5_134;
	s6Out = s6_140;
	s7Out = a0_125 & 0x00FF;
	return ra;
}

// 23007EAE: Register word32 me_sta_bw_nss_max_upd(Register (ptr32 Eq_27384) a0, Register Eq_2 a1, Register Eq_27386 a2, Stack Eq_2 dwArgB8, Register out ptr32 s1Out, Register out Eq_27389 a1Out, Register out (ptr32 Eq_27390) a4Out, Register out (ptr32 Eq_27391) a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out (ptr32 Eq_27394) s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out)
// Called from:
//      rxu_mgt_frame_check
//      me_sta_add_req_handler
word32 me_sta_bw_nss_max_upd(struct Eq_27384 * a0, Eq_2 a1, Eq_27386 a2, Eq_2 dwArgB8, ptr32 & s1Out, union Eq_27389 & a1Out, struct Eq_27390 & a4Out, struct Eq_27391 & a5Out, ptr32 & s3Out, ptr32 & s4Out, struct Eq_27394 & s5Out, ptr32 & s6Out, ptr32 & s7Out)
{
	struct Eq_27397 * s3_24 = (word32) a0->b420190EA;
	if ((word32) g_b4201B002 != 0x00)
	{
		Eq_27386 a0_42 = me_11n_nss_max(&a0->b420190EB + 0x00A8);
		Eq_27386 a0_48 = me_11n_nss_max(&g_t4201AFE3);
		if (a0_42 < a0_48)
			a0_48 = a0_42;
		if (a2 < a0_48)
			a0_48 = a2;
		uint32 a2_60 = a0_48 & 0x00FF;
		Eq_2 a4_66 = (word32) a0->b420191C0;
		if (a4_66 == 0x04)
			a4_66.u0 = 0x03;
		Eq_2 a1_78 = (word32) s3_24->b4201ADC2;
		if (a1 < a1_78)
			a1_78 = a1;
		if (a4_66 < a1_78)
			a1_78 = a4_66;
		Eq_27439 a1_93 = a1_78 & 0x00FF;
		struct Eq_27442 * a0_100 = (word32) a0->b420190EB;
		a0->b420191C1 = (byte) a1_93;
		struct Eq_27390 * a4_112;
		struct Eq_27452 * s0_115;
		ptr32 s1_116;
		ptr32 s3_118;
		Eq_27389 a1_123;
		struct Eq_27394 * s5_127;
		ptr32 s6_128;
		ptr32 s7_129;
		word32 ra_114 = rc_update_bw_nss_max(a0_100, a1_93, a2_60, dwArgB8, out s0_115, out s1_116, out a1_123, out a4_112, out s3_118, out s5_127, out s6_128, out s7_129);
		ui32 a5_132 = (word32) s0_115->b011A;
		s0_115->b011A = (byte) (a5_132 | 8);
		s1Out = s1_116;
		a1Out = a1_123;
		a4Out = a4_112;
		a5Out = a5_132 | 8;
		s3Out = s3_118;
		s4Out = dwArg04;
		s5Out = s5_127;
		s6Out = s6_128;
		s7Out = s7_129;
		return ra_114;
	}
	else
		assert_err();
}

// 23007FA0: Register Eq_2 me_add_chan_ctx(Register (ptr32 byte) a0, Register Eq_2 a4, Stack Eq_2 dwArg88, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s6Out)
// Called from:
//      apm_start_req_handler
Eq_2 me_add_chan_ctx(byte * a0, Eq_2 a4, Eq_2 dwArg88, ptr32 & a0Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s6Out)
{
	ptr32 a0_22;
	ptr32 s2_29;
	ptr32 s3_30;
	ptr32 s6_33;
	word32 s1_52;
	word32 a4_53;
	word32 s5_54;
	Eq_2 s0_27 = chan_ctxt_add(fp + ~0x1B, a0, a4, dwArg88, out s1_52, out a0_22, out a4_53, out s2_29, out s3_30, out s5_54, out s6_33);
	a0Out = a0_22;
	s2Out = s2_29;
	s3Out = s3_30;
	s6Out = s6_33;
	return s0_27;
}

// 23007FD6: Register Eq_27524 rc_get_nss(Register Eq_27524 a0, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      me_check_rc
//      rc_set_next_mcs_index
//      rc_get_duration
//      rc_check_fixed_rate_config
Eq_27524 rc_get_nss(Eq_27524 a0, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	if ((a0 >> 11 & 0x07) > ~0x02)
	{
		a4Out.u0 = <invalid>;
		a5Out.u0 = <invalid>;
		return 0x00;
	}
	else
	{
		a4Out.u0 = <invalid>;
		a5Out.u0 = <invalid>;
		return a0 >> 3 & 0x03;
	}
}

// 23007FEE: Register Eq_27524 rc_get_mcs_index(Register Eq_27524 a0, Register out ptr32 a3Out, Register out Eq_27524 a4Out, Register out Eq_27541 a5Out)
// Called from:
//      rc_set_previous_mcs_index
//      rc_set_next_mcs_index
//      is_cck_group
//      rc_get_duration
//      rc_check_fixed_rate_config
Eq_27524 rc_get_mcs_index(Eq_27524 a0, ptr32 & a3Out, union Eq_27524 & a4Out, union Eq_27541 & a5Out)
{
	Eq_27524 a4_10;
	Eq_27541 a5_5 = a0 >> 11 & 0x07;
	if (a5_5 > 0x01)
	{
		a3 = 0x03;
		a4_10.u0 = 0x00;
		if (a5_5 <= 0x03)
			a4_10 = a0 & 7;
	}
	else
		a4_10 = a0 & 0x007F;
	a3Out = a3;
	a4Out = a4_10;
	a5Out = a5_5;
	return a4_10;
}

// 23008010: void rc_set_previous_mcs_index(Register (ptr32 Eq_27559) a0, Register Eq_27524 a1)
void rc_set_previous_mcs_index(struct Eq_27559 * a0, Eq_27524 a1)
{
	word32 a5_64;
	word32 a4_63;
	word32 a3_62;
	struct Eq_27564 * a0_16 = rc_get_mcs_index(a1, out a3_62, out a4_63, out a5_64);
	uint32 s0_20 = a1 >> 11 & 0x07;
	if (s0_20 > 0x01)
	{
		if (s0_20 <= 0x03 && a0_16 != null)
			(word32) a0->b00BD == 0x00;
	}
	else
		(word32) a0->b00B9 >= a0_16;
}

// 2300806E: void rc_set_next_mcs_index(Register (ptr32 Eq_27593) a0, Register Eq_27524 a1)
void rc_set_next_mcs_index(struct Eq_27593 * a0, Eq_27524 a1)
{
	word32 a4_85;
	word32 a5_86;
	word32 a3_84;
	struct Eq_27564 * a0_20 = rc_get_mcs_index(a1, out a3_84, out a4_85, out a5_86);
	uint32 s3_24 = a1 >> 11 & 7;
	if (s3_24 > 0x01)
	{
		if (s3_24 <= 0x03 && a0_20 < (word32) a0->b00B8)
		{
			word32 a4_87;
			word32 a5_88;
			if ((CONVERT(Mem17[rc_get_nss(a1, out a4_87, out a5_88) + a0 + 0x00B2:byte], byte, word32) >>u a0_20 + 0x01 & 0x01) != 0x00)
				(word32) a0->b00BD == 0x00;
		}
	}
	else if (a0_20 < (word32) a0->b00BA)
		((word32) a0->w00B6 >> (char *) (&a0_20->ptr0000) + 1 & 0x01) == 0x00;
}

// 230080FE: Register Eq_27524 is_cck_group(Register Eq_27524 a0, Register out (ptr32 Eq_27660) a5Out)
// Called from:
//      rc_update_retry_chain
//      rc_calc_tp
Eq_27524 is_cck_group(Eq_27524 a0, struct Eq_27660 & a5Out)
{
	struct Eq_27660 * a5_5 = a0 >> 11 & 0x06;
	if (a5_5 != null)
	{
		a5Out = a5_5;
		return 0x00;
	}
	else
	{
		struct Eq_27660 * a5_12;
		word32 a3_29;
		word32 a4_30;
		Eq_27524 a0_15 = (word32) (rc_get_mcs_index(a0, out a3_29, out a4_30, out a5_12) < (struct Eq_27564 *) 4);
		a5Out = a5_12;
		return a0_15;
	}
}

// 2300811C: Register word32 rc_update_retry_chain(Register (ptr32 Eq_27682) a0, Register (arr Eq_27881) a1, Register (ptr32 Eq_27684) a3, Stack Eq_2 dwArg0128, Register out Eq_27686 s1Out, Register out (ptr32 Eq_27687) a1Out, Register out Eq_27688 a4Out, Register out (ptr32 Eq_27689) s2Out, Register out ptr32 s4Out, Register out (ptr32 (arr Eq_27881)) s5Out, Register out Eq_27692 s7Out)
// Called from:
//      rc_update_bw_nss_max
//      rc_update_stats
word32 rc_update_retry_chain(struct Eq_27682 * a0, Eq_27881 a1[], struct Eq_27684 * a3, Eq_2 dwArg0128, union Eq_27686 & s1Out, struct Eq_27687 & a1Out, union Eq_27688 & a4Out, struct Eq_27689 & s2Out, ptr32 & s4Out, Eq_27881 (& s5Out, union Eq_27692 & s7Out)
{
	Eq_27686 s1_100;
	Eq_27686 s4_27 = (word32) a0->w00C0;
	ui32 a4_28 = (word32) a0->b00AF;
	struct Eq_27722 ** a5_35 = a1 + ((s4_27 << 0x02) + ~0x03) / 4;
	if ((a4_28 & 0x04) == 0x00)
	{
		a5_35 = (struct Eq_27722 **) *(a4_28 & 0x04);
		if ((a4_28 & 0x04) < a3)
		{
			a0->w0080 = 0x00;
			a0->dw007C = 0x00;
			s1_100.u0 = 0x01;
l2300815E:
			Eq_27692 s7_52 = (word32) a0->w0080;
			struct Eq_27689 * s2_55 = a0 + ((word32) s7_52 + 0x0C) / 0x00C2;
			struct Eq_27687 * a5_58;
			if (is_cck_group((word32) s2_55->w000A, out a5_58) == 0x00)
			{
				Eq_27759 s3_64 = 0x00;
				while (s3_64 < (word32) s4_27 - 1)
				{
					struct Eq_27761 * s6_71 = a0 + ((word32) s3_64.u0 + 0x0C) / 0x00C2;
					word32 a5_478;
					if (is_cck_group((word32) s6_71->w000A, out a5_478) != 0x00)
						s6_71->b000F = 0x00;
					s3_64 = (word32) (word16) ((word32) s3_64.u0 + 1);
				}
				s2_55->b000F = 0x01;
				a5_58 = (struct Eq_27687 *) 0x01;
			}
			struct Eq_27742 * s0_90 = a5_58->ptr007C;
			s0_90->w0088 = (word16) s7_52;
			s0_90->ptr0084 = a5_58;
			ui32 a4_102 = s4_27 - s1_100;
			struct Eq_27687 * a1_104 = (struct Eq_27687 *) 0x0C;
			while (true)
			{
				ui32 a5_106 = (word32) s1_100 + 1;
				if (s1_100 >= s4_27)
					break;
				ui32 a2_111 = a4_102 + -1;
				if ((word32) *((char *) (s0_90 + (a2_111 + 0x0C) / 0x009A) + 27) != 0x00)
				{
					s1_100 = s4_27 - s1_100;
					s0_90->w0088 = (word16) s1_100;
					s0_90->ptr0084 = (struct Eq_27687 *) a1[a4_102];
					break;
				}
				a4_102 = a2_111;
				s1_100 = (word32) (word16) a5_106;
			}
			Eq_27688 t1_134 = (word32) s0_90->w0088;
			Eq_27688 a5_137 = s4_27 - (word32) ((word16) a5_106);
			while ((word32) (word16) (s4_27 - a5_137) < s4_27)
			{
				Eq_27688 a3_144 = (word32) a5_137 - 1;
				if ((word32) *((char *) (s0_90 + ((word32) a3_144 + 0x0C) / 0x009A) + 27) != 0x00)
					goto l230081DC;
				a5_137 = a3_144;
			}
			a5_137 = t1_134;
l230081DC:
			struct Eq_27859 * a3_165 = (char *) s0_90 + 8;
			up32 a0_168 = (word32) *((char *) (s0_90 + ((word32) a5_137 + 0x0C) / 0x009A) + 8);
			Eq_27688 a4_169 = 0x00;
			while (true)
			{
				uint32 a2_171 = a4_169 << 0x10;
				if (a2_171 >> 16 >= t1_134)
					break;
				if ((word32) a3_165->b0007 != 0x00 && a2_171 >> 16 != s7_52)
				{
					up32 a2_178 = (word32) a3_165->w0000;
					if (a2_178 > 0x0F000332)
					{
						struct Eq_27687 * a7_188 = a1[a4_169];
						if (a7_188 < a1_104)
							goto l230082AA;
						a1_104 = a7_188;
						goto l230082A8;
					}
					if (a2_178 >= a0_168)
					{
l230082A8:
						a0_168 = a2_178;
						a5_137 = a4_169;
					}
				}
l230082AA:
				a4_169 = (word32) a4_169 + 1;
				++a3_165;
			}
			s0_90->w0090 = (word16) a5_137;
			struct Eq_27687 * a5_206 = a1[a5_137];
			s0_90->w0098 = 0x00;
			s0_90->ptr008C = a5_206;
			Eq_27881 a5_222 = a1[0];
			0x00 = (uint16) dwArg0128;
			s0_90->t0094 = a5_222;
			s1Out = s1_100;
			a1Out = a1_104;
			a4Out = a4_169;
			s2Out = s2_55;
			s4Out = dwArg78;
			s5Out = a1;
			s7Out = s7_52;
			return s4;
		}
	}
	a0->w0080 = (word16) ((word32) s4_27 - 1);
	*((char *) *a5_35 + 0x007C) = (struct Eq_27722 **) a0;
	s1_100.u0 = 0x02;
	goto l2300815E;
}

// 230082C0: Register Eq_2 rc_get_lowest_rate_config(Register Eq_2 a0)
// Called from:
//      rc_update_bw_nss_max
//      rc_init
Eq_2 rc_get_lowest_rate_config(Eq_2 a0)
{
	Eq_2 a5_11;
	uint32 a5_15;
	uint32 a4_5 = (word32) *((word32) a0 + 177);
	if (a4_5 > 0x01)
	{
		a5_11.u0 = 0x00;
		if (a4_5 > 0x03)
			return a5_11;
		a5_11.u0 = 0x0400;
		if ((word32) *((word32) a0 + 0x00B9) == 0x00)
			return a5_11;
		a5_15 = a4_5 << 0x1B;
	}
	else
	{
		ui32 a4_7 = (word32) *((word32) a0 + 0x00B9);
		a5_11.u0 = 0x0400;
		if (a4_7 == 0x00)
			return a5_11;
		a5_15 = a4_7 << 0x10;
	}
	a5_11 = a5_15 >> 16;
	return a5_11;
}

// 230082F8: Register word32 rc_sort_samples_tp(Register Eq_2 a0, Register (ptr32 Eq_27684) a3, Register (ptr32 Eq_27684) a4, Stack Eq_2 dwArg0128, Register out ptr32 s3Out, Register out ptr32 s6Out)
// Called from:
//      rc_update_bw_nss_max
//      rc_update_stats
word32 rc_sort_samples_tp(Eq_2 a0, struct Eq_27684 * a3, struct Eq_27684 * a4, Eq_2 dwArg0128, ptr32 & s3Out, ptr32 & s6Out)
{
	up32 a5_21 = (word32) *((word32) a0 + 0x00C0);
	up32 s4_27 = (word32) (word16) (a5_21 + -1);
	while (a5_21 != 0x00)
	{
		Eq_2 s2_40 = (word32) a0 + 16;
		a5_21 = 0x00;
		up32 s1_44 = 0x01;
		while (s1_44 < s4_27)
		{
			Eq_2 s5_53 = (word32) s2_40 + 0x0C;
			if (a4 < a3)
			{
				word32 a3_157;
				word32 a4_158;
				word32 a5_159;
				memmove(fp + -44, s2_40, (struct Eq_28011 *) 0x0C, out a3_157, out a4_158, out a5_159);
				word32 a3_160;
				word32 a4_161;
				word32 a5_162;
				memmove(s2_40, s5_53, (struct Eq_28011 *) 0x0C, out a3_160, out a4_161, out a5_162);
				struct Eq_28032 * a5_75;
				memmove(s5_53, fp + -44, (struct Eq_28011 *) 0x0C, out a3, out a4, out a5_75);
				word32 s0_77 = a4[1];
				a5_75->dw0004 = s0_77;
				a4->dw0000 = s0_77;
				a5_21 = s1_44;
			}
			s1_44 = (word32) (word16) (s1_44 + 0x01);
			s2_40 = s5_53;
		}
		s4_27 = a5_21;
	}
	0x00 = (uint16) dwArg0128;
	s3Out = (word32) a0 + 16;
	s6Out = a1;
	return dwArgE4;
}

// 23008386: Register Eq_2 rc_get_initial_rate_config(Register Eq_2 a0, Stack word32 dwArg38)
// Called from:
//      rc_update_bw_nss_max
//      rc_init
Eq_2 rc_get_initial_rate_config(Eq_2 a0, word32 dwArg38)
{
	Eq_2 a5_21;
	ui32 a0_16;
	ui32 a5_19;
	uint32 s1_13 = (word32) *((word32) a0 + 177);
	if (s1_13 > 0x01)
	{
		a5_21.u0 = 0x00;
		if (s1_13 > 0x03)
			goto l230083EE;
		int32 s2_22 = (word32) *((word32) a0 + 188);
		word32 a4_77;
		Eq_2 a0_28 = __clzsi2((word32) ((word32) a0 + s2_22 + 0x00B2), out a4_77);
		a5_19 = (word32) *((word32) a0 + 0x00BD) << 9 | s1_13 << 11 | (word32) (*((word32) a0 + 0x00BB)) << 7 | s2_22 << 3;
		a0_16 = 0x1F - a0_28 & 0x00FF;
	}
	else
	{
		a0_16 = (word32) *((word32) a0 + 0x00BA);
		a5_19 = s1_13 << 11 | (word32) (*((word32) a0 + 0x00BE)) << 0x0A;
	}
	a5_21 = (word32) (word16) (a5_19 | a0_16);
l230083EE:
	0x00 = dwArg38;
	return a5_21;
}

// 230083FC: void rc_calc_prob_ewma(Register (ptr32 Eq_28121) a0)
// Called from:
//      rc_update_stats
void rc_calc_prob_ewma(struct Eq_28121 * a0)
{
	uint32 a3_5 = (word32) a0->w0000;
	if (a3_5 == 0x00)
	{
		int32 a5_6 = (word32) a0->b0008;
		if (a5_6 != 0x00FF)
			a0->b0008 = (byte) (a5_6 + 0x01);
	}
	else
	{
		ui32 a5_10 = (word32) a0->w0002;
		word32 a2_11 = (word32) a0->b0009;
		a0->b0008 = 0x00;
		uint32 a4_14 = a5_10 << 16 >> a3_5;
		if (a2_11 == 0x00)
		{
			if (a5_10 << 16 >= a3_5)
				a0->w0004 = (word16) (a4_14 + ~0x00);
			else
				a0->w0004 = 0x00;
		}
		else
			a0->w0004 = (word16) ((word32) a0->w0004 + 96 + (a4_14 << 5) >> 7);
		a0->b0009 = 0x01;
	}
}

// 2300845A: Register (ptr32 Eq_28193) rc_check_valid_rate(Register (ptr32 Eq_28193) a0, Register Eq_27524 a1, Register out Eq_28196 a0Out)
// Called from:
//      rc_check_fixed_rate_config
struct Eq_28193 * rc_check_valid_rate(struct Eq_28193 * a0, Eq_27524 a1, union Eq_28196 & a0Out)
{
	Eq_28196 a0_23;
	struct Eq_27564 * a0_17;
	uint32 a5_21;
	uint32 a5_12 = a1 >> 11 & 0x07;
	struct Eq_28193 * s0_15 = a0;
	if (a5_12 > 0x01)
	{
		a0_23.u0 = 0x01;
		if (a5_12 > 0x03)
			goto l230084A2;
		word32 a4_79;
		word32 a5_80;
		s0_15 = a0 + rc_get_nss(a1, out a4_79, out a5_80);
		word32 a3_81;
		word32 a4_82;
		word32 a5_83;
		a0_17 = rc_get_mcs_index(a1, out a3_81, out a4_82, out a5_83);
		a5_21 = (word32) s0_15->b00B2;
	}
	else
	{
		word32 a3_84;
		word32 a4_85;
		word32 a5_86;
		a0_17 = rc_get_mcs_index(a1, out a3_84, out a4_85, out a5_86);
		a5_21 = (word32) a0->w00B6;
	}
	a0_23 = a5_21 >> a0_17 & 0x01;
l230084A2:
	a0Out = a0_23;
	return s0_15;
}

