pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 230084AC: Register Eq_2 rc_new_random_rate(Register Eq_2 a0, Register (ptr32 Eq_28246) a5, Register out Eq_28247 a1Out)
// Called from:
//      rc_update_bw_nss_max
//      rc_update_stats
//      rc_init
Eq_2 rc_new_random_rate(Eq_2 a0, struct Eq_28246 * a5, union Eq_28247 & a1Out)
{
	Eq_28247 a1_109 = (word32) *((word32) a0 + 0x00BB);
	uint32 a3_16 = (word32) *((word32) a0 + 177);
	a5->dw44C64EA6 = a5->dw0000;
	ui32 a7_14 = 0x00;
	Eq_28266 a5_18 = &a5->dw44C64EA6 >> 16;
	Eq_2 a4_108 = a3_16 << 0x1B >> 16;
	if (a1_109 != 0x00)
		a7_14 = (word32) a1_109 - 1 & 0x00FF;
	ui32 a4_129;
	if (a3_16 <= 0x01)
	{
		word32 a2_28 = (word32) *((word32) a0 + 0x00B9);
		ui32 a6_29 = (word32) *((word32) a0 + 0x00BA);
		word32 a1_32 = a6_29 - a2_28;
		ui32 a3_35 = (a5_18 & 0x007F | a1_32 + 0x01) + a2_28;
		a1_109 = a1_32 + 0x01;
		ui32 a3_37 = a3_35 & 0x00FF;
		if (((word32) *((word32) a0 + 0x00B6) >> (a3_35 & 0x00FF) & 0x01) == 0x00)
			a3_37 = a6_29;
		a4_108 |= a3_37;
		if (a3_37 == 0x00)
			a4_129 = a4_108 | 0x0400;
		else
		{
			if ((a3_37 + ~0x00 & 0x00FF) > 0x02)
				goto l23008578;
			a4_129 = a4_108 | (a5_18 & 0x0400 | (word32) (*((word32) a0 + 0x00BE)) << 0x0A);
		}
l23008574:
		a4_108 = (word32) (word16) a4_129;
		goto l23008578;
	}
	else
	{
		if (a3_16 > 0x03)
			goto l23008578;
		up32 a2_58 = (word32) *((word32) a0 + 0x00B9);
		if (a2_58 <= 0x03 && a5_18 << 0x14 < 0x00)
		{
			a1_109 = (word32) *((word32) a0 + 0x00BA);
			ui32 a3_115 = (a5_18 & 0x007F | (a1_109 - a2_58) + 0x01) + a2_58;
			Eq_28247 a3_116 = a3_115 & 0x00FF;
			if (((word32) *((word32) a0 + 0x00B6) >> (a3_115 & 0x00FF) & 0x01) == 0x00)
				a3_116 = a1_109;
			a4_108.u0 = 0x0400;
			if (a3_116 != 0x00)
			{
				a4_129 = (word32) *((word32) a0 + 0x00BE) << 0x0A | a5_18 & 0x0400 | a3_116;
				goto l23008574;
			}
		}
		else
		{
			ui32 a6_107 = (word32) *((word32) a0 + 0x00B8);
			int32 a3_68 = a5_18 >> 0x03 & 0x03 | (word32) (*((word32) a0 + 188)) + 0x01;
			ui32 a2_72 = a5_18 & 7 | a6_107 + 1;
			word32 t3_71 = (word32) *((word32) a0 + 0x00BD);
			if (((word32) ((word32) a0 + a3_68 + 0x00B2) >> a2_72 & 1) != 0x00)
				a6_107 = a2_72 & 0x00FF;
			word32 a1_90 = a1_109 - a7_14;
			a1_109 = a1_90 + 0x01;
			a4_108 = (word32) (word16) (a4_108 | ((a5_18 >> 0x09 & 0x01 | t3_71 + 0x01) << 9 | a3_68 << 3) | (a5_18 >> 7 & 0x03 | a1_90 + 0x01) + a7_14 << 7) | a6_107;
		}
l23008578:
		a1Out = a1_109;
		return a4_108;
	}
}

// 23008604: Register uint32 rc_update_counters(Register (ptr32 Eq_26562) a0, Register ui32 a1, Register uint32 a2, Stack word32 dwArg1C, Stack word32 dwArg0128)
// Called from:
//      me_tx_cfm_singleton
uint32 rc_update_counters(struct Eq_26562 * a0, ui32 a1, uint32 a2, word32 dwArg1C, word32 dwArg0128)
{
	if (a0 > (struct Eq_26562 *) 0x09)
		return 0x09;
	uint32 a5_104 = (char *) a0 + 0x420190D0;
	if ((word32) a0->b420190EA != 0x00FF)
	{
		struct Eq_28473 * s0_39 = a0->ptr420191E0;
		ui32 s1_142 = a1;
		uint32 s4_145 = a2;
		if (s0_39 == null)
			assert_err();
		s0_39->w00A6 = (word16) ((word32) s0_39->w00A6 + 0x01);
		s0_39->w00A4 = (word16) ((word32) s0_39->w00A4 + 0x01);
		struct Eq_28503 * s5_50 = (char *) s0_39 + 0x0080;
		while (s1_142 != 0x00)
		{
			struct Eq_28508 * a5_68 = s0_39 + ((word32) s5_50->w0000 + 0x0C) / 0x00AF;
			word32 a4_69 = (word32) a5_68->w0004;
			if (s4_145 > 0x03)
			{
				a5_68->w0004 = (word16) (a4_69 + 0x04);
				s1_142 += ~0x03;
				s4_145 += ~0x03;
			}
			else
			{
				uint32 s1_72 = s1_142 << 16;
				a5_68->w0004 = (word16) (a4_69 + (s1_72 >> 16));
				a5_68->w0006 = (word16) ((s1_72 >> 16) - s4_145 + (word32) a5_68->w0006);
				s4_145 = 0x00;
				s1_142 = 0x00;
			}
			if ((word32) a5_68->w0004 < (word32) a5_68->w0006)
				assert_err();
			++s5_50;
			if (s5_50 == (char *) s0_39 + 0x00A0)
				break;
		}
		a5_104 = (word32) s0_39->b00AE;
		if (a5_104 != 0x00)
		{
			if (a5_104 != 0x02)
				goto l2300871E;
			ui32 a5_119 = (word32) a0->b420191EA;
			a5_104 = a5_119 & 0x01;
			if ((a5_119 & 0x01) == 0x00)
			{
				a5_104 = 0x03;
				goto l2300873C;
			}
		}
		else
		{
			word32 a5_105 = (word32) s0_39->b00AC;
			if (a5_105 == 0x00)
			{
				a5_104 = 0x01;
l2300873C:
				s0_39->b00AE = (byte) a5_104;
				goto l2300871E;
			}
			s0_39->b00AC = (byte) (a5_105 + ~0x00);
			a5_104 = a5_105 + ~0x00;
		}
	}
l2300871E:
	0x00 = dwArg0128;
	0x00 = dwArg1C;
	return a5_104;
}

// 23008744: Register (ptr32 Eq_27564) rc_get_duration(Register Eq_27524 a0, Stack Eq_2 dwArg38, Register out (ptr32 Eq_27564) a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_28620) s2Out)
// Called from:
//      me_check_rc
//      rc_calc_tp
struct Eq_27564 * rc_get_duration(Eq_27524 a0, Eq_2 dwArg38, struct Eq_27564 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, struct Eq_28620 & s2Out)
{
	ptr32 a5_26;
	ptr32 a3_18;
	word32 a5_83;
	ptr32 a4_16;
	struct Eq_27564 * a0_15 = rc_get_mcs_index(a0, out a3_18, out a4_16, out a5_83);
	struct Eq_28620 * s2_19 = a0 >> 11 & 7;
	struct Eq_27564 * s1_21 = a0_15;
	if (s2_19 > (struct Eq_28620 *) 0x01)
	{
		a5_26 = 0x03;
		a0_15 = null;
		if (s2_19 <= (struct Eq_28620 *) 0x03)
		{
			word32 a5_84;
			struct Eq_27564 ** a0_39 = rc_get_nss(a0, out a4_16, out a5_84);
			a5_26 = (char *) a0_39 + 1;
			s1_21 = (struct Eq_27564 *) *a0_39;
			a0_15 = a0_39 >> (char *) a0_39 + 1;
		}
	}
	else if (a0_15 <= (struct Eq_27564 *) 0x03)
	{
		s1_21 = a0_15 << 0x01;
		a5_26 = 587681076;
	}
	else
	{
		a5_26 = 587681428;
		s1_21 = a0_15->ptr0000;
	}
	0x00 = (uint16) dwArg38;
	a0Out = a0_15;
	a3Out = a3_18;
	a4Out = a4_16;
	a5Out = a5_26;
	s2Out = s2_19;
	return s1_21;
}

// 230087D8: Register word32 rc_update_bw_nss_max(Register (ptr32 Eq_27442) a0, Register Eq_27439 a1, Register uint32 a2, Stack Eq_2 dwArgD8, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out Eq_27439 a1Out, Register out ptr32 a4Out, Register out (ptr32 Eq_27442) s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out)
// Called from:
//      me_sta_bw_nss_max_upd
//      me_rc_set_rate_req_handler
word32 rc_update_bw_nss_max(struct Eq_27442 * a0, Eq_27439 a1, uint32 a2, Eq_2 dwArgD8, union Eq_2 & s0Out, ptr32 & s1Out, union Eq_27439 & a1Out, ptr32 & a4Out, struct Eq_27442 & s3Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out)
{
	struct Eq_27442 * s3_157 = a0;
	ptr32 a4_169 = (char *) a0 + 432;
	Eq_2 s0_173 = a0->t420191E0;
	if (s0_173 != 0x00)
	{
		if ((word32) *((word32) s0_173 + 0x00BB) != a1 || (word32) (*((word32) s0_173 + 188)) != a2)
		{
			((word32) s0_173 + 0x00BB)->u1 = (byte) a1;
			if (a1 > 0x03)
				assert_err();
			((word32) s0_173 + 188)->u1 = (byte) a2;
			if (a2 > 0x07)
				assert_err();
			a4_169 = (word32) *((word32) s0_173 + 0x00C6);
			if (a4_169 == 0x0FFFFFFF)
			{
				*((word32) s0_173 + 0x0A) = (word16) rc_get_lowest_rate_config(s0_173);
				(word32) s0_173 + ((word32) (*((word32) s0_173 + 0x00C0)) + 11) + 0x0A = (word32) (word16) rc_get_initial_rate_config(s0_173, dwLoc18);
				int32 s1_120 = 0x01;
				while (true)
				{
					struct Eq_27684 * a2_84 = (word32) *((word32) s0_173 + 0x00C0);
					struct Eq_28246 * a5_103 = (char *) a2_84 - 1;
					if (s1_120 >= (char *) a2_84 - 1)
						break;
l230088FE:
					word32 a1_295;
					word32 a0_90 = rc_new_random_rate(s0_173, a5_103, out a1_295);
					struct Eq_28246 * a3_101 = (word32) *((word32) s0_173 + 0x00C0);
					struct Eq_28752 * a4_102 = (word32) s0_173 + 0x0A;
					a5_103 = null;
					while (a5_103 < a3_101)
					{
						++a4_102;
						if ((word32) a4_102->wFFFFFFF4 == a0_90)
							goto l230088FE;
						a5_103 = (struct Eq_28246 *) ((char *) &a5_103->dw0000 + 1);
					}
					(word32) s0_173 + (s1_120 + 0x0C) + 0x0A = (word32) (word16) a0_90;
					s1_120 = (word32) (word16) (s1_120 + 0x01);
				}
				struct Eq_27684 * a3_127 = fp + -72;
				struct Eq_28760 * a5_128 = (word32) s0_173 + 8;
				struct Eq_27684 * a4_129 = null;
				while (a2_84 != a4_129)
				{
					a5_128->b0006 = 0x00;
					a5_128->b0007 = 0x01;
					a5_128->w0000 = 0x00;
					a5_128->b0005 = 0x00;
					a3_127->dw0000 = 0x00;
					a4_129 = (word32) (word16) ((char *) &a4_129->dw0000 + 1);
					++a5_128;
					++a3_127;
				}
				word32 s2_175;
				word32 s1_296;
				word32 s4_297;
				s0_173 = rc_update_retry_chain(rc_sort_samples_tp(s0_173, a3_127, a4_129, dwArgD8, out s3_157, out s6), fp + -72, a3_127, dwArgD8, out s1_296, out a1, out a4_169, out s2_175, out s4_297, out s5, out s7);
				struct Eq_28812 * a0_185 = (char *) s3_157 + 432 + s2_175;
				a0_185->b011A = (byte) ((word32) a0_185->b011A | 1);
			}
		}
		s0Out = s0_173;
		s1Out = dwLoc4C;
		a1Out = a1;
		a4Out = a4_169;
		s3Out = s3_157;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		return dwLoc08;
	}
	else
		assert_err();
}

// 23008952: Register ui32 rc_init_bcmc_rate(Register (ptr32 Eq_26508) a0, Register Eq_26439 a1, Register out Eq_26543 a4Out)
// Called from:
//      me_init_bcmc_rate
ui32 rc_init_bcmc_rate(struct Eq_26508 * a0, Eq_26439 a1, union Eq_26543 & a4Out)
{
	Eq_26543 a4_6 = a0->t010C;
	ui32 a3_7 = (word32) a0->w0118;
	int32 a5_12 = 0x00;
	if (a1 <= 0x03)
		a5_12 = (int32) (word16) (a3_7 & 0x0400);
	ui32 a1_15 = a1 | a5_12;
	(a1_15 | 0x20000000)->t0014 = a4_6;
	(a1_15 | 0x20000000)->t0018 = a4_6;
	(a1_15 | 0x20000000)->t001C = a4_6;
	(a1_15 | 0x20000000)->t0020 = a4_6;
	a4Out = a4_6;
	return a3_7;
}

// 2300897C: Register (ptr32 Eq_28193) rc_check_fixed_rate_config(Register (ptr32 Eq_28193) a0, Register Eq_27524 a1, Register out ptr32 a0Out)
// Called from:
//      me_rc_set_rate_req_handler
struct Eq_28193 * rc_check_fixed_rate_config(struct Eq_28193 * a0, Eq_27524 a1, ptr32 & a0Out)
{
	uint32 a5_5 = (word32) a0->b00B1;
	uint32 a3_8 = a1 >> 11 & 7;
	if (a5_5 < a3_8)
	{
		a0Out = 0x00;
		return s0;
	}
	if (a5_5 == 0x04)
	{
		if (a3_8 != a5_5)
			goto l23008A08;
	}
	else if ((a5_5 + ~0x01 & 0x00FF) <= 0x01)
	{
		if ((a1 >> 11 & 0x06) != 0x00)
		{
l230089A2:
			if ((a1 >> 0x09 & 0x01) != 0x00 && (word32) a0->b00BD == 0x00 || (word32) a0->b00BB < (a1 >> 0x07 & 0x03))
				goto l23008A08;
			word32 a5_145;
			word32 a4_144;
			if ((word32) a0->b00BC >= rc_get_nss(a1, out a4_144, out a5_145))
			{
l230089D0:
				ptr32 a0_72;
				struct Eq_28193 * s0_76 = rc_check_valid_rate(a0, a1, out a0_72);
				a0Out = a0_72;
				return s0_76;
			}
l23008A08:
			a0Out = 0x00;
			return a0;
		}
		if ((word32) a0->b00B9 > 0x03)
			goto l23008A08;
l230089F6:
		if ((a1 >> 0x0A & 0x01) == 0x00 && (word32) a0->b00BE == 0x01)
			goto l23008A08;
		goto l230089D0;
	}
	if ((a1 >> 11 & 0x06) != 0x00)
		goto l230089A2;
	goto l230089F6;
}

// 23008A16: Register uint32 rc_calc_tp(Register Eq_2 a0, Register ui32 a1, Stack Eq_2 dwArg18, Register out (ptr32 Eq_28990) s1Out, Register out (ptr32 Eq_28991) a0Out, Register out (ptr32 word32) a3Out, Register out (ptr32 Eq_28993) s2Out, Register out Eq_27524 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      me_check_rc
//      rc_update_stats
//      me_rc_stats_req_handler
uint32 rc_calc_tp(Eq_2 a0, ui32 a1, Eq_2 dwArg18, struct Eq_28990 & s1Out, struct Eq_28991 & a0Out, word32 & a3Out, struct Eq_28993 & s2Out, union Eq_27524 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	struct Eq_28991 * a0_22;
	struct Eq_28998 * a1_20 = (word32) a0 + (a1 + 0x0C);
	uint32 s0_21 = (word32) a1_20->w0008;
	if (s0_21 > 0x01FFF998)
	{
		s3 = (word32) a1_20->w000A;
		word32 a5_108;
		is_cck_group(s3, out a5_108) != 0x00;
		word32 a0_40;
		word32 a4_109;
		word32 a5_110;
		s1 = rc_get_duration(s3, dwArg18, out a0_40, out a3, out a4_109, out a5_110, out s2);
		s0_21 = s0_21 + 1000 >> s1 + a0_40 / 0x00C4;
		a0_22 = s0_21 + 1000000 >> 16;
	}
	else
		a0_22 = null;
	s1Out = s1;
	a0Out = a0_22;
	a3Out = a3;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return s0_21;
}

// 23008A8C: Register Eq_2 rc_update_stats(Register Eq_2 ra, Register Eq_2 a0, Stack (ptr32 Eq_26613) dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg80, Stack Eq_2 dwArgA8, Register out (ptr32 Eq_29051) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out (ptr32 (arr Eq_27881)) s3Out, Register out ptr32 s4Out, Register out Eq_29057 s5Out, Register out Eq_2 s6Out, Register out ptr32 s7Out, Register out Eq_29060 s9Out)
// Called from:
//      me_check_rc
//      rc_init
Eq_2 rc_update_stats(Eq_2 ra, Eq_2 a0, struct Eq_26613 * dwArg64, Eq_2 dwArg78, Eq_2 dwArg80, Eq_2 dwArgA8, struct Eq_29051 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & s2Out, Eq_27881 (& s3Out, ptr32 & s4Out, union Eq_29057 & s5Out, union Eq_2 & s6Out, ptr32 & s7Out, union Eq_29060 & s9Out)
{
	word32 a5_848;
	word32 a6_849;
	word32 a7_850;
	word32 a3_846;
	word32 a4_847;
	word32 a2_845;
	word32 a1_844;
	memcpy(fp + -0x0088, (word32) a0 + 0x007C, 32, out a1_844, out a2_845, out a3_846, out a4_847, out a5_848, out a6_849, out a7_850);
	Eq_2 s0_112 = a0;
	word32 a4_50 = (word32) *((word32) a0 + 166);
	if (a4_50 != 0x00)
	{
		ui32 a5_51 = (word32) *((word32) a0 + 0x00A4);
		Eq_2 a3_52 = *((word32) a0 + 0x00A8);
		((word32) a0 + 0x00A4)->u0 = 0x00;
		*((word32) a0 + 0x00A8) = ((a5_51 << 16 ^ a4_50) << 5) + ((word32) a3_52 + 96) >> 7;
	}
	struct Eq_27684 * a2_64 = (word32) *((word32) a0 + 0x00C0);
	((word32) a0 + 0x00AD)->u1 = 0x00;
	struct Eq_27684 * a3_116 = fp + -0x0068;
	struct Eq_29103 * a5_68 = (word32) a0 + 0x0E;
	struct Eq_27684 * a4_123 = null;
	Eq_27881 s3_139[] = fp + -0x0068;
	while (a2_64 != a4_123)
	{
		a3_116->dw0000 = 0x00;
		a5_68->b0000 = 0x00;
		a5_68->b0001 = 0x01;
		a4_123 = (word32) (word16) ((char *) &a4_123->dw0000 + 1);
		++a3_116;
		++a5_68;
	}
	ptr32 s1_156;
	word32 a1_87 = (word32) *((word32) a0 + 0x00C6);
	uint32 s2_128 = 0x00;
	ptr32 s4_113 = 0x0C;
	if (a1_87 == 0x0FFFFFFF)
	{
		while (s2_128 < (word32) (*((word32) s0_112 + 0x00C0)))
		{
			rc_calc_prob_ewma((word32) s0_112 + ((s2_128 + s4_113) + 0x04));
			word32 a0_107;
			ui32 s2_119;
			word32 s1_851;
			word32 s3_852;
			word32 s8_853;
			s0_112 = rc_calc_tp(s0_112, s2_128 & 0x00FF, dwLoc98, out s1_851, out a0_107, out a3_116, out s2_119, out s3_852, out s4_113, out s8_853);
			((s2_119 << 0x02) + (fp + -64))->dw0FD8 = a0_107;
			a4_123 = fp + -64;
			s2_128 = (word32) (word16) (s2_119 + 0x01);
		}
		word32 s2_857;
		word32 s6_854;
		word32 a4_856;
		word32 a1_855;
		s0_112 = rc_update_retry_chain(rc_sort_samples_tp(s0_112, a3_116, a4_123, dwArg78, out s3_139, out s6_854), s3_139, a3_116, dwArg78, out s1_156, out a1_855, out a4_856, out s2_857, out s4_113, out s5, out s7);
		if (s1_156 == 0x00)
		{
			up32 a3_165 = (word32) *((word32) s0_112 + 0x00C0);
			if (a3_165 > 0x09)
			{
				int32 s2_181 = (word32) ((word32) s0_112 + ((word32) (*((word32) s0_112 + 0x0080)) + 0x0C) + 0x0A);
				s4_113 = (word32) ((word32) s0_112 + ((word32) (*((word32) s0_112 + 0x0088)) + 0x0C) + 0x0A);
				s3_139 = (Eq_27881 (*)[]) ~0x00;
				s7 = 0x04;
				s5 = s2_181 >> 11 & 6;
				s9 = s2_181 & 0x0200;
				word32 a4_861;
				word32 a5_862;
				word32 t1_858;
				word32 a2_859;
				word32 a3_860;
				word32 a0_192;
				word32 a1_193;
				ra = memset(ra, fp + -0x0094, ~0x00, 0x0C, out t1_858, out a0_192, out a1_193, out a2_859, out a3_860, out a4_861, out a5_862);
				do
				{
					Eq_29489 a5_202 = s3_139;
					if ((a5_202 & 0x00FF) <= 0x04)
					{
						<anonymous> * a5_294 = *((char *) g_a23074D20 + (a5_202 & 0x00FF) * 0x04);
						struct Eq_29051 * s0_307;
						ptr32 s1_308;
						ptr32 a0_309;
						Eq_2 ra_312;
						ptr32 s2_313;
						Eq_27881 (* s3_314)[];
						ptr32 s4_315;
						Eq_29057 s5_316;
						Eq_2 s6_317;
						ptr32 s7_318;
						Eq_29060 s9_320;
						word32 tp_334;
						a5_294();
						s0Out = s0_307;
						s1Out = s1_308;
						a0Out = a0_309;
						s2Out = s2_313;
						s3Out = s3_314;
						s4Out = s4_315;
						s5Out = s5_316;
						s6Out = s6_317;
						s7Out = s7_318;
						s9Out = s9_320;
						return ra_312;
					}
					Eq_29485 s3_219 = (char *) s3_139 + 1;
					a0_192 = rc_new_random_rate(s0_112, a5_202 & 0x00FF, out a1_193);
					s3_139 = s3_219 & 0x00FF;
				} while ((s3_219 & 0x00FF) != 0x06);
				up32 a7_222 = (word32) *((word32) s0_112 + 0x00C0);
				up32 a5_224 = 0x01;
				uint32 a3_225 = 0x00;
				while (a5_224 < a7_222)
				{
					struct Eq_29532 * a4_235 = (word32) s0_112 + (a5_224 + 0x0C);
					if ((int32) a4_235->w0008 < 0x00 && (word32) a4_235->b000C <= 0x0A || ((word32) (*((word32) s0_112 + 0x0080)) == a5_224 || ((word32) (*((word32) s0_112 + 0x0088)) == a5_224 || ((word32) (*((word32) s0_112 + 144)) == a5_224 || a3_225 > 0x05))))
						a5_224 = (word32) (word16) (a5_224 + 0x01);
					else
					{
						word32 a2_259 = (word32) ((a3_225 << 0x01) + (fp + -64))->wFFFFFFAC;
						if (a2_259 != 0x0FFFFFFF)
						{
							struct Eq_29587 * a6_262 = (word32) s0_112 + 0x0A;
							up32 a0_263;
							for (a0_263 = 0x00; a0_263 < a7_222; ++a0_263)
							{
								++a6_262;
								if ((word32) a6_262->wFFFFFFF4 == a2_259)
									goto l23008D8E;
							}
							a4_235->w000A = (word16) a2_259;
							a4_235->w0008 = 0x00;
							a4_235->b000D = 0x00;
							a5_224 = (word32) (word16) (a5_224 + 0x01);
						}
l23008D8E:
						++a3_225;
					}
					a4_235->w0004 = 0x00;
					a4_235->w0006 = 0x00;
				}
				*((word32) s0_112 + 4) = 0x00;
				goto l23008C54;
			}
			struct Eq_29374 * a4_335 = (word32) s0_112 + 4;
			up32 a5_336 = 0x00;
			while (a3_165 != a5_336)
			{
				a4_335->w0000 = 0x00;
				a4_335->w0002 = 0x00;
				a5_336 = (word32) (word16) (a5_336 + 0x01);
				++a4_335;
			}
		}
l23008B9C:
		s1_156 = 0x00;
		goto l23008C54;
	}
	else
	{
		ui32 a3_346 = (word32) *((word32) a0 + 0x00AF);
		ui32 a5_347 = 0x00;
		if ((a3_346 & 32) == 0x00)
		{
			word32 s1_399 = (word32) *((word32) a0 + 0x0080);
			rc_calc_prob_ewma((word32) a0 + (s1_399 + 0x10));
			struct Eq_29201 * s1_404 = (word32) a0 + (s1_399 + 0x0C);
			s1_404->w0004 = 0x00;
			s1_404->w0006 = 0x00;
			*((word32) a0 + 4) = 0x00;
			goto l23008B9C;
		}
		while (true)
		{
			uint32 a2_351 = a5_347 << 0x10;
			if (a2_351 >> 16 >= a4_123)
				break;
			if ((word32) ((word32) a0 + (a5_347 + 0x0C) + 0x0A) == a1_87)
				goto l23008DE8;
			a5_347 = a5_347 + 0x01 & 0x00FF;
		}
		if (a4_123 == a2_351 >> 16)
		{
			ui32 a5_363 = a5_347 + ~0x00;
			struct Eq_29443 * a2_367 = (word32) a0 + ((a5_363 & 0x00FF) + 0x0C);
			a2_367->w000A = (word16) a1_87;
			a2_367->w0008 = 0x00;
			a5_347 = a5_363 & 0x00FF;
		}
l23008DE8:
		uint32 a5_371 = a5_347 << 16;
		*((word32) a0 + 0x0080) = (word16) (a5_371 >> 16);
		*((word32) a0 + 0x0088) = (word16) (a5_371 >> 16);
		*((word32) a0 + 144) = (word16) (a5_371 >> 16);
		((word32) a0 + 0x007C)->u0 = 0x00;
		((word32) a0 + 0x0084)->u0 = 0x00;
		*((word32) a0 + 0x008C) = 0x00;
		struct Eq_29435 * a2_380 = (word32) a0 + 4;
		struct Eq_27684 * a5_381 = null;
		while (a4_123 != a5_381)
		{
			a2_380->t0000.u0 = 0x00;
			a2_380->w0002 = 0x00;
			a5_381 = (word32) (word16) ((char *) &a5_381->dw0000 + 1);
			++a2_380;
		}
		((word32) a0 + 0x00AF)->u1 = (byte) (a3_346 & -97 | 64);
		s1_156 = 0x01;
l23008C54:
		struct Eq_29051 * a5_416 = (word32) s0_112 + 0x0080;
		struct Eq_29287 * a4_424 = fp + -0x0088 + 4;
		struct Eq_29051 * s0_425 = (word32) s0_112 + 0x00A0;
		do
		{
			if ((word32) a4_424->w0000 != (word32) a5_416->w0000)
			{
				s1_156 = 0x01;
				break;
			}
			++a5_416;
			++a4_424;
		} while (a5_416 != s0_425);
		Eq_2 s6_444 = *((word32) dwArgA8 + 0x00A8);
		ptr32 s2_445 = *((word32) dwArgA8 + 200);
		ptr32 a0_447 = *((word32) dwArgA8 + 0x0C);
		s0Out = s0_425;
		s1Out = s1_156;
		a0Out = a0_447;
		s2Out = s2_445;
		s3Out = s3_139;
		s4Out = s4_113;
		s5Out = s5;
		s6Out = s6_444;
		s7Out = s7;
		s9Out = s9;
		return ra;
	}
}

