pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 23008E34: Register Eq_2 rc_init(Register Eq_2 ra, Register (ptr32 Eq_8573) a0, Register Eq_2 s9, Stack word32 dwArg08, Stack word32 dwArg1C, Stack (ptr32 Eq_26613) dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_26939 s1Out, Register out ptr32 a3Out, Register out Eq_26941 a5Out, Register out Eq_26942 s5Out, Register out ptr32 s6Out, Register out (ptr32 Eq_26944) s7Out, Register out ptr32 s9Out)
// Called from:
//      me_init_rate
Eq_2 rc_init(Eq_2 ra, struct Eq_8573 * a0, Eq_2 s9, word32 dwArg08, word32 dwArg1C, struct Eq_26613 * dwArg34, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_26939 & s1Out, ptr32 & a3Out, union Eq_26941 & a5Out, union Eq_26942 & s5Out, ptr32 & s6Out, struct Eq_26944 & s7Out, ptr32 & s9Out)
{
	if ((word32) a0->b001B > 0x09)
		assert_err();
	Eq_2 s0_143;
	int32 s1_144;
	ptr32 s2_145;
	word32 s2_41 = (word32) a0->b001B;
	a0->dw0110 = s2_41 + 0x4201B1D0;
	phy_get_ntx(a0);
	word32 a4_889;
	word32 a5_890;
	word32 a1_886;
	word32 a0_885;
	word32 a2_887;
	word32 a3_888;
	word32 t1_884;
	Eq_2 ra_61 = memset(ra, s2_41 + 0x4201B1D0, 0x00, 200, out t1_884, out a0_885, out a1_886, out a2_887, out a3_888, out a4_889, out a5_890);
	if ((a0->dw00EC & 0x02) != 0x00)
	{
		word32 a0_137;
		struct Eq_29716 * s3_146;
		word32 s7_150;
		word32 a4_897;
		word32 s5_899;
		word32 s6_900;
		word32 s8_901;
		word32 s4_898;
		s0_143 = me_legacy_rate_bitfield_build(&a0->b001B + 0x0095, 0x00, dwArgF8, out s1_144, out a0_137, out a4_897, out s2_145, out s3_146, out s4_898, out s5_899, out s6_900, out s7_150, out s8_901);
		s3_146->b00B1 = 0x02;
		s3_146->w00B6 = (word16) a0_137;
		Eq_27386 a0_159 = me_11n_nss_max((word32) s0_143 + 0x00C3);
		Eq_27386 a0_165 = me_11n_nss_max(&g_t4201AFE3);
		Eq_27386 a5_168 = a0_159;
		if (a0_165 < a0_159)
			a5_168 = a0_165;
		(s2_145 + 200 + s1_144)->b00BC = (byte) a5_168;
		if (a5_168 > 0x03)
			assert_err();
		word32 a1_902;
		word32 a2_903;
		word32 a4_905;
		word32 a5_906;
		word32 a6_907;
		word32 a7_908;
		word32 a3_904;
		memcpy(s7_150 + 0x00B2 + s1_144, (word32) s0_143 + 0x00C3, 0x04, out a1_902, out a2_903, out a3_904, out a4_905, out a5_906, out a6_907, out a7_908);
		struct Eq_29806 * s7_206 = s2_145 + 200 + s1_144;
		int32 a0_207 = (word32) s7_206->w00B6;
		s7_206->b00B2 = ~0x00;
		s7_206->b00B8 = 0x07;
		up32 a0_211 = me_legacy_ridx_min(a0_207);
		s7_206->b00B9 = (byte) a0_211;
		if (a0_211 > 0x0C)
			assert_err();
		struct Eq_29855 * s7_226 = s2_145 + 200 + s1_144;
		uint32 a0_228 = me_legacy_ridx_max((word32) s7_226->w00B6);
		s7_226->b00BA = (byte) a0_228;
		if (a0_228 > 0x0C)
			assert_err();
		(s2_145 + 200 + s1_144)->b00BE = (byte) ((word32) *((word32) s0_143 + 0x0118) >> 0x0A & 0x01);
		word32 a0_250 = phy_ldpc_tx_supported(a0_228);
		ui32 a5_252 = (word32) *((word32) s0_143 + 0x00C0);
		word32 a4_258;
		if (a5_252 << 0x14 >= 0x00)
			a4_258 = 0x01000000;
		else
			a4_258 = 0x02000000;
		struct Eq_30372 * a5_268 = s2_145 + 200 + s1_144;
		a5_268->w00C2 = (word16) (a4_258 + -0x0101);
		up32 a4_272 = (word32) *((word32) s0_143 + 0x00F1);
		a5_268->b00BB = (byte) a4_272;
		if (a4_272 > 0x03)
			assert_err();
		struct Eq_30316 * a5_287;
		word32 a4_281 = (word32) *((word32) s0_143 + 0x00F1);
		if (a4_281 != 0x00)
		{
			if (a4_281 != 0x01 || ((word32) (*((word32) s0_143 + 0x00C0)) & 64) == 0x00)
				goto l2300901E;
			a5_287 = s2_145 + 200 + s1_144;
		}
		else
		{
			if (((word32) *((word32) s0_143 + 0x00C0) & 32) == 0x00)
				goto l2300901E;
			a4_281 = 0x01;
			a5_287 = s2_145 + 200 + s1_144;
		}
		a5_287->b00BD = (byte) a4_281;
	}
	else
	{
		int32 a0_68;
		struct Eq_29678 * s3_77;
		word32 s4_892;
		word32 s5_893;
		word32 s6_894;
		word32 s8_896;
		word32 s7_895;
		word32 a4_891;
		s0_143 = me_legacy_rate_bitfield_build(&a0->b001B + 0x0095, 0x00, dwArgF8, out s1_144, out a0_68, out a4_891, out s2_145, out s3_77, out s4_892, out s5_893, out s6_894, out s7_895, out s8_896);
		s3_77->w00B6 = (word16) a0_68;
		up32 a0_86 = me_legacy_ridx_min(a0_68);
		s3_77->b00B9 = (byte) a0_86;
		if (a0_86 > 11)
			assert_err();
		struct Eq_29765 * s7_101 = s2_145 + 200 + s1_144;
		uint32 a0_103 = me_legacy_ridx_max((word32) s7_101->w00B6);
		s7_101->b00BA = (byte) a0_103;
		if (a0_103 > 11)
			assert_err();
		struct Eq_29834 * a5_120 = s2_145 + 200 + s1_144;
		a5_120->b00B8 = ~0x00;
		word32 a4_122 = (word32) *((word32) s0_143 + 0x00F1);
		a5_120->b00BB = (byte) a4_122;
		if (a4_122 != 0x00)
			assert_err();
		(s2_145 + 200 + s1_144)->b00BE = (byte) ((word32) *((word32) s0_143 + 0x0118) >> 0x0A & 0x01);
	}
l2300901E:
	up32 a5_324;
	struct Eq_29921 * a4_304 = s2_145 + 200 + s1_144;
	up32 a3_306 = (word32) a4_304->b00B1;
	if (a3_306 > 0x01)
	{
		if (a3_306 > 0x03)
		{
			a4_304->w00C0 = 0x00;
			goto l2300903C;
		}
		uint32 a1_338 = (word32) a4_304->b00B2;
		word32 a2_339;
		ui32 a3_340 = 0x01 << (word32) a4_304->b00BD;
		word32 a5_341 = 0x00;
		for (a2_339 = 0x08; a2_339 != 0x00; a2_339 += ~0x00)
		{
			a1_338 >>= 1;
			a5_341 = (word32) (word16) (a5_341 + (a3_340 + (a1_338 & 1)));
		}
		struct Eq_30032 * a4_358 = s2_145 + 200 + s1_144;
		int32 a3_360 = (word32) a4_358->w00B6;
		word32 a2_362 = 0x01 - (word32) a4_358->b00BE;
		a5_324 = (word32) (word16) (a5_341 + ((((a3_360 >> 0x01 & 0x01) + (a3_360 >> 0x02 & 1) << a2_362) + (a3_360 & 1)) + ((a3_360 >> 3 & 0x01) << a2_362)));
	}
	else
	{
		int32 a3_307 = (word32) a4_304->w00B6;
		word32 a4_310 = 0x01 - (word32) a4_304->b00BE;
		a5_324 = (word32) (word16) (((a3_307 >> 0x01 & 0x01) + (a3_307 >> 0x02 & 1) << a4_310) + (a3_307 & 1) + ((a3_307 >> 0x03 & 0x01) << a4_310));
		word32 a4_325 = 0x04;
		do
		{
			++a4_325;
			a5_324 = (word32) (word16) (a5_324 + (a3_307 >> a4_325 & 0x01));
		} while (a4_325 != 0x0C);
	}
	if (a5_324 > 0x0A)
		(s2_145 + 200 + s1_144)->w00C0 = 0x0A;
	else
	{
		(s2_145 + 200 + s1_144)->w00C0 = (word16) a5_324;
		if (a5_324 == 0x00)
		{
l2300903C:
			assert_err();
		}
	}
	Eq_2 s7_407 = *((char *) g_a420191E0 + (word32) (*((word32) s0_143 + 27)));
	if (s7_407 != 0x00)
	{
		word32 a4_413 = (word32) *((word32) s7_407 + 0x00C0);
		struct Eq_30013 * a5_415 = (word32) s7_407 + 0x0A;
		word32 s8_416 = 0x00;
		while (s8_416 != a4_413)
		{
			a5_415->w0000 = ~0x00;
			s8_416 = (word32) (word16) (s8_416 + 0x01);
			++a5_415;
		}
		*((word32) s7_407 + 0x0A) = (word16) rc_get_lowest_rate_config(s7_407);
		(word32) s7_407 + (s8_416 + 11) + 0x0A = (word32) (word16) rc_get_initial_rate_config(s7_407, dwArg08);
		int32 s8_450 = 0x01;
		while (true)
		{
l23009232:
			struct Eq_28246 * a5_453 = (word32) *((word32) s7_407 + 0x00C0);
			if (s8_450 >= (char *) a5_453 - 1)
				break;
			word32 a1_909;
			word32 a0_457 = rc_new_random_rate(s7_407, a5_453, out a1_909);
			up32 a3_467 = (word32) *((word32) s7_407 + 0x00C0);
			struct Eq_30138 * a4_469 = (word32) s7_407 + 0x0A;
			up32 a5_470;
			for (a5_470 = 0x00; a5_470 < a3_467; ++a5_470)
			{
				++a4_469;
				if ((word32) a4_469->wFFFFFFF4 == a0_457)
					goto l23009232;
			}
			(word32) s7_407 + (s8_450 + 0x0C) + 0x0A = (word32) (word16) a0_457;
			s8_450 = (word32) (word16) (s8_450 + 0x01);
		}
		*((word32) s7_407 + 0x0080) = (word16) ((char *) a5_453 - 1);
		*((word32) s7_407 + 144) = (word16) ((char *) a5_453 - 3);
		((word32) s7_407 + 0x00A8)->u0 = 0x10000000;
		*((word32) s7_407 + 0x0088) = (word16) ((char *) a5_453 - 2);
		((word32) s7_407 + 0x00C6)->u0 = ~0x00;
		((word32) s7_407 + 0x007C)->u0 = 0x00;
		((word32) s7_407 + 0x0084)->u0 = 0x00;
		*((word32) s7_407 + 0x008C) = 0x00;
		((word32) s7_407 + 0x0098)->u0 = 0x00;
		((word32) s7_407 + 0x0094)->u0 = 0x00;
		((word32) s7_407 + 0x00AF)->u1 = 0x00;
		struct Eq_8573 * a0_512;
		struct Eq_30193 * s0_521;
		Eq_26939 s1_522;
		struct Eq_30195 * s2_525;
		struct Eq_30196 * s4_527;
		ui32 s5_528;
		ptr32 s6_529;
		struct Eq_26944 * s7_530;
		ptr32 s9_532;
		struct Eq_30201 * s3_526;
		Eq_2 ra_520 = rc_update_stats(ra_61, s7_407, dwArg34, dwArg48, s9, dwArg78, out s0_521, out s1_522, out a0_512, out s2_525, out s3_526, out s4_527, out s5_528, out s6_529, out s7_530, out s9_532);
		s7_530->b00AC = 0x05;
		struct Eq_30220 * a4_544 = &s4_527->dw0010 + 1;
		do
		{
			++a4_544;
			Mem563[a4_544 + 0x0FFC:word32] = CONVERT(Mem549[CONVERT(Mem549[s3_526 + 0x0080:byte], byte, word32) + 0x0C + (s2_525 + 200) + s1_522 + 0x0A:uint16], uint16, word32) | 0x80000000;
			++s3_526;
		} while (a4_544 != &s4_527->dw0010 + 5);
		Mem570[s2_525 + 200 + s1_522:word32] = Mem563[0x44B00120:int32];
		s4_527->dw0000 = 3135023902;
		s4_527->dw000C = s5_528 << 0x0A;
		s4_527->dw0010 = 0xF0000704;
		s4_527->ptr0004 = s6_529;
		s4_527->dw0008 = (0x01 << phy_get_ntx(a0_512) + 0x01) + ~0x00;
		struct Eq_30281 * a4_590 = s0_521->ptr010C;
		*(struct Eq_30281 **) 0x02000234 = a4_590;
		struct Eq_30287 * s0_595 = a4_590->ptr0010;
		a4_590->ptr0038 = s0_521->ptr010C;
		ui32 a5_597 = (word32) s0_595->b011A;
		s0_595->b011A = (byte) (a5_597 | 0x0011);
		0x00 = (uint16) dwArg0128;
		0x00 = dwArg1C;
		s0Out = s4;
		s1Out = s1_522;
		a3Out = &s4_527->dw0010 + 5;
		a5Out = a5_597 | 0x0011;
		s5Out = s5_528 << 0x0A;
		s6Out = s6_529;
		s7Out = s7_530;
		s9Out = s9_532;
		return ra_520;
	}
	else
		assert_err();
}

// 230093F0: Register Eq_2 rc_check(Register Eq_2 ra, Register (ptr32 Eq_26611) a0, Register Eq_2 s6, Stack (ptr32 Eq_26613) dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg58, Stack word32 dwArg010C, Register out ptr32 s0Out, Register out (ptr32 Eq_26634) s2Out)
// Called from:
//      me_check_rc
Eq_2 rc_check(Eq_2 ra, struct Eq_26611 * a0, Eq_2 s6, struct Eq_26613 * dwArg14, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg58, word32 dwArg010C, ptr32 & s0Out, struct Eq_26634 & s2Out)
{
	if (a0 > (struct Eq_26611 *) 0x09)
	{
		s0Out = s0;
		s2Out = s2;
		return ra;
	}
	struct Eq_26611 * s4_253 = a0;
	word32 s3_260 = 0x42018F20;
	if (a0->dw420191E0 == 0x00)
		assert_err();
	Eq_2 a4_47 = *(union Eq_2 *) 0x44B00120;
	struct Eq_30419 * s1_138 = (struct Eq_30419 *) 0x44B00000;
	Eq_2 s0_252 = *a4_47;
	word32 s6_274 = 0x00;
	if ((word32) a4_47 + (0x180006A0 - a4_47) < 0x00)
	{
		word32 a0_56;
		word32 s9_775;
		word32 s5_772;
		word32 s6_773;
		word32 s7_774;
		rc_update_stats(ra, s0_252, dwArg14, dwArg28, dwArg30, dwArg58, out s0_252, out s1_138, out a0_56, out s2, out s3_260, out s4_253, out s5_772, out s6_773, out s7_774, out s9_775);
		ui32 a5_84 = (word32) *((word32) s0_252 + 0x00AF);
		((word32) s0_252 + 0x00AE)->u1 = 0x00;
		((word32) s0_252 + 0x00B0)->u1 = 0x00;
		((word32) s0_252 + 0x00AF)->u1 = (byte) (a5_84 & ~0x10);
		*s1_138->ptr0120 = (union Eq_2 *) s0_252;
		s6_274 = a0_56;
	}
	up32 a5_94 = (word32) *((word32) s0_252 + 0x00AE);
	if (a5_94 != 0x01)
	{
		if (a5_94 == 0x03)
		{
			if (((word32) *((word32) s0_252 + 0x00AF) & 0x02) == 0x00)
			{
				*((word32) s0_252 + 0x0080) = (word16) (word32) *((word32) s0_252 + 0x0088);
				*((word32) *((word32) s0_252 + 0x0084) + 0x007C) = s0_252;
			}
			word32 a5_105 = (word32) *((word32) s0_252 + 0x00A0);
			((word32) s0_252 + 0x00AE)->u1 = 0x00;
			*((word32) s0_252 + 0x0088) = (word16) a5_105;
			Eq_2 a5_108 = *((word32) s0_252 + 0x009C);
			((word32) s0_252 + 0x009C)->u0 = 0x00;
			*((word32) s0_252 + 0x0084) = a5_108;
			((word32) s0_252 + 0x00A0)->u0 = 0xFF;
l2300958C:
			struct Eq_30657 * s3_347 = (char *) s4_253 + 432 + s3_260;
			s3_347->b011A = (byte) ((word32) s3_347->b011A | 1);
			goto l2300962E;
		}
l2300962A:
		if (s6_274 == 0x00)
		{
l2300962E:
			0x00 = dwArg010C;
			s0Out = dwArgCC;
			s2Out = s2;
			return dwLoc08;
		}
		goto l2300958C;
	}
	if (((word32) *((word32) s0_252 + 0x00AF) & 64) == 0x00)
	{
		ui32 a5_119;
		ui32 s5_116 = (word32) *((word32) s0_252 + 0x0080);
		if (a5_94 >= (word32) (*((word32) s0_252 + 177)))
		{
			if ((word32) (word16) ((word32) ((word32) s0_252 + (s5_116 + 0x0C) + 8) + 0xFE000667) > 0x0DFFF99A)
				a5_119 = 0x05;
			else
				a5_119 = 0x0A;
		}
		else
			a5_119 = (word32) *((word32) s0_252 + 0x00AA) + 0x08 << 1;
		*((word32) s0_252 + 0x00AC) = (byte) a5_119;
		struct Eq_30519 * s1_142 = (char *) &s1_138->ptr0120 + 0x41C64D4D;
		s1_142->dw3000039 = s1_138->dw0000;
		ui32 s1_153 = &s1_142->dw3000039 >> 16 & (word32) (*((word32) s0_252 + 0x00C0));
		if (s1_153 != s5_116)
		{
			ui32 s7_155 = (word32) *((word32) s0_252 + 0x0088);
			if (s1_153 == s7_155)
				goto l23009626;
			ui32 s9_156 = (word32) *((word32) s0_252 + 144);
			if (s1_153 != s9_156)
			{
				s2 = (word32) s0_252 + (s1_153 + 0x0C);
				if ((word32) s2->w0008 > 0x0F000333)
					goto l23009626;
				struct Eq_28990 * s1_258;
				Eq_2 a0_247;
				Eq_2 a5_264;
				Eq_27524 s11_163 = (word32) s2->w000A;
				up32 a0_165;
				up32 a4_168;
				word32 a3_776;
				word32 a5_777;
				word32 s2_778;
				rc_get_duration(s11_163, dwLoc18, out a0_165, out a3_776, out a4_168, out a5_777, out s2_778);
				Eq_27524 a5_178 = (word32) ((word32) s0_252 + (s5_116 + 0x0C) + 0x0A);
				if (a4_168 <= 0x01)
				{
					up32 a0_280;
					word32 a5_781;
					word32 a4_780;
					word32 a3_779;
					s1_258 = rc_get_duration(a5_178, dwLoc18, out a0_280, out a3_779, out a4_780, out a5_781, out s2);
					if (a0_280 < a0_165)
					{
						a0_247.u0 = 0x00;
						a5_264 = (word32) ((word32) s2->b000C < 20) ^ 1;
					}
					else
					{
						a0_247.u0 = 0x00;
						a5_264.u0 = 0x01;
					}
l2300955C:
					Eq_2 a4_296 = *((word32) s0_252 + 0x0084);
					*((word32) s0_252 + 0x00A0) = (word16) s7_155;
					*((word32) s0_252 + 0x009C) = a4_296;
					ui32 a4_303 = (word32) *((word32) s0_252 + 0x00AF);
					if (a5_264 != 0x00)
					{
						s0_252 = *((word32) a5_264 + 0x007C);
						((word32) s0_252 + 0x00AF)->u1 = (byte) (a4_303 & ~0x02);
						*((word32) s0_252 + 0x0084) = a5_264;
						*((word32) s0_252 + 0x0088) = (word16) s5_116;
						*((word16) a0_247.u0 + 0x007C) = s0_252;
						*((word32) s0_252 + 0x0080) = (word16) s1_258;
					}
					else
					{
						((word32) s0_252 + 0x00AF)->u1 = (byte) (a4_303 | 2);
						*((word32) s0_252 + 0x0084) = a0_247;
						*((word32) s0_252 + 0x0088) = (word16) s1_258;
					}
					((word32) s0_252 + 0x00AE)->u1 = 0x02;
					goto l2300958C;
				}
				up32 a0_184;
				Eq_27524 a5_188;
				word32 a3_782;
				word32 a4_783;
				struct Eq_28990 * s1_189 = rc_get_duration((word32) ((word32) s0_252 + (s7_155 + 0x0C) + 0x0A), dwLoc18, out a0_184, out a3_782, out a4_783, out a5_188, out s2);
				Eq_30708 s8_183 = 32;
				if ((word32) s2->b000D == 0x00)
					s8_183 = (word32) *((word32) s0_252 + 0x00AA);
				if (a0_165 >= a0_184)
				{
					word32 a4_784;
					word32 a5_785;
					rc_get_nss(a5_188, out a4_784, out a5_785);
					up32 a5_208;
					word32 a4_786;
					if (a5_208 + ~0x00 >= rc_get_nss(s11_163, out a4_786, out a5_208))
					{
						up32 a0_217;
						word32 a3_787;
						word32 a4_788;
						word32 a5_789;
						s1_189 = rc_get_duration((word32) ((word32) s0_252 + (s9_156 + 0x0C) + 0x0A), dwLoc18, out a0_217, out a3_787, out a4_788, out a5_789, out s2);
						if (a0_165 < a0_217)
							goto l2300964C;
					}
					if ((word32) s2->b000C < s8_183)
						goto l23009626;
					uint32 a5_235 = (word32) *((word32) s0_252 + 0x00AD) + 0x01 & 0x00FF;
					((word32) s0_252 + 0x00AD)->u1 = (byte) a5_235;
					if (a5_235 > 0x02)
					{
						if (a5_235 > 0x0F)
							((word32) s0_252 + 0x00AD)->u1 = 0x0F;
						goto l23009626;
					}
				}
l2300964C:
				up32 s8_254;
				word32 a3_790;
				s0_252 = rc_calc_tp(s0_252, s1_189 & 0x00FF, s6, out s1_258, out a0_247, out a3_790, out s2, out s3_260, out s4_253, out s8_254);
				a5_264.u0 = 0x01;
				if (((word32) s2->b000E & 0x0F) <= 0x09)
					a5_264 = (word32) ((word32) s2->b000C < s8_254) ^ 1;
				goto l2300955C;
			}
		}
	}
l23009626:
	((word32) s0_252 + 0x00AE)->u1 = 0x00;
	goto l2300962A;
}

