pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 230096CA: Register ui32 rxu_cntrl_machdr_len_get(Register ui32 a0, Register out Eq_30880 a3Out)
// Called from:
//      rxu_mpdu_upload_and_indicate.constprop.11
//      rxu_cntrl_frame_handle
ui32 rxu_cntrl_machdr_len_get(ui32 a0, union Eq_30880 & a3Out)
{
	ui32 a5_11 = 0x18;
	if ((a0 & 0x0300) == 0x0300)
		a5_11 = 0x1E;
	if ((a0 & 252) == 0x0088)
		a5_11 = a5_11 + 0x02 & 0x00FF;
	if ((int32) (word16) a0 < 0x00)
		a5_11 = a5_11 + 0x04 & 0x00FF;
	a3Out.u0 = 0x0088;
	return a5_11;
}

// 230096FE: Register Eq_2 rxu_cntrl_protected_handle(Register Eq_2 a0, Register Eq_2 a1, Register out (ptr32 Eq_30907) a1Out, Register out Eq_30908 a2Out, Register out (ptr32 Eq_30909) a3Out, Register out (ptr32 Eq_30910) a4Out, Register out (ptr32 Eq_30911) a5Out)
// Called from:
//      rxu_cntrl_frame_handle
Eq_2 rxu_cntrl_protected_handle(Eq_2 a0, Eq_2 a1, struct Eq_30907 & a1Out, union Eq_30908 & a2Out, struct Eq_30909 & a3Out, struct Eq_30910 & a4Out, struct Eq_30911 & a5Out)
{
	struct Eq_30909 * a3_105;
	Eq_30908 a2_102;
	struct Eq_30909 * a3_6 = (word32) g_b4201B9D0;
	struct Eq_30910 * a4_107 = &g_w4201B9C8;
	struct Eq_30907 * a1_10 = a1 & 0x1C;
	word32 a0_12 = a0 + a3_6;
	struct Eq_30911 * a5_109 = &g_w4201B9C8;
	if ((a1 & 0x1C) != 0x18)
	{
		a2_102.u0 = 0x1C;
		if ((a1 & 0x1C) != 0x1C)
		{
			a5_109 = (struct Eq_30911 *) 0x14;
			if ((a1 & 0x1C) != 0x14)
			{
				a1Out = a1 & 0x1C;
				a2Out.u0 = 0x1C;
				a3Out = a3_6;
				a4Out = (struct Eq_30910 *) &g_w4201B9C8;
				a5Out = (struct Eq_30911 *) 0x14;
				return 0x00;
			}
			g_b4201B9D0 = (byte) ((char *) a3_6 + 4);
			a3_105 = (struct Eq_30909 *) ((char *) a3_6 + 4);
		}
		else
		{
			int32 a2_59;
			Eq_30987 a4_60;
			if ((a1 & 0x0400) != 0x00)
			{
				a1_10 = (struct Eq_30907 *) 0x05D8;
				a4_60 = ((word32) a0_12->t0002 >> 0x0E) + 0x0068 + ((word32) g_b4201B9D2 + 2552);
				a2_59 = 0x4201A410;
			}
			else
			{
				a2_59 = 0x42018F20;
				a4_60 = (word32) g_b4201B9D1 + 496;
			}
			(word32) a4_60 + a2_59 + 32 = 0x4201B9C8;
			g_b4201B9D0 = (byte) ((char *) a3_6 + 8);
			a2_102 = (word32) a0_12->w0000;
			a3_105 = (word32) a0_12->w0006;
			((word32) a0_12->w0004 << 16 | a2_102)->dw0010 = 0x4201B9C8;
			ui32 a4_87 = (word32) g_b4201B9F8;
			a3_105->dw0014 = 0x4201B9C8;
			g_b4201B9F8 = (byte) (a4_87 | 2);
			a4_107 = a4_87 | 2;
		}
	}
	else
	{
		uint32 a4_37;
		g_b4201B9D0 = (byte) ((char *) a3_6 + 8);
		a1_10 = (word32) a0_12->w0006;
		((word32) a0_12->w0004 << 16 | (word32) a0_12->t0002 | (word32) a0_12->w0000 << 8 & 0x0FFFFFFF)->dw0010 = 0x4201B9C8;
		ui32 a4_28 = (word32) g_b4201B9F8;
		a1_10->t0014.u0 = 0x4201B9C8;
		g_b4201B9F8 = (byte) (a4_28 | 3);
		a2_102.u0 = 0x0FFFFFFF;
		if ((a1 & 0x0400) != 0x00)
		{
			a2_102.u0 = 0x05D8;
			a4_37 = ((word32) a0_12->t0002 >> 0x0E) + 0x0068 + ((word32) g_b4201B9D2 + 2552);
			a3_105 = (struct Eq_30909 *) &g_t4201A410;
		}
		else
		{
			a3_105 = (struct Eq_30909 *) &g_t42018F20;
			a4_37 = (word32) g_b4201B9D1 + 496;
		}
		a4_107 = (struct Eq_30910 *) (a3_105 + a4_37 / 24);
		a4_107->dw0020 = 0x4201B9C8;
	}
	a1Out = a1_10;
	a2Out = a2_102;
	a3Out = a3_105;
	a4Out = a4_107;
	a5Out = a5_109;
	return 0x01;
}

// 23009828: Register Eq_2 rxu_mpdu_upload_and_indicate.constprop.11(Register (ptr32 Eq_31100) a3, Register ptr32 mstatus, Stack Eq_2 dwArg18, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out (ptr32 Eq_31105) s5Out)
// Called from:
//      rxu_mgt_frame_check
//      rxu_cntrl_frame_handle
Eq_2 rxu_mpdu_upload_and_indicate.constprop.11(struct Eq_31100 * a3, ptr32 mstatus, Eq_2 dwArg18, union Eq_2 & a4Out, union Eq_2 & a5Out, struct Eq_31105 & s5Out)
{
	ui32 a4_21 = (word32) g_b4201B9D2;
	Eq_2 a0_23 = a3->t0004;
	ui32 a5_26 = (word32) g_b4201B9D1 << 16 | a4_21 << 8;
	word32 a3_27 = ((Eq_362986[]) 76)[a4_21].dw0000;
	g_b4201B9FA = 0x00;
	ui32 a5_30 = a5_26 | a4_21 << 8;
	(a5_30 | 2)->dw004C = a3_27;
	struct Eq_31105 * s5_35 = (a5_30 | 2)->ptr0008;
	struct Eq_31144 * a5_36 = s5_35->ptr0018;
	word32 a3_179;
	uint32 a0_41 = rxu_cntrl_machdr_len_get((word32) a5_36->b0000 | (word32) a5_36->b0001 << 8, out a3_179);
	word32 s4_45 = (word32) g_b4201B9D0;
	Eq_2 s0_29 = a0_23;
	ui32 s2_46 = s4_45 - a0_41;
	if ((s2_46 & 0x00FF) != 0x00)
	{
		if ((s2_46 & 0x00FF & 1) != 0x00)
			assert_warn();
		struct Eq_31144 * a2_63 = s5_35->ptr0018;
		struct Eq_31144 * a5_70 = a2_63 + ((a0_41 >> 0x01 & 0x00FF) + 0x7FFFFFFF << 1) / 2;
		struct Eq_31239 * a4_71 = a2_63 + (((word32) g_b4201B9D0 >> 1) + 0x7FFFFFFF << 1) / 2;
		while (a5_70 >= a2_63)
		{
			a5_70 = (struct Eq_31144 *) ((char *) a5_70 - 2);
			a4_71 = (struct Eq_31239 *) ((char *) a4_71 - 2);
			a4_71[1] = (struct Eq_31239) (word16) (word32) a5_70[1];
		}
		s0_29 = a5_70[2];
		a5_70[0x0E] = (struct Eq_31144) (word16) ((word32) a5_70[0x0E] - (s2_46 & 0x00FF));
		word32 a5_87 = (word32) g_b4201B9D0;
		g_b4201B9FA = (byte) (s2_46 & 0x00FF);
		g_b4201B9D0 = (byte) (a0_41 + (a5_87 - s4_45));
	}
	g_dw4201CA40 = 0x00;
	struct Eq_31179 * a5_111;
	word32 s2_180;
	Eq_2 a4_110 = rxl_mpdu_transfer(s0_29, mstatus, dwArg18, out a5_111, out s2_180);
	__csrrc(mstatus, 0x08);
	Eq_2 s0_116 = a5_111->t0004;
	((word32) s0_116 + 28)->u1 = 0x03;
	*((word32) a4_110 + 20) = s0_116;
	Eq_2 a5_120 = (word32) a5_111->w001C;
	*((word32) a5_120 + 24) = s0_116;
	__csrrc(mstatus, 0x08);
	co_list_push_back(s0_116, a5_120);
	__csrrs(mstatus, 0x08);
	__csrrs(mstatus, 0x08);
	a4Out = a4_110;
	a5Out = a5_120;
	s5Out = s5_35;
	return s0_116;
}

// 23009956: Register Eq_2 rxu_mgt_frame_check(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s10, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg58, Stack Eq_2 dwArg0138, Register out Eq_2 a1Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_27384) a5Out, Register out (ptr32 Eq_31305) s5Out, Register out (ptr32 Eq_31306) s6Out, Register out (ptr32 Eq_31307) s7Out, Register out Eq_2 s10Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      rxu_cntrl_frame_handle
Eq_2 rxu_mgt_frame_check(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 s10, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg58, Eq_2 dwArg0138, union Eq_2 & a1Out, union Eq_2 & a4Out, struct Eq_27384 & a5Out, struct Eq_31105 & s5Out, struct Eq_31306 & s6Out, struct Eq_31307 & s7Out, union Eq_2 & s10Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	Eq_2 s4_238;
	Eq_2 a4_1217 = (word32) *((word32) s0 + 1) << 8 | (word32) (*s0);
	struct Eq_31324 * s5_31 = *((word32) a0 + 4);
	struct Eq_27384 * a5_1220 = a4_1217 & 0x0400;
	if ((a4_1217 & 0x0400) != 0x00)
	{
l23009AF6:
		s4_238.u0 = 0x01;
		goto l23009C9A;
	}
	ui32 a5_40 = (word32) *((word32) s0 + 22);
	s4_238.u0 = 0x01;
	a5_1220 = a5_40 & 0x0F;
	if ((a5_40 & 0x0F) != 0x00)
	{
l23009C9A:
		a1Out = a1;
		a4Out = a4_1217;
		a5Out = a5_1220;
		s5Out = s4;
		s6Out = s6;
		s7Out = s7;
		s10Out = s10;
		fflagsOut = fflags;
		frmOut = frm;
		return s4_238;
	}
	Eq_2 a5_43 = 0x00FF;
	if (a1 != 0x00FF)
	{
l23009A72:
		struct Eq_27384 * s2_165;
		struct Eq_31354 * s5_168;
		Eq_2 ra_163 = phyif_utils_decode(ra, (char *) s5_31 + 40, fp + -73, fflags, frm, out a1, out s2_165, out s5_168, out s6, out fflags, out frm);
		ui32 s8_187 = (word32) *((word32) s0 + 1) << 8 | (word32) (*s0);
		int32 s9_189 = (word32) g_b4201B9D0;
		a5_1220 = (word32) g_b4201B9D2;
		word32 s3_193 = (word32) s5_168->w001C;
		s7 = (struct Eq_31307 *) &g_w4201B9C8;
		if (a5_1220 == (struct Eq_27384 *) 0x00FF)
		{
			if (s2_165 == a5_1220)
			{
				a4_1217.u0 = 0x04;
				s10.u0 = 0x00;
l23009ACC:
				Eq_2 s4_218;
				struct Eq_31100 * a3_215 = (struct Eq_31100 *) 80;
				if ((s8_187 & 252) == 80)
				{
					if (s10 == 0x00)
						goto l23009AF0;
					s6 = (struct Eq_31306 *) 0x01;
					s4_218.u0 = 0x04;
l23009C10:
					Eq_2 a0_481;
					word32 s1_490;
					word32 s2_491;
					word32 s4_493;
					word32 s8_494;
					word32 s0_1442;
					word32 a2_1443;
					word32 a6_1445;
					word32 a3_1444;
					word32 s3_492;
					ke_msg_alloc(ra_163, 0x02FFFC00, s4_218, (word32) (word16) (s3_193 + 28), a4_1217, mstatus, s10, out s0_1442, out s1_490, out a0_481, out a1, out a2_1443, out a3_1444, out a4_1217, out a5_1220, out a6_1445, out s2_491, out s3_492, out s4_493, out s8_494);
					s10 = a0_481;
					if (a0_481 != 0x00)
					{
						word32 a5_1450;
						word32 a4_1449;
						struct Eq_14534 * a3_502 = phy_get_channel(fp + -72, out a4_1449, out a5_1450);
						if (s6 == null)
						{
							if ((s9_189 & 1) != 0x00)
								assert_warn();
							s3_492 = (word32) (word16) (s3_492 - s9_189);
						}
						*a0_481 = (word16) s3_492;
						ui32 s3_535 = s3_492 + 0x03;
						int32 a5_537;
						for (a5_537 = 0x00; (s3_535 & -4) != a5_537; a5_537 += 0x04)
							a3_502->ptr001C = (word32) a0_481 + a5_537;
						uint32 a5_559 = (word32) s7->b000A;
						*((word32) a0_481 + 2) = (word16) s8_494;
						*((word32) a0_481 + 7) = (byte) s2_491;
						((word32) a0_481 + 8)->u1 = (byte) a5_559;
						*((word32) a0_481 + 26) = 0x00;
						*((word32) a0_481 + 25) = 0x00;
						*((word32) a0_481 + 4) = (word16) (a5_559 >> 0x10);
						*((word32) a0_481 + 6) = (byte) a5_559;
						((word32) a0_481 + 24)->u1 = (byte) (int32) s5_168->b0033;
						if (s4_493 == 0x07 && s1_490 == 0x00)
						{
							*((word32) a0_481 + 16) = s5_168->dw0020;
							*((word32) a0_481 + 20) = s5_168->dw0024;
							*((word32) a0_481 + 27) = (byte) (s5_168->t0028 >> 0x0C & 0x0F);
						}
						word32 s2_1458;
						word32 s3_1459;
						word32 s1_1454;
						word32 a2_1456;
						word32 a3_1457;
						word32 a0_1455;
						word32 s4_1460;
						word32 s8_1461;
						ke_msg_send(a0_481, mstatus, out s1_1454, out a0_1455, out a1, out a2_1456, out a3_1457, out a4_1217, out a5_1220, out s2_1458, out s3_1459, out s4_1460, out s8_1461);
					}
					s4_238.u0 = 0x00;
					goto l23009C9A;
				}
				if ((s8_187 & 252) <= 80)
				{
					a3_215 = (struct Eq_31100 *) 32;
					if ((s8_187 & 252) == 32)
						goto l23009B3E;
					if ((s8_187 & 252) <= 32)
					{
						if ((s8_187 & 252) != 0x00)
						{
							if ((s8_187 & 252) != 0x10)
								goto l23009AF0;
l23009BAA:
							if (a4_1217 == 0x00)
								goto l23009BAC;
							goto l23009AF0;
						}
						goto l23009B3E;
					}
					a3_215 = (struct Eq_31100 *) 48;
					if ((s8_187 & 252) == 48)
						goto l23009BAA;
					if ((s8_187 & 252) == 64)
					{
l23009B3E:
						if (apm_embedded_enabled(s10, out a4_1217) == 0x00)
							goto l23009AF0;
						goto l23009C0C;
					}
					goto l23009AF0;
				}
				a3_215 = (struct Eq_31100 *) 0x00B0;
				if ((s8_187 & 252) == 0x00B0)
				{
l23009B6E:
					if (a4_1217 == 0x00)
					{
l23009BAC:
						s6 = null;
						s4_218.u0 = 0x06;
						goto l23009C10;
					}
					goto l23009B3E;
				}
				if ((s8_187 & 252) <= 0x00B0)
				{
					a3_215 = (struct Eq_31100 *) 0x0080;
					if ((s8_187 & 252) == 0x0080)
					{
						word32 a0_317;
						Eq_2 s2_322;
						word32 a2_1440;
						word32 a4_1441;
						ke_state_get(0x04, dwLoc28, out a0_317, out a2_1440, out a4_1441, out s2_322);
						if (a0_317 == 0x01)
						{
							s6 = (struct Eq_31306 *) 0x01;
							s4_218.u0 = 0x04;
						}
						else
						{
							s6 = null;
							s4_218.u0 = 0x00FF;
						}
						a4_1217.u0 = 0x00FF;
						if (s2_322 != 0x00FF)
						{
							if ((word32) *((word16) s10.u0 + 88) != 0x00)
								ra_163 = me_beacon_check(ra_163, (word32) g_b4201B9D2, s3_193, s0, s2_322, s8_187, fflags, frm, mstatus, dwArg08, dwArg0138, out a3_215, out a4_1217, out s3_193, out s4_218, out s5_168, out s6, out s7);
						}
						else
						{
							word32 a0_334;
							word32 a4_1447;
							word32 a2_1446;
							word32 s2_1448;
							ke_state_get(0x04, dwLoc28, out a0_334, out a2_1446, out a4_1447, out s2_1448);
							a4_1217.u0 = 0x01;
							if (a0_334 != 0x01 && apm_embedded_enabled(s10, out a4_1217) != 0x00)
							{
l23009C0C:
								s6 = (struct Eq_31306 *) 0x01;
								s4_218.u0 = 0x07;
								goto l23009C10;
							}
						}
						if (s4_218 != 0x00FF)
							goto l23009C10;
						goto l23009AF0;
					}
					a3_215 = (struct Eq_31100 *) 0x00A0;
					if ((s8_187 & 252) != 0x00A0)
						goto l23009AF0;
l23009B64:
					a3_215 = (struct Eq_31100 *) 0x00FF;
					s4_238.u0 = 0x00;
					if (s2_165 == (struct Eq_27384 *) 0x00FF)
						goto l23009C9A;
					goto l23009B6E;
				}
				a3_215 = (struct Eq_31100 *) 0x00C0;
				if ((s8_187 & 252) == 0x00C0)
					goto l23009B64;
				if ((s8_187 & 252) != 0x00D0)
					goto l23009AF0;
				a3_215 = (word32) s0 + s9_189;
				if (s2_165 == (struct Eq_27384 *) 0x00FF)
				{
l23009AF0:
					word32 s5_1439;
					a1 = rxu_mpdu_upload_and_indicate.constprop.11(a3_215, mstatus, s10, out a4_1217, out a5_1220, out s5_1439);
					goto l23009AF6;
				}
				word32 a5_231 = (word32) a3_215->b0000;
				if (a5_231 != 0x07)
				{
					if (a5_231 != 0x08)
					{
						a4_1217.u0 = 0x03;
						if (a5_231 != 0x03)
							goto l23009AF0;
						s4_218.u0 = 0x08;
					}
					else
					{
						a5_1220 = s3_193 - s9_189;
						a4_1217.u0 = 0x03;
						s4_238.u0 = 0x00;
						if (a5_1220 <= (struct Eq_27384 *) 0x03)
							goto l23009C9A;
						struct Eq_31772 * a4_301 = (word32) g_b4201B9D2;
						if (a4_301 == (struct Eq_31772 *) 0x00FF)
							goto l23009AF0;
						a4_1217 = (word32) a3_215->b0001;
						if (((word32) a4_301->b4201AA3E | a4_1217) != 0x00)
							goto l23009AF0;
						s4_218.u0 = 0x06;
					}
					s6 = null;
					goto l23009C10;
				}
				Eq_27386 a2_244;
				word32 a5_233 = (word32) a3_215->b0001;
				if (a5_233 != 0x00)
				{
					if (a5_233 != 0x01)
						goto l23009AF0;
					int32 a5_252 = s2_165->dw420191BC;
					a4_1217 = (char *) &s2_165->t0000 + 432;
					s4_238.u0 = 0x00;
					a5_1220 = a5_252 & 0x02;
					if ((a5_252 & 0x02) == 0x00)
						goto l23009C9A;
					a2_244.u0 = 0x00FF;
					if (((word32) a3_215->b0002 & 0x01) != 0x00)
						a2_244.u0 = 0x00;
					a1.u0 = 0x00FF;
l23009C68:
					word32 s5_1453;
					word32 s3_1452;
					word32 s1_1451;
					me_sta_bw_nss_max_upd(s2_165, a1, a2_244, dwArg58, out s1_1451, out a1, out a4_1217, out a5_1220, out s3_1452, out s4_238, out s5_1453, out s6, out s7);
					goto l23009C9A;
				}
				int32 a5_240 = s2_165->dw420191BC;
				a4_1217 = (char *) &s2_165->t0000 + 432;
				s4_238.u0 = 0x00;
				a5_1220 = a5_240 & 0x02;
				if ((a5_240 & 0x02) == 0x00)
					goto l23009C9A;
				a1 = (word32) a3_215->b0002;
				a5_1220 = (struct Eq_27384 *) 0x01;
				a2_244.u0 = 0x00FF;
				if (a1 <= 0x01)
					goto l23009C68;
				goto l23009C9A;
			}
			a5_1220 = (word32) s2_165->b420190EA;
			g_b4201B9D2 = (byte) a5_1220;
		}
		a5_1220 = (struct Eq_27384 *) ((char *) &a5_1220->t0000 + 0x05D8);
		s10 = &a5_1220->b420191C1 + 4687;
		a4_1217 = (word32) a5_1220->b4201A466;
		goto l23009ACC;
	}
	if ((s5_31->dw0040 & 0x0600) != 0x00)
	{
l23009A6A:
		g_b4201C9D2 = (byte) a5_43;
		goto l23009A72;
	}
	word32 a5_50;
	Eq_2 a3_48 = g_t4201AFC8;
	if (a4_1217 != 0x00B0)
	{
		a5_50 = 0x01;
		if (a4_1217 != 0x00)
		{
l23009A12:
			while (a3_48 != 0x00)
			{
				if ((word32) *((word32) a3_48 + 80) == (word32) (*((word32) s0 + 4)) && ((word32) (*((word32) a3_48 + 81)) == (word32) (*((word32) s0 + 5)) && ((word32) (*((word32) a3_48 + 82)) == (word32) (*((word32) s0 + 6)) && ((word32) (*((word32) a3_48 + 83)) == (word32) (*((word32) s0 + 7)) && ((word32) (*((word32) a3_48 + 84)) == (word32) (*((word32) s0 + 8)) && (word32) (*((word32) a3_48 + 0x0055)) == (word32) (*((word32) s0 + 9)))))))
				{
					word32 a4_84 = (word32) *((word32) a3_48 + 86);
					if (a4_84 == 0x00)
					{
						if (a5_50 != 0x00)
							goto l23009A66;
					}
					else if (a4_84 == 0x02 && a5_50 == 0x00)
					{
l23009A66:
						a5_43 = (word32) *((word32) a3_48 + 87);
						goto l23009A6A;
					}
				}
				a3_48 = *a3_48;
			}
			a5_43 = a1;
			goto l23009A6A;
		}
	}
	a5_50 = 0x01;
	if ((word32) *((word32) s0 + 4) == (word32) (*((word32) s0 + 16)) && ((word32) (*((word32) s0 + 5)) == (word32) (*((word32) s0 + 0x0011)) && ((word32) (*((word32) s0 + 6)) == (word32) (*((word32) s0 + 18)) && ((word32) (*((word32) s0 + 7)) == (word32) (*((word32) s0 + 19)) && (word32) (*((word32) s0 + 8)) == (word32) (*((word32) s0 + 20))))))
		a5_50 = (word32) (*((word32) s0 + 9) - *((word32) s0 + 21) != 0x00);
	goto l23009A12;
}

// 23009DA6: void rxu_cntrl_init()
// Called from:
//      rxl_init
void rxu_cntrl_init()
{
	co_list_init(&g_dw4201BA08);
	co_list_init(&g_t4201BA00);
	co_list_init(&g_t4201BA14);
	co_list_init(&g_t4201BA1C);
	g_w4201CA2A = ~0x00;
}

