pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 23009DEA: Register Eq_2 rxu_cntrl_frame_handle(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg010C, Stack Eq_2 dwArg0118, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s10Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      rxl_cntrl_evt
Eq_2 rxu_cntrl_frame_handle(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s10, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg010C, Eq_2 dwArg0118, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, union Eq_2 & s10Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	ptr32 s3_1134;
	Eq_2 s6_1127 = *((word32) a0 + 4);
	Eq_2 s5_1112 = *((word32) s6_1127 + 64);
	Eq_2 s0_1055 = 0x4201B9C8;
	Eq_2 a5_1028 = s5_1112 << 0x12;
	if (s5_1112 << 0x12 >= 0x00)
	{
l23009E1C:
		s3_1134 = 0x00;
		goto l2300A056;
	}
	ui32 s8_38 = (word32) *s1;
	((word32) s6_1127 + 76)->u0 = 0x00;
	g_b4201B9D1 = ~0x00;
	g_b4201B9D2 = ~0x00;
	g_w4201B9C8 = (word16) ((word32) *((word32) s1 + 1) << 8 | (word32) (*s1));
	ui32 a5_47 = (word32) *((word32) s1 + 23);
	ui32 a4_48 = (word32) *((word32) s1 + 22);
	g_b4201B9F8 = 0x00;
	g_w4201B9CA = (word16) (a5_47 << 8 | a4_48);
	uint32 a5_56 = (word32) *((word32) s1 + 23) << 8 | (word32) (*((word32) s1 + 22));
	g_w4201B9CC = (word16) (a5_56 >> 0x04);
	g_b4201B9CE = (byte) (a5_56 & 0x0F);
	Eq_2 s2_35 = a0;
	ui32 a5_64 = (word32) *((word32) s1 + 1) << 8 | (word32) (*s1);
	if ((a5_64 & 0x0088) == 0x0088)
	{
		ui32 a5_70;
		if ((a5_64 & 0x0300) == 0x0300)
			a5_70 = (word32) *((word32) s1 + 30);
		else
			a5_70 = (word32) *((word32) s1 + 24);
		g_b4201B9CF = (byte) (a5_70 & 0x07);
	}
	else
		g_b4201B9CF = 0x00;
	word32 a5_100;
	struct Eq_31100 * a3_1139;
	g_b4201B9D0 = (byte) rxu_cntrl_machdr_len_get((word32) *s1.u0 | (word32) (*((word16) s1.u0 + 1)) << 8, out a3_1139);
	if (((word32) *((word16) s1.u0 + 1) & 0x01) != 0x00)
	{
		g_t4201B9EC = (word16) (word32) *((word32) s1 + 16);
		g_w4201B9EE = (word16) (word32) *((word32) s1 + 18);
		a5_100 = (word32) *((word32) s1 + 20);
	}
	else
	{
		g_t4201B9EC = (word16) (word32) *((word32) s1 + 4);
		g_w4201B9EE = (word16) (word32) *((word32) s1 + 6);
		a5_100 = (word32) *((word32) s1 + 8);
	}
	word32 a5_114;
	g_w4201B9F0 = (word16) a5_100;
	ui32 a5_108 = (word32) *((word16) s1.u0 + 1) << 8 | (word32) (*s1.u0);
	if ((a5_108 & 0x0200) != 0x00)
	{
		if ((a5_108 & 0x0100) != 0x00)
		{
			g_w4201B9F2 = (word16) (word32) *((word32) s1 + 24);
			g_w4201B9F4 = (word16) (word32) *((word32) s1 + 26);
			a5_114 = (word32) *((word32) s1 + 28);
		}
		else
		{
			g_w4201B9F2 = (word16) (word32) *((word32) s1 + 16);
			g_w4201B9F4 = (word16) (word32) *((word32) s1 + 18);
			a5_114 = (word32) *((word32) s1 + 20);
		}
	}
	else
	{
		g_w4201B9F2 = (word16) (word32) *((word32) s1 + 0x0A);
		g_w4201B9F4 = (word16) (word32) *((word32) s1 + 0x0C);
		a5_114 = (word32) *((word32) s1 + 0x0E);
	}
	Eq_2 a1_1039;
	g_w4201B9F6 = (word16) a5_114;
	if (s5_1112 << 0x06 >= 0x00)
	{
		if ((word32) g_b4201BA37 != 0x00 && ((s5_1112 & 0x0200) == 0x00 && ((word32) g_t4201BA30 == (word32) (*((word32) s1 + 0x0A)) && ((word32) g_b4201BA31 == (word32) (*((word32) s1 + 11)) && ((word32) g_t4201BA32 == (word32) (*((word32) s1 + 0x0C)) && ((word32) g_b4201BA33 == (word32) (*((word32) s1 + 0x0D)) && ((word32) g_t4201BA34 == (word32) (*((word32) s1 + 0x0E)) && (word32) g_b4201BA35 == (word32) (*((word32) s1 + 0x0F)))))))))
		{
			a3_1139 = (struct Eq_31100 *) 0x01000400;
			if ((((word32) *((word32) s1 + 1) << 8 | (word32) (*s1)) & 0x01000400) == 0x01000000)
				g_t4201BA36.u0 = 0x01;
			else
				g_t4201BA36.u0 = 0x00;
		}
		if ((s8_38 & 0x0C) != 0x00)
		{
			if ((s8_38 & 0x0C) == 0x08)
			{
				struct Eq_32357 * a0_1136 = vif_mgmt_get_first_ap_inf();
				if (a0_1136 != null)
				{
					a3_1139 = (word32) *((word32) s1 + 4);
					if (a3_1139 == (word32) a0_1136->b0050)
					{
						a3_1139 = (word32) *((word32) s1 + 5);
						if (a3_1139 == (word32) a0_1136->b0051)
						{
							a3_1139 = (word32) *((word32) s1 + 6);
							if (a3_1139 == (word32) a0_1136->b0052)
							{
								a3_1139 = (word32) *((word32) s1 + 7);
								if (a3_1139 == (word32) a0_1136->b0053)
								{
									a3_1139 = (word32) *((word32) s1 + 8);
									if (a3_1139 == (word32) a0_1136->b0054 && (word32) (*((word32) s1 + 9)) == (word32) a0_1136->b0055)
									{
										apm_send_mlme(ra, a0_1136, (struct Eq_32421 *) 0x00C0, (word32) s1 + 0x0A, 0x00, (struct Eq_31105 *) 0x01, fflags, frm, mstatus, dwLoc18, dwArg24, dwArg38, dwArg68, dwArg88, dwArg94, dwArg9C, dwArgA8, dwArgC8, dwArgD8, dwArg0118, out a1, out a4, out a5_1028, out s5_1112, out s6_1127, out s7, out s10);
										goto l23009E1C;
									}
								}
							}
						}
					}
				}
			}
			a1 = rxu_mpdu_upload_and_indicate.constprop.11(a3_1139, mstatus, s6, out a4, out a5_1028, out s5_1112);
			s3_1134 = 0x01;
l2300A056:
			if (a5_1028 != 0x00)
			{
				word32 a5_2652;
				a4 = ke_evt_set(0x20000000, a4, mstatus, out a5_2652);
			}
			0x00 = (uint16) dwArg010C;
			s0Out = dwArgCC;
			s1Out = dwLoc4C;
			a0Out = s3_1134;
			a1Out = a1;
			a3Out = s2;
			a4Out = a4;
			s3Out = s3_1134;
			s4Out = dwArg0168;
			s5Out = s5_1112;
			s6Out = s6_1127;
			s7Out = s7;
			s10Out = s10;
			fflagsOut = fflags;
			frmOut = frm;
			return dwLoc08;
		}
		if (((word32) *((word32) s1 + 1) >> 3 & 0x01) != 0x00 && (word32) g_w4201BA2A == ((word32) (*((word16) s1.u0 + 23)) << 8 | (word32) (*((word16) s1.u0 + 22))))
		{
			word32 a2_2684;
			word32 a3_2685;
			if (memcmp(s1 + 0x0A, 1107409444, 0x06, out a1, out a2_2684, out a3_2685, out a4, out a5_1028) == 0x00)
				goto l23009E1C;
		}
		g_w4201BA2A = (word16) ((word32) *((word16) s1.u0 + 23) << 8 | (word32) (*((word16) s1.u0 + 22)));
		word32 a2_2678;
		word32 a5_2681;
		word32 a4_2680;
		word32 a6_2682;
		word32 a3_2679;
		word32 a7_2683;
		memcpy(1107409444, s1 + 0x0A, 0x06, out a1, out a2_2678, out a3_2679, out a4_2680, out a5_2681, out a6_2682, out a7_2683);
		if ((word32) g_w4201B9C8 << 0x11 < 0x00)
		{
			a5_1028 = s5_1112 & 28;
			a4.u0 = 0x14;
			if ((s5_1112 & 28) != 0x14)
				goto l23009E1C;
			word32 a2_2686;
			word32 a3_2687;
			if (rxu_cntrl_protected_handle(s1, s5_1112, out a1, out a2_2686, out a3_2687, out a4, out a5_1028) == 0x00)
				goto l23009E1C;
		}
		a1_1039.u0 = 0x00FF;
l2300A0BA:
		s3_1134 = rxu_mgt_frame_check(ra, s0_1055, a0, a1_1039, s10, fflags, frm, mstatus, dwLoc48, dwArg08, dwArgE8, out a1, out a4, out a5_1028, out s5_1112, out s6_1127, out s7, out s10, out fflags, out frm);
		goto l2300A056;
	}
	uint32 s7_135 = (s5_1112 >> 0x0F) + ~0x07;
	a4 = (s7_135 & 0x00FF) + 432;
	s7 = s7_135 & 0x00FF;
	a5_1028 = (word32) a4 + 0x42018F20;
	s3_1134 = (word32) *((word32) a4 + 1107398461);
	if (s3_1134 == 0x00)
		goto l23009E1C;
	struct Eq_32460 * a5_144 = (word32) *((word32) a4 + 1107398458);
	g_t4201B9E0 = s5_1112;
	g_b4201B9D2 = (byte) a5_144;
	g_b4201B9D1 = (byte) (s7_135 & 0x00FF);
	Eq_2 a3_145 = 0x05D8;
	s5_1112.u0 = 0x4201A410;
	if ((word32) a5_144->b4201AA3E == 0x02 && ((word32) g_t4201B9EC & 0x01) == 0x00)
	{
		word32 a4_2653;
		g_b4201B9D3 = (byte) hal_machw_search_addr(&g_t4201B9EC, out a3_145, out a4_2653);
	}
	if ((s8_38 & 0x0300) == 0x0300)
		*((word32) s6_1127 + 76) |= 4;
	ui32 a5_184 = (word32) g_w4201B9C8;
	a4 = a5_184 << 0x11;
	if (a5_184 << 0x11 < 0x00)
	{
		s0_1055 = *((word32) a1 + 24);
		if (rxu_cntrl_protected_handle(s1, a1, out a1, out a2, out a3_145, out a4, out a5_1028) == 0x00)
			goto l23009E1C;
	}
	s6_1127 = s8_38 & 0x0C;
	if ((s8_38 & 0x0C) == 0x00)
	{
		a4 = (word32) *((word32) s0_1055 + 2);
		if (s8_38 << 0x14 < 0x00)
		{
			a5_1028 = (word32) (s7_135 & 0x00FF)->w42019258;
			if (a5_1028 == a4)
				goto l23009E1C;
		}
		s7 = (s7_135 & 0x00FF) + 432;
		ui32 a5_227 = (word32) *((word32) s0_1055 + 48);
		*((word32) s7 + 0x420190A8) = (word16) a4;
		a1.u0 = 432;
		if ((a5_227 & 0x02) != 0x00)
		{
			s0_1055 = *((word32) a3_145 + 16);
			a5_1028 = *((word32) a2 + 0x0044);
			if (a2 >= a4)
			{
				if (a2 != a4)
					goto l23009E1C;
				a5_1028 = *((word32) a2 + 64);
				if (a2 >= a3_145)
					goto l23009E1C;
			}
			*((word32) a3_145 + 64) = a5_1028;
			*((word32) a4 + 0x0044) = a5_1028;
		}
		a1_1039 = (word32) *((word32) s0_1055 + 9);
		goto l2300A0BA;
	}
	a5_1028.u0 = 0x08;
	if ((s8_38 & 0x0C) != 0x08)
		goto l23009E1C;
	if ((s8_38 & 64) != 0x00)
	{
		a4 = mm_cfg_element_keepalive_timestamp_update(a4, out a5_1028);
		goto l23009E1C;
	}
	ui32 a5_265;
	if ((s8_38 & 0x0080) != 0x00)
		a5_265 = (word32) *((word32) s0_1055 + 7) + 0x00C5 + ((s7_135 & 0x00FF) + 0x00D8) << 1;
	else
		a5_265 = (s7_135 & 0x00FF) + 0x0338;
	a5_1028 = a5_265 + 0x42018F20;
	Eq_2 a3_279 = (word32) *((word32) s0_1055 + 2);
	if (s8_38 << 0x14 < 0x00)
	{
		a4 = (word32) *a5_1028.u0;
		if (a4 == a3_279)
			goto l23009E1C;
	}
	*a5_1028.u0 = (word16) a3_279;
	a4 = (word32) *((word32) s0_1055 + 0x0A);
	if (((word32) *((word32) s0_1055 + 48) & 0x02) != 0x00)
	{
		struct Eq_32618 * a5_288 = (word32) *((word32) s0_1055 + 7);
		s0_1055 = a5_288->t0020;
		a5_1028 = ((Eq_362987[]) 4)[a5_288].t0000;
		if (a5_288 << 0x03 >= a3_279)
		{
			if (a5_288 << 0x03 != a3_279)
				goto l23009E1C;
			a5_1028 = null[a5_288].t0000;
			if (a5_288 << 0x03 >= a1)
				goto l23009E1C;
		}
		*a1 = a5_1028;
		*((word32) a3_279 + 4) = a5_1028;
	}
	if ((word32) *((word32) a4 + 0x4201ADD0) != 0x00 || g_t4201B9C4 != 0x00)
	{
		Eq_2 s8_348 = (word32) s1 + (word32) (*((word32) s0_1055 + 8));
		struct Eq_32711 * a3_352;
		word32 a2_2654;
		word32 a5_2656;
		word32 a4_2655;
		if (memcmp(s8_348, 0x2308DD80, 0x06, out a1, out a2_2654, out a3_352, out a4_2655, out a5_2656) == 0x00 && (word32) (*((word32) s8_348 + 6)) == 0x08FFFE88)
		{
			a1 = (s7_135 & 0x00FF) + 432;
			a4 = (word32) *((word16) a1.u0 + 1107398458);
			s5_1112 = (word32) a4 + 1107405288;
			if ((word32) *((word32) a4 + 1107405374) == 0x00)
			{
				a5_1028 = a3_352->t0008;
				if ((word32) a3_352->b0005 == 0x00)
					goto l23009E1C;
				*((word32) a5_1028 + 1) = (byte) (s7_135 & 0x00FF);
				*((word32) a5_1028 + 2) = (byte) a4;
			}
			else
			{
				*((word32) g_t4201B9C4 + 1) = (byte) (s7_135 & 0x00FF);
				*((word32) g_t4201B9C4 + 2) = (byte) (word32) *((word16) a1.u0 + 1107398458);
				a5_1028 = g_t4201B9C4;
			}
			word32 a4_849 = (word32) *((word32) s0_1055 + 8);
			dwLoc4C = a5_1028;
			a5_1028 = ProcessEAPoLPkt(ra, (word16) a1.u0 + 0x42018F20, (word32) a4 + 1107405288, s8_38 & 0x0C, fflags, frm, mstatus, (word32) s1 + (a4_849 + 0x08), SEQ(wLoc42, (word16) (~0x07 - a4_849 + (word32) (*((word32) (*((word32) a0 + 4)) + 28)))), s4, dwLoc28, dwLoc08, dwArg18, dwArg28, dwArg38, s7, s5, dwArg58, dwArg68, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA4, dwArgA8, dwArgB8, dwArgD8, dwArgF8, dwArg0104, out a1, out a4, out s5_1112, out s6_1127, out s7, out s10)->t0120;
			goto l23009E1C;
		}
	}
	a5_1028 = 0x0D - g_dw42018EEC;
	a4.u0 = 0x05;
	if (a5_1028 <= 0x05)
		goto l23009E1C;
	ui32 a5_366 = (word32) *s0_1055;
	a5_1028 = a5_366 & 0x0400;
	if ((a5_366 & 0x0400) != 0x00)
		goto l23009E1C;
	a5_1028 = (word32) *((word32) s0_1055 + 6);
	if (a5_1028 != 0x00)
		goto l23009E1C;
	if (((word32) *((word32) s0_1055 + 48) & 0x01) != 0x00)
	{
		struct Eq_32974 * s2_403;
		word32 s8_2660;
		word32 s1_2657;
		word32 s4_2659;
		word32 s3_2658;
		struct Eq_24070 * s0_401 = me_mic_init(fp + -72, &g_t4201B9EC, &g_w4201B9F2, (word32) *((word32) *((word16) a1.u0 + 32) + 7), out s1_2657, out s2_403, out s3_2658, out s4_2659, out s8_2660);
		struct Eq_32999 * a5_408 = s2_403->ptr0004;
		struct Eq_33003 * s1_409 = (word32) s0_401->b0008;
		s7 = a5_408->t0008;
		struct Eq_31105 * s9_414 = (struct Eq_31105 *) 848;
		s5_1112 = (word32) (word16) (~0x07 - s1_409 + (word32) a5_408->w001C);
		s10.u0 = 848;
		do
		{
			Eq_2 s8_425 = s5_1112;
			word32 a1_426 = Mem315[s7 + 8:int32] + s1_409;
			if (s9_414 < s5_1112 + s1_409)
				s8_425 = (word32) (word16) (s10 - s1_409);
			word32 s1_451;
			word32 s8_459;
			word32 a1_2661;
			word32 s4_2663;
			word32 a2_2662;
			me_mic_calc(fp + -72, a1_426, s8_425, s4, dwArgD8, out s1_451, out a1_2661, out a2_2662, out s2_35, out s3_1134, out s4_2663, out s5_1112, out s6_1127, out s7, out s8_459, out s9_414, out s10);
			if (s5_1112 == 0x00)
			{
				byte * a3_1269 = fp + -80;
				s1 = (word32) (word16) (s1_451 + s8_459);
				do
				{
					Eq_2 a1_1270 = s6_1127;
					word32 a4_476 = Mem470[s7 + 8:int32] + s1;
					if (s6_1127 + s1 > 848)
					{
						s1 = 848 - s1;
						a1_1270 = (word32) (word16) s1;
					}
					Eq_2 a5_482 = 0x00;
					while (true)
					{
						word32 a2_485 = a5_482 + a3_1269;
						if (a5_482 == a1_1270)
							break;
						*a2_485 = (byte) (word32) *((word32) a5_482 + a4_476);
						a5_482 = (word32) a5_482 + 1;
					}
					s6_1127 = (word32) (word16) (s6_1127 - a5_482);
					a3_1269 = a2_485;
					if (s6_1127 == 0x00)
					{
						Eq_2 a4_509;
						Eq_2 a5_510;
						word32 a2_2675;
						word32 a3_2676;
						me_mic_end(s1, fp + -72, out a2_2675, out a3_2676, out a4_509, out a5_510);
						0x00 = (uint16) dwArg74;
						s0_1055 = dwArg94;
						if (a4_509 == a5_510 && a4_509 == a5_510)
							goto l2300A4FA;
						Eq_2 a0_728;
						struct Eq_33456 * s0_736;
						word32 s4_740;
						word32 a5_2693;
						word32 a1_2689;
						word32 s1_2688;
						word32 a2_2690;
						word32 a3_2691;
						word32 a4_2692;
						word32 a6_2694;
						word32 s2_2695;
						word32 s8_2697;
						word32 s3_2696;
						ke_msg_alloc(ra, 0x01000406, 0x0D, 0x18, a4_509, mstatus, s6, out s0_736, out s1_2688, out a0_728, out a1_2689, out a2_2690, out a3_2691, out a4_2692, out a5_2693, out a6_2694, out s2_2695, out s3_2696, out s4_740, out s8_2697);
						struct Eq_33486 * a4_752;
						struct Eq_33487 * a2_756;
						struct Eq_33488 * a3_757;
						word32 a6_2700;
						word32 a7_2701;
						word32 a5_2699;
						word32 a1_2698;
						memcpy(a0_728, (word32) s0_736->b0009 + 432 + s4_740 + 0x1E, 0x06, out a1_2698, out a2_756, out a3_757, out a4_752, out a5_2699, out a6_2700, out a7_2701);
						a2_756->t0008 = a0_728;
						a3_757->t000C = a0_728;
						struct Eq_33518 * s0_769 = a4_752->ptr0018;
						((word32) a0_728 + 16)->u1 = (byte) (a4_752 >> 0x0A & 0x01);
						struct Eq_33530 * a4_773 = (word32) s0_769->b000A;
						*((word32) a0_728 + 18) = (byte) a4_773;
						*((word32) a0_728 + 0x0011) = (byte) (word32) a4_773->b0061;
						word32 a0_2703;
						word32 s1_2702;
						word32 a2_2704;
						word32 a3_2705;
						word32 s2_2706;
						word32 s3_2707;
						word32 s8_2709;
						word32 s4_2708;
						ke_msg_send(a0_728, mstatus, out s1_2702, out a0_2703, out a1, out a2_2704, out a3_2705, out a4, out a5_1028, out s2_2706, out s3_2707, out s4_2708, out s8_2709);
						goto l23009E1C;
					}
					s7 = *((word32) s7 + 4);
					s1.u0 = 0x00;
				} while (s7 != 0x00);
				break;
			}
			s7 = *((word32) s7 + 4);
			s1_409 = null;
		} while (s7 != 0x00);
		word32 a2_2677;
		assert_rec(mstatus, out a2_2677, out a4, out a5_1028);
		a1.u0 = 587678428;
		goto l23009E1C;
	}
l2300A4FA:
	ui32 a4_528 = (word32) *((word32) s0_1055 + 11);
	ui32 s4_529 = (word32) *((word32) s0_1055 + 8);
	((word32) *((word32) s0_1055 + 9) << 16 | (word32) (*((word32) s0_1055 + 0x0A)) << 8 | a4_528 << 24 | a4_528 << 24)->dw004C = ((Eq_362989[]) 76)[a4_528].dw0000;
	word32 a3_537 = ((Eq_362990[]) 76)[a4_528].dw0000;
	struct Eq_32951 * a2_541 = a4_528 << 24 & -113;
	a2_541->dw004C = a3_537;
	ui32 a5_546 = (word32) *((word32) s1 + 1) << 8 | (word32) (*s1);
	if ((a5_546 & 252) == 0x0088)
	{
		ui32 a4_551;
		ui32 a5_552;
		if ((a5_546 & 0x0300) == 0x0300)
		{
			a4_551 = (word32) *((word32) s1 + 30);
			a5_552 = (word32) *((word32) s1 + 31);
		}
		else
		{
			a4_551 = (word32) *((word32) s1 + 24);
			a5_552 = (word32) *((word32) s1 + 25);
		}
		ui32 a5_558 = a5_552 << 8 | a4_551;
		struct Eq_33114 * a4_563 = (a5_558 & 7) << 4 | a2_541;
		if ((a5_558 & 0x0080) != 0x00)
		{
			(a4_563 | 1)->dw004C = a3_537;
			goto l2300A5EC;
		}
		a4_563->dw004C = a3_537;
	}
	struct Eq_33069 * a4_610;
	s5_1112 = (word32) (word16) s4_529;
	Eq_2 s1_575 = (word32) s1 + (s5_1112 & 0x00FE);
	word32 a4_2667;
	word32 a2_2665;
	word32 a3_2666;
	word32 a1_2664;
	word32 a5_2668;
	if (memcmp(s1_575, 0x2308DD80, 0x06, out a1_2664, out a2_2665, out a3_2666, out a4_2667, out a5_2668) != 0x00 || (word32) (*((word32) s1_575 + 6)) == 0x08000137)
	{
		word32 a2_2670;
		word32 a3_2671;
		word32 a5_2673;
		word32 a4_2672;
		word32 a1_2669;
		if (memcmp(s1_575, 587783544, 0x06, out a1_2669, out a2_2670, out a3_2671, out a4_2672, out a5_2673) != 0x00)
		{
			uint32 a5_614 = (word32) (word16) ((word32) *((word32) *((word32) s2_35 + 4) + 28) - s5_1112);
			((word32) s1_575 + 0x0FFE)->u1 = (byte) a5_614;
			((word32) s1_575 + 0x0FFF)->u1 = (byte) (a5_614 >> 8);
			((word32) s0_1055 + 49)->u1 = 0x01;
			s4_529 = s4_529 + ~0x0D & 0x00FF;
			a4_610 = (word32) s1_575 - 0x0E;
l2300A5AA:
			a4_610->w0000 = (word16) (word32) *((word32) s0_1055 + 36);
			a4_610->w0002 = (word16) (word32) *((word32) s0_1055 + 38);
			a4_610->w0004 = (word16) (word32) *((word32) s0_1055 + 40);
			a4_610->w0006 = (word16) (word32) *((word32) s0_1055 + 42);
			a4_610->w0008 = (word16) (word32) *((word32) s0_1055 + 44);
			a4_610->w000A = (word16) (word32) *((word32) s0_1055 + 46);
l2300A5EC:
			Eq_2 a4_649 = *((word32) s2_35 + 4);
			*((word32) a4_649 + 28) = (word16) ((word32) *((word32) a4_649 + 28) - s4_529);
			Eq_2 a5_656 = *((word32) s2_35 + 4);
			((word32) s0_1055 + 50)->u1 = (byte) s4_529;
			*((word32) a5_656 + 84) = s4_529;
			g_dw4201CA40 = s4_529;
			Eq_2 s2_700;
			word32 a5_2674;
			a4 = rxl_mpdu_transfer(s2_35, mstatus, dwLoc18, out a5_2674, out s2_700);
			__csrrc(mstatus, 0x08);
			Eq_2 a5_703 = *((word32) s2_700 + 4);
			((word32) s2_700 + 28)->u1 = 0x03;
			*((word32) s2_700 + 20) = a4;
			a5_1028 = (word32) *((word32) a5_703 + 28);
			*((word32) s2_700 + 24) = a5_1028;
			__csrrc(mstatus, 0x08);
			co_list_push_back(s2_700, a5_1028);
			__csrrs(mstatus, 0x08);
			__csrrs(mstatus, 0x08);
			a1 = s2_700;
			goto l2300A056;
		}
	}
	((word32) s0_1055 + 49)->u1 = 0x00;
	a4_610 = (word32) s1_575 - 6;
	s4_529 = s4_529 + ~0x05 & 0x00FF;
	goto l2300A5AA;
}

// 2300A68C: void rxu_cntrl_monitor_pm(Register (ptr32 Eq_21234) a0)
// Called from:
//      txl_payload_handle_backup
void rxu_cntrl_monitor_pm(struct Eq_21234 * a0)
{
	if ((word32) g_b4201BA37 == 0x00)
	{
		g_t4201BA30 = (word16) (word32) a0->w0000;
		g_t4201BA32 = (word16) (word32) a0->w0002;
		g_t4201BA34 = (word16) (word32) a0->w0004;
		g_t4201BA36.u1 = 0x0100;
	}
}

// 2300A6BC: Register word32 rxu_cntrl_get_pm()
// Called from:
//      txu_cntrl_cfm
//      me_sta_add_req_handler
word32 rxu_cntrl_get_pm()
{
	g_t4201BA36.u1 = 0x00;
	return 0x4201B9C8;
}

// 2300A6CE: void rxu_cntrl_evt(Register Eq_2 a4, Register ptr32 mstatus)
void rxu_cntrl_evt(Eq_2 a4, ptr32 mstatus)
{
	ke_evt_clear(0x00080000, a4, mstatus);
	if (g_dw4201BA08 == 0x00)
		return;
	word32 a5_27;
	ke_evt_set(0x20000000, a4, mstatus, out a5_27);
}

// 2300A6F6: void rxu_swdesc_upload_evt(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a4, Register ptr32 s7, Register ptr32 s8, Register ptr32 s9, Register ptr32 s10, Register ptr32 s11, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack word32 dwArg58, Stack word32 dwArgB4, Stack word32 dwArgD4, Stack word32 dwArgF4, Stack word32 dwArg0114)
void rxu_swdesc_upload_evt(Eq_2 ra, Eq_2 s0, Eq_2 a4, ptr32 s7, ptr32 s8, ptr32 s9, ptr32 s10, ptr32 s11, ptr32 fflags, ptr32 frm, ptr32 mstatus, word32 dwArg58, word32 dwArgB4, word32 dwArgD4, word32 dwArgF4, word32 dwArg0114)
{
	struct Eq_33683 * a5_207;
	Eq_2 s0_208 = co_list_pop_front(a4, ke_evt_clear(0x20000000, a4, mstatus), out a5_207);
	ptr32 s5_158 = fp + -56;
	word32 s4_157 = 0x01;
	Eq_33697 s6_159 = 847;
	Eq_2 s3_113 = 0x42018ED8;
	while (s0_208 != 0x00)
	{
		Eq_33697 s1_221 = (word32) a5_207->w001C;
		struct Eq_33706 * a1_46;
		struct Eq_33707 * a5_50;
		word32 a4_384;
		word32 a0_382;
		word32 a2_383;
		word32 t1_381;
		Eq_33712 a3_104;
		Eq_2 ra_51 = memset(ra, fp + -72, 0x00, 40, out t1_381, out a0_382, out a1_46, out a2_383, out a3_104, out a4_384, out a5_50);
		struct Eq_33727 * s0_54 = a5_50->ptr0004;
		ptr32 a4_55 = fp + -72;
		struct Eq_33734 * a2_56 = fp + -72;
		struct Eq_33736 * a5_57 = a5_50->ptr0008;
		while (s1_221 != 0x00 && a4_55 != s5_158)
		{
			struct Eq_33859 * a3_63 = (word32) s0_54->b001D;
			s0_54->b001D = (byte) ((char *) &a3_63->ptr0000 + 1);
			a1_46->ptr0000 = a4_55;
			struct Eq_33873 * a5_69 = a3_63->ptr000D;
			Mem73[a2_56 + 32:word16] = SLICE(a3_63 + 0x02 - a1_46, word16, 0);
			a5_69->ptr002C = a4_55;
			a5_69->dw0014 = s4_157;
			a3_104 = &a5_69->dw0014 + 2;
			if (s6_159 < s1_221)
				s1_221 = (word32) s1_221.u0 - 848;
			else
				s1_221.u0 = 0x00;
			a5_57 = a5_69->ptr0004;
			a4_55 += 0x04;
			++a2_56;
		}
		Eq_2 a4_188;
		Eq_2 a5_186;
		a5_57->ptr0004->b001E = (byte) s4_157;
		a5_57->dw0060 = s4_157;
		word32 a0_143;
		Eq_2 a1_144;
		Eq_2 a3_146;
		Eq_2 a4_147;
		struct Eq_16412 * s0_151;
		ra = tcpip_stack_input(ra_51, (word32) *((char *) a2_56[2].ptr0004 + 24), (word32) *((word32) a3_104 + 84) + 28, a3_104, fp + -72, s3_113, s7, s8, s9, s10, s11, fflags, frm, dwLoc48, dwArg58, dwArgB4, dwArgD4, dwArgF4, dwArg0114, out s0_151, out a0_143, out a1_144, out a3_146, out a4_147, out s3_113, out s4_157, out s5_158, out s6_159, out s7, out s8, out s9, out s10, out s11, out fflags, out frm);
		if (a0_143 != 0x00)
		{
			word32 a3_387;
			word32 a1_386;
			rxl_mpdu_free(s0_151, a1_144, a4_147, mstatus, dwLoc48, s0, out a1_386, out a3_387, out a4_188, out a5_186, out s8);
		}
		else
		{
			word32 a5_385;
			vTaskEnterCritical(a4_147, mstatus, out a5_385);
			*((word32) s3_113 + 20) = (word32) *((word32) s3_113 + 20) + (word32) s0_151->b001D;
			vTaskExitCritical(a3_146, mstatus, out a4_188, out a5_186);
		}
		s0_208 = co_list_pop_front(a4_188, a5_186, out a5_207);
	}
}

