pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300A7E4: void scanu_confirm(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus)
// Called from:
//      scanu_scan_next
//      scan_start_cfm_handler
void scanu_confirm(Eq_2 ra, Eq_2 a4, ptr32 mstatus)
{
	byte * a0_27;
	byte * s2_45;
	word32 s3_38;
	Eq_2 a1_16 = (word32) g_w4201BBAC;
	if ((word32) g_t4201BBAE != 0x00)
	{
		Eq_2 a4_53;
		word32 s1_58;
		word32 s0_209;
		word32 a0_210;
		word32 a1_211;
		word32 a2_212;
		word32 a3_213;
		word32 a5_214;
		word32 a6_215;
		word32 s2_216;
		word32 s3_217;
		word32 s4_218;
		word32 s8_219;
		word32 s0_220;
		word32 s1_221;
		word32 a1_222;
		word32 a2_223;
		word32 a3_224;
		word32 a4_225;
		word32 a5_226;
		word32 a6_227;
		word32 s4_228;
		word32 s8_229;
		ke_msg_alloc(ke_msg_alloc(ra, 0x01000003, a1_16, 0x01, a4, mstatus, dwLoc08, out s0_209, out s1_58, out a0_210, out a1_211, out a2_212, out a3_213, out a4_53, out a5_214, out a6_215, out s2_216, out s3_217, out s4_218, out s8_219), s1_58 + 3, 0x0D, 0x01, a4_53, mstatus, dwLoc08, out s0_220, out s1_221, out a0_27, out a1_222, out a2_223, out a3_224, out a4_225, out a5_226, out a6_227, out s2_45, out s3_38, out s4_228, out s8_229);
	}
	else
	{
		word32 a3_202;
		word32 a4_203;
		word32 a2_201;
		word32 s0_198;
		word32 s1_199;
		word32 a1_200;
		word32 a5_204;
		word32 a6_205;
		word32 s2_206;
		word32 s4_207;
		word32 s8_208;
		ke_msg_alloc(ra, 0x01000001, a1_16, 0x01, a4, mstatus, dwLoc08, out s0_198, out s1_199, out a0_27, out a1_200, out a2_201, out a3_202, out a4_203, out a5_204, out a6_205, out s2_206, out s3_38, out s4_207, out s8_208);
		s2_45 = a0_27;
	}
	*s2_45 = (byte) s3_38;
	Eq_2 s2_105;
	word32 s1_241;
	word32 a3_242;
	word32 a4_243;
	word32 a5_244;
	word32 s4_245;
	*ke_msg_free(a0_27 + -0x0C, mstatus, out s1_241, out a3_242, out a4_243, out a5_244, out s2_105, out s4_245) = 0x00;
	Eq_2 s1_119;
	word32 s3_121;
	word32 a0_246;
	word32 a1_247;
	word32 a2_248;
	word32 a3_249;
	word32 a4_250;
	word32 a5_251;
	word32 s2_252;
	word32 s4_253;
	word32 s8_254;
	ke_msg_send(s2_105, mstatus, out s1_119, out a0_246, out a1_247, out a2_248, out a3_249, out a4_250, out a5_251, out s2_252, out s3_121, out s4_253, out s8_254);
	if (s1_119 != 0x00)
	{
		*s1_119 = (byte) s3_121;
		word32 s1_230;
		word32 a0_231;
		word32 a1_232;
		word32 a2_233;
		word32 a3_234;
		word32 a4_235;
		word32 a5_236;
		word32 s2_237;
		word32 s3_238;
		word32 s4_239;
		word32 s8_240;
		ke_msg_send(s1_119, mstatus, out s1_230, out a0_231, out a1_232, out a2_233, out a3_234, out a4_235, out a5_236, out s2_237, out s3_238, out s4_239, out s8_240);
	}
	word32 s1_255;
	word32 a0_256;
	word32 a1_257;
	word32 a4_258;
	word32 a5_259;
	word32 s2_260;
	word32 s3_261;
	word32 s4_262;
	ke_state_set(0x04, 0x00, mstatus, out s1_255, out a0_256, out a1_257, out a4_258, out a5_259, out s2_260, out s3_261, out s4_262);
}

// 2300A86C: Register Eq_2 scanu_raw_send_cfm(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      scanu_raw_send_req_handler
Eq_2 scanu_raw_send_cfm(Eq_2 ra, Eq_2 a1, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, ptr32 & a4Out, ptr32 & a5Out)
{
	Eq_2 a0_17;
	union Eq_2 * s0_25;
	word32 s1_60;
	word32 a1_61;
	word32 a2_62;
	word32 a3_63;
	word32 a4_64;
	word32 a5_65;
	word32 a6_66;
	word32 s2_67;
	word32 s3_68;
	word32 s4_69;
	word32 s8_70;
	Eq_2 ra_24 = ke_msg_alloc(ra, 0x01000006, a1, 0x04, a4, mstatus, dwArg08, out s0_25, out s1_60, out a0_17, out a1_61, out a2_62, out a3_63, out a4_64, out a5_65, out a6_66, out s2_67, out s3_68, out s4_69, out s8_70);
	*s0_25 = (union Eq_2 *) a0_17;
	ptr32 a4_42;
	ptr32 a5_43;
	word32 s1_71;
	word32 a0_72;
	word32 a1_73;
	word32 a2_74;
	word32 a3_75;
	word32 s2_76;
	word32 s3_77;
	word32 s4_78;
	word32 s8_79;
	ke_msg_send(a0_17, mstatus, out s1_71, out a0_72, out a1_73, out a2_74, out a3_75, out a4_42, out a5_43, out s2_76, out s3_77, out s4_78, out s8_79);
	a4Out = a4_42;
	a5Out = a5_43;
	return ra_24;
}

// 2300A88C: Register Eq_2 scanu_init(Register Eq_2 ra, Register ptr32 mstatus)
// Called from:
//      me_init
Eq_2 scanu_init(Eq_2 ra, ptr32 mstatus)
{
	word32 s1_55;
	word32 a0_56;
	word32 a1_57;
	word32 a4_58;
	word32 a5_59;
	word32 s2_60;
	word32 s3_61;
	word32 s4_62;
	ke_state_set(0x04, 0x00, mstatus, out s1_55, out a0_56, out a1_57, out a4_58, out a5_59, out s2_60, out s3_61, out s4_62);
	word32 t1_63;
	word32 a0_64;
	word32 a1_65;
	word32 a2_66;
	word32 a3_67;
	word32 a4_68;
	word32 a5_69;
	Eq_2 ra_35 = memset(ra, 0x4201BA44, 0x00, 404, out t1_63, out a0_64, out a1_65, out a2_66, out a3_67, out a4_68, out a5_69);
	g_dw2300B4F8 = 0x4201BA44;
	g_dw4201BA54 = 0x00;
	g_t42047DD4.u1 = 0x4201BA44;
	g_dw42047DE0 = 0x42047DCC;
	return ra_35;
}

// 2300A8DA: Register (ptr32 Eq_34226) scanu_find_result(Register (ptr32 Eq_34226) a0, Register word32 a1, Register out Eq_2 a3Out, Register out (ptr32 Eq_34226) a5Out)
// Called from:
//      scanu_search_by_bssid
//      rxu_mgt_ind_handler
struct Eq_34226 * scanu_find_result(struct Eq_34226 * a0, word32 a1, union Eq_2 & a3Out, struct Eq_34226 & a5Out)
{
	struct Eq_34226 * a5_28 = &g_t4201BA5C;
	do
	{
		struct Eq_34226 * a0_12 = a5_28;
		if ((word32) a5_28->b0034 != 0x00)
		{
			if ((word32) a5_28->b0000 == (word32) a0->b0000 && ((word32) a5_28->b0001 == (word32) a0->b0001 && ((word32) a5_28->b0002 == (word32) a0->b0002 && ((word32) a5_28->b0003 == (word32) a0->b0003 && ((word32) a5_28->b0004 == (word32) a0->b0004 && (word32) a5_28->b0005 == (word32) a0->b0005)))))
			{
				a3Out.u0 = <invalid>;
				a5Out = a5_28;
				return a5_28;
			}
		}
		else if (a1 != 0x00)
			goto l2300A94A;
		++a5_28;
	} while (a5_28 != &g_w4201BBAC);
	a0_12 = null;
l2300A94A:
	a3Out.u0 = <invalid>;
	a5Out = a5_28;
	return a0_12;
}

// 2300A94C: void scanu_frame_handler(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s3, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg98)
// Called from:
//      rxu_mgt_ind_handler
void scanu_frame_handler(Eq_2 ra, Eq_2 a0, Eq_2 s3, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg98)
{
	struct Eq_34306 * s5_1014 = (word32) g_ptr4201BA44->b014E;
	Eq_2 s6_1001 = (word32) a0 + 64;
	word32 a5_1690;
	Eq_2 a0_45 = mac_ie_find((word32) a0 + 64, (word32) (word16) ((word32) *a0 + -36), 0x00, out a5_1690);
	struct Eq_34331 * s4_1031 = &g_ptr4201BA44;
	if (a0_45 != 0x00)
	{
		Eq_34335 a5_47 = (word32) *((word32) a0_45 + 1);
		if (a5_47 <= 32)
		{
			if (a5_47 == 0x00)
				goto l2300A9CA;
		}
		else
			a5_47.u0 = 32;
		byte * a3_53 = (word32) a0_45 + 2;
		if ((word32) *((word32) a0_45 + 2) != 0x00)
		{
			byte bLoc64_1106 = (byte) a5_47;
			byte * a4_57 = fp + -100;
			while (true)
			{
				a5_47 = (word32) a5_47 - 1;
				++a4_57;
				if (a5_47 == ~0x00)
					break;
				*a4_57 = (byte) (word32) *a3_53;
				++a3_53;
			}
			((word32) bLoc64_1106 + (fp + -64))->b0FDD = 0x00;
		}
	}
l2300A9CA:
	word32 a4_1692;
	word32 a0_77;
	word32 s2_1693;
	word32 a2_1691;
	ke_state_get(0x04, s6, out a0_77, out a2_1691, out a4_1692, out s2_1693);
	if (a0_77 != 0x01)
	{
l2300B100:
		ke_msg_forward_and_change_id(a0, a1, a2, a3, mstatus);
		return;
	}
	word32 a5_1695;
	word32 a3_1694;
	struct Eq_34226 * a0_90 = scanu_find_result((word32) a0 + 44, 0x01, out a3_1694, out a5_1695);
	struct Eq_34226 * s8_1022 = a0_90;
	if (a0_90 == null)
		goto l2300B100;
	ui32 a5_99 = (word32) g_t4201BBB0;
	if ((a5_99 & 1) == 0x00 && ((word32) (*((word32) a0 + 44)) != a5_99 || ((word32) (*((word32) a0 + 45)) != (word32) g_b4201BBB1 || ((word32) (*((word32) a0 + 46)) != (word32) g_b4201BBB2 || ((word32) (*((word32) a0 + 47)) != (word32) g_b4201BBB3 || ((word32) (*((word32) a0 + 48)) != (word32) g_t4201BBB4 || (word32) (*((word32) a0 + 49)) != (word32) g_b4201BBB5))))))
		goto l2300B100;
	a0_90->b0000 = (byte) (word16) (word32) *((word32) a0 + 44);
	a0_90->b0002 = (byte) (word16) (word32) *((word32) a0 + 46);
	a0_90->b0004 = (byte) (word16) (word32) *((word32) a0 + 48);
	a0_90->w0030 = (word16) ((word32) *((word32) a0 + 61) << 8 | (word32) (*((word32) a0 + 60)));
	ui32 a5_129 = (word32) *((word32) a0 + 63) << 8 | (word32) (*((word32) a0 + 62));
	a0_90->w0032 = (word16) a5_129;
	ui32 a5_131 = a5_129 & 0x01;
	if ((a5_129 & 0x01) == 0x00)
		a5_131 = 0x02;
	a0_90->w0028 = (word16) a5_131;
	uint32 s2_146 = (word32) *a0 + -36 << 16;
	byte * s2_147 = s2_146 >> 0x10;
	word32 a5_1696;
	Eq_2 a0_151 = mac_ie_find((word32) a0 + 64, s2_146 >> 0x10, 0x00, out a5_1696);
	if (a0_151 != 0x00)
	{
		Eq_34541 a5_153 = (word32) *((word32) a0_151 + 1);
		if (a5_153 <= 32)
		{
			if (a5_153 == 0x00)
				goto l2300AA9E;
		}
		else
			a5_153.u0 = 32;
		byte * a4_159 = (word32) a0_151 + 2;
		if ((word32) *((word32) a0_151 + 2) != 0x00)
		{
			a0_90->b0006 = (byte) a5_153;
			struct Eq_35882 * a3_163 = &a0_90->b0006 + 1;
			while (true)
			{
				a5_153 = (word32) a5_153 - 1;
				if (a5_153 == ~0x00)
					break;
				++a3_163;
				a3_163[0x0FFF] = (struct Eq_35882) (byte) (word32) *a4_159;
				++a4_159;
			}
		}
	}
	else
		a0_90->b0006 = 0x00;
l2300AA9E:
	a0_90->b0036 = (byte) (int32) *((word32) a0 + 26);
	struct Eq_34558 * a5_183 = (int32) *((word32) a0 + 25);
	a0_90->b0037 = (byte) a5_183;
	Eq_2 a5_1083 = (word32) a5_183->b0150;
	if (a5_1083 != 0x00)
	{
		Eq_2 s1_1078 = 0x00;
		struct Eq_34576 * s3_1080 = (word32) a5_1083 + 252;
		while (true)
		{
			a5_1083 = (word32) *((word32) a5_1083 + 336);
			if (s1_1078 >= a5_1083)
				break;
			a5_1083 = (word32) s3_1080->b0000;
			if (a5_1083 == 0x00)
				goto l2300AB3C;
			Eq_2 a2_205 = (word32) a0_90->b0006;
			if (a2_205 == a5_1083)
			{
				word32 a3_1699;
				word32 a4_1700;
				word32 a1_1697;
				word32 a2_1698;
				if (memcmp(&s3_1080->b0000 + 1, &a0_90->b0006 + 1, a2_205, out a1_1697, out a2_1698, out a3_1699, out a4_1700, out a5_1083) == 0x00)
					break;
			}
			s1_1078 = (word32) s1_1078 + 1;
			++s3_1080;
		}
		if ((word32) *((word32) a5_1083 + 336) == s1_1078)
			goto l2300B100;
	}
l2300AB3C:
	int32 a5_254;
	word32 a5_1701;
	Eq_2 a0_238 = mac_ie_find((word32) a0 + 64, s2_146 >> 0x10, 0x03, out a5_1701);
	if (a0_238 == 0x00)
	{
		if ((int32) a0_90->b0035 >= (int32) (*((word32) a0 + 24)))
		{
l2300AB90:
			if ((word32) g_t4201BBAE == 0x00)
			{
l2300B0E2:
				struct Eq_35748 * a5_1030 = (word32) s8_1022->b0034;
				if (a5_1030 == null)
				{
					word32 a5_1038 = (word32) s4_1031->w0014;
					s4_1031->w0014 = (word16) (a5_1038 + 0x01);
					a5_1030 = a5_1038 + 0x01;
				}
				if ((word32) a5_1030->b0150 != 0x00)
					s8_1022->b0034 = 0x01;
				goto l2300B100;
			}
			s5_1014->w4201AD88 = (word16) (word32) a0_90->w0028;
			s5_1014->t4201AD60 = a0_90->b0000;
			s5_1014->w4201AD64 = (word16) (word32) a0_90->b0004;
			s5_1014->w4201AD96 = (word16) (word32) a0_90->w0032;
			s5_1014->w4201AD94 = (word16) (word32) a0_90->w0030;
			word32 a1_1703;
			word32 a5_1707;
			word32 a4_1706;
			word32 a3_1705;
			word32 a6_1708;
			word32 a2_1704;
			word32 a7_1709;
			memcpy(&s5_1014->w4201AD64 + 1, &a0_90->b0006, 0x0022, out a1_1703, out a2_1704, out a3_1705, out a4_1706, out a5_1707, out a6_1708, out a7_1709);
			struct Eq_25380 * a5_368 = a0_90->ptr002C;
			s5_1014->dw4201ADC8 = 0x00;
			s5_1014->ptr4201AD8C = a5_368;
			s5_1014->b4201ADBD = (byte) (int32) a0_90->b0036;
			s5_1014->b4201ADBE = (byte) (int32) a0_90->b0037;
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg56 = <invalid>;
			me_extract_rate_set(a0, a1, a2, stackArg56);
			ptr32 s3_326 = (char *) s5_1014 + 0x05D8;
			int32 s1_1017 = 0x4201A410;
			if ((word32) a0_90->ptr002C->b0002 == 0x00)
			{
				ui32 a0_390;
				struct Eq_34790 * s7_403;
				word32 a4_1713;
				me_legacy_rate_bitfield_build(&s5_1014->w4201AD96 + 1, 0x01, dwArg98, out s1_1017, out a0_390, out a4_1713, out s2_147, out s3_326, out s4_1031, out s5_1014, out s6_1001, out s7_403, out s8_1022);
				if ((a0_390 & 0x0F) != 0x00)
				{
					word32 a4_1714;
					s7_403->b03D7 = (byte) (0x1F - __clzsi2(a0_390 & 0x0F, out a4_1714));
				}
				else
					s7_403->b03D7 = 0x01;
			}
			word32 a0_1716;
			word32 a2_1717;
			word32 a4_1718;
			word32 s4_1719;
			mac_vsie_find(a0, a1, a2, a3, out a0_1716, out a2_1717, out a4_1718, out s4_1719);
			if (s6_1001 != 0x00)
			{
				struct Eq_34844 * a5_438 = (char *) s5_1014 + 0x05D8 + s1_1017;
				a5_438->b03C0 = (byte) (word32) *((word32) s6_1001 + 8);
				a5_438->w03AE = (word16) ((word32) a5_438->w03AE | 0x0200);
				uint32 a3_452 = (word32) *((word32) s6_1001 + 0x0D) << 24 | (((word32) (*((word32) s6_1001 + 11)) << 8 | (word32) (*((word32) s6_1001 + 0x0A))) | (word32) (*((word32) s6_1001 + 0x0C)) << 16);
				ui32 a1_457 = a3_452 >> 0x03 & 2;
				a5_438->b03C1 = (byte) a1_457;
				a5_438->dw03C8 = a3_452 & 0x0F | (a3_452 >> 0x08) << 4;
				uint32 a3_470 = (word32) *((word32) s6_1001 + 0x0011) << 24 | (((word32) (*((word32) s6_1001 + 0x0F)) << 8 | (word32) (*((word32) s6_1001 + 0x0E))) | (word32) (*((word32) s6_1001 + 16)) << 16);
				ui32 a4_477 = a3_470 >> 0x04 & 0x01 | a1_457;
				a5_438->b03C1 = (byte) a4_477;
				a5_438->dw03C4 = a3_470 & 0x0F | (a3_470 >> 0x08) << 4;
				uint32 a3_489 = (word32) *((word32) s6_1001 + 21) << 24 | (((word32) (*((word32) s6_1001 + 19)) << 8 | (word32) (*((word32) s6_1001 + 18))) | (word32) (*((word32) s6_1001 + 20)) << 16);
				ui32 a4_492 = a4_477 | a3_489 >> 0x02 & 0x04;
				a5_438->b03C1 = (byte) a4_492;
				a5_438->dw03CC = a3_489 & 0x0F | (a3_489 >> 0x08) << 4;
				uint32 a3_508 = (word32) *((word32) s6_1001 + 25) << 24 | (((word32) (*((word32) s6_1001 + 23)) << 8 | (word32) (*((word32) s6_1001 + 22))) | (word32) (*((word32) s6_1001 + 24)) << 16);
				a5_438->b03C1 = (byte) (a4_492 | a3_508 >> 0x01 & 0x08);
				int32 a4_517 = a5_438->dw03E0;
				a5_438->dw03D0 = a3_508 & 0x0F | (a3_508 >> 0x08) << 4;
				a5_438->dw03E0 = a4_517 | 1;
			}
			else
			{
				struct Eq_35809 * a5_429 = (char *) s5_1014 + 0x05D8 + s1_1017;
				a5_429->dw03C4 = 16775747;
				a5_429->dw03C8 = 16775747;
				a5_429->dw03CC = 16775747;
				a5_429->dw03D0 = 16775747;
			}
			Eq_2 s10_524 = 0x00;
			if ((word32) g_b4201B002 != 0x00)
			{
				struct Eq_35064 * s7_529 = (char *) s5_1014 + 0x05D8 + s1_1017;
				int32 s10_530 = s7_529->dw03E0;
				s10_524 = s10_530 & 1;
				if ((s10_530 & 1) != 0x00)
				{
					word32 a5_1720;
					Eq_2 a0_539 = mac_ie_find(s6_1001, s2_147, 45, out a5_1720);
					if (a0_539 != 0x00)
					{
						s7_529->w0358 = (word16) ((word32) *((word32) a0_539 + 3) << 8 | (word32) (*((word32) a0_539 + 2)));
						s7_529->b035A = (byte) (word32) *((word32) a0_539 + 4);
						ptr32 a1_544 = s3_326 + 859;
						int32 a5_552;
						for (a5_552 = 0x00; a5_552 != 0x10; ++a5_552)
							(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(a5_552 + a1_544)[s1_1017].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0] = (byte) (word32) ((word32) a0_539 + 5 + a5_552);
						struct Eq_35126 * a5_573 = (char *) s5_1014 + 0x05D8 + s1_1017;
						a5_573->w036C = (word16) ((word32) *((word32) a0_539 + 22) << 8 | (word32) (*((word32) a0_539 + 21)));
						a5_573->dw0370 = (word32) *((word32) a0_539 + 24) << 8 | (word32) (*((word32) a0_539 + 23));
						a5_573->b0374 = (byte) (word32) *((word32) a0_539 + 27);
						a5_573->dw03E0 |= 2;
					}
					word32 a5_1721;
					s10_524 = mac_ie_find(s6_1001, s2_147, 61, out a5_1721);
				}
			}
			struct Eq_26969 * a5_611 = (word32) *((word32) g_t4201BBD8 + 320);
			struct Eq_35187 * s9_614 = (char *) s5_1014 + 0x05D8 + s1_1017;
			s9_614->b03E8 = (byte) a5_611;
			if (a5_611 == null)
			{
l2300B0A2:
				me_extract_power_constraint(s6_1001, s2_147, me_bw_check(s10_524, a5_611));
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				Eq_2 stackArg56 = <invalid>;
				me_extract_country_reg(a0, a1, a2, stackArg56);
				me_extract_mobility_domain(a0, a1, a2);
				struct Eq_35736 * s1_1018 = (char *) s5_1014 + 0x05D8 + s1_1017;
				s1_1018->dw03E0 |= 0x80000000;
				goto l2300B0E2;
			}
			a5_611 = s9_614->ptr03E0;
			if (a5_611 < null)
				goto l2300B0A2;
			Eq_2 a5_685 = s3_326 + 1003 + s1_1017;
			word32 t1_1722;
			word32 a3_1733;
			word32 a2_1732;
			word32 a0_1723;
			word32 a1_1724;
			word32 a3_1726;
			word32 a5_1728;
			word32 a2_1725;
			word32 a4_1727;
			word32 a0_1730;
			word32 t1_1729;
			word32 a1_1731;
			word32 a0_1737;
			word32 t1_1736;
			word32 a5_1735;
			word32 a1_1738;
			word32 a4_1741;
			word32 a5_1742;
			word32 t1_1743;
			word32 a3_1740;
			word32 a3_1747;
			word32 t1_1750;
			word32 a0_1751;
			word32 a4_1748;
			word32 a2_1739;
			word32 a4_1734;
			word32 a2_1746;
			word32 a5_1749;
			word32 a4_1755;
			word32 a0_1744;
			word32 a1_1745;
			word32 a3_1754;
			word32 a2_1753;
			word32 a1_1752;
			word32 a5_1756;
			Eq_2 ra_711 = memset(memset(memset(memset(memset(ra, s3_326 + 1001 + s1_1017, 0x00, 0x02, out t1_1722, out a0_1723, out a1_1724, out a2_1725, out a3_1726, out a4_1727, out a5_1728), s3_326 + 1005 + s1_1017, 0x00, 0x01, out t1_1729, out a0_1730, out a1_1731, out a2_1732, out a3_1733, out a4_1734, out a5_1735), s3_326 + 0x03EE + s1_1017, 0x00, 0x01, out t1_1736, out a0_1737, out a1_1738, out a2_1739, out a3_1740, out a4_1741, out a5_1742), a5_685, 0x00, 0x01, out t1_1743, out a0_1744, out a1_1745, out a2_1746, out a3_1747, out a4_1748, out a5_1749), s3_326 + 1004 + s1_1017, 0x00, 0x01, out t1_1750, out a0_1751, out a1_1752, out a2_1753, out a3_1754, out a4_1755, out a5_1756);
			s9_614->b0411 = 0x00;
			s9_614->b03EF = 0x00;
			s9_614->b03F0 = 0x00;
			word32 a5_1757;
			Eq_2 a0_724 = mac_ie_find(s6_1001, s2_147, 48, out a5_1757);
			Eq_2 s7_727 = s3_326 + 1009 + s1_1017;
			if (a0_724 != 0x00)
			{
				Eq_2 a2_731 = (word32) *((word32) a0_724 + 1) + 0x02 & 0x00FF;
				s9_614->b0411 = (byte) a2_731;
				word32 a3_1760;
				word32 a2_1759;
				word32 a4_1761;
				word32 a7_1764;
				word32 a5_1762;
				word32 a6_1763;
				word32 a1_1758;
				memcpy(s7_727, a0_724, a2_731, out a1_1758, out a2_1759, out a3_1760, out a4_1761, out a5_1762, out a6_1763, out a7_1764);
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				Eq_2 stackArg268 = <invalid>;
				word32 a0_1770;
				word32 s0_1768;
				word32 s1_1769;
				word32 s3_1771;
				word32 s4_1772;
				process_rsn_ie(a0, a1, a2, a3, a4, a5, stackArg268, out s0_1768, out s1_1769, out a0_1770, out s3_1771, out s4_1772);
				Eq_35390 a1_753 = s9_614->t03EC;
				s9_614->b0411 = (byte) s7_727;
				word32 s9_1820;
				word32 t4_1823;
				struct Eq_35400 * s9_784;
				Eq_2 a3_803;
				word32 a5_1814;
				word32 s2_1816;
				word32 s3_1817;
				word32 a1_1775;
				word32 a0_1774;
				word32 s1_1773;
				word32 a2_1776;
				word32 a4_1795;
				word32 a5_1779;
				word32 a7_1780;
				word32 s6_1785;
				word32 s4_1783;
				word32 s2_1781;
				word32 s5_1784;
				word32 s7_1786;
				word32 s3_1782;
				word32 s1_1791;
				word32 s11_1789;
				word32 a4_1778;
				word32 s8_1787;
				word32 a3_1777;
				word32 s10_1788;
				word32 t4_1790;
				word32 a5_1796;
				word32 a2_1794;
				word32 a7_1797;
				word32 a1_1793;
				word32 s4_1818;
				word32 s9_1805;
				word32 a0_1792;
				word32 s3_1799;
				word32 s5_1801;
				word32 s6_1802;
				word32 s4_1800;
				word32 s2_1798;
				word32 a2_1811;
				word32 s10_1806;
				word32 t4_1808;
				word32 s11_1807;
				word32 a0_1809;
				word32 a1_1810;
				word32 a4_1813;
				word32 s7_1803;
				word32 s8_1804;
				word32 a3_1812;
				word32 s8_1819;
				word32 a7_1815;
				word32 s11_1822;
				word32 s10_1821;
				ra_711 = printf(printf(printf(ra_711, &g_t230750E0, a1_753 >> 0x11 & 0x01, a5_685, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_1773, out a0_1774, out a1_1775, out a2_1776, out a3_1777, out a4_1778, out a5_1779, out a7_1780, out s2_1781, out s3_1782, out s4_1783, out s5_1784, out s6_1785, out s7_1786, out s8_1787, out s9_784, out s10_1788, out s11_1789, out t4_1790), &g_t2307511C, s9_784->t03EC >> 0x09 & 0x01, a5_685, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_1791, out a0_1792, out a1_1793, out a2_1794, out a3_803, out a4_1795, out a5_1796, out a7_1797, out s2_1798, out s3_1799, out s4_1800, out s5_1801, out s6_1802, out s7_1803, out s8_1804, out s9_1805, out s10_1806, out s11_1807, out t4_1808), &g_t23075154, a3_803, a5_685, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_1017, out a0_1809, out a1_1810, out a2_1811, out a3_1812, out a4_1813, out a5_1814, out a7_1815, out s2_1816, out s3_1817, out s4_1818, out s5_1014, out s6_1001, out s7_727, out s8_1819, out s9_1820, out s10_1821, out s11_1822, out t4_1823);
			}
			word32 a4_1826;
			word32 a2_1825;
			word32 a0_1824;
			word32 s4_1827;
			mac_vsie_find(a0, a1, a2, a3, out a0_1824, out a2_1825, out a4_1826, out s4_1827);
			Eq_2 a0_851 = s6_1001;
			if (s6_1001 != 0x00)
			{
				struct Eq_35544 * s3_857 = (char *) s5_1014 + 0x05D8 + s1_1017;
				s3_857->b03E9 = (byte) ((word32) s3_857->b03E9 | 8);
				if ((word32) s3_857->b0411 == 0x00)
				{
					Eq_2 a2_867 = (word32) *((word32) s6_1001 + 1) + 0x02 & 0x00FF;
					s3_857->b0411 = (byte) a2_867;
					word32 a5_1832;
					word32 a6_1833;
					word32 a1_1828;
					word32 a2_1829;
					word32 a3_1830;
					word32 a7_1834;
					word32 a4_1831;
					memcpy(s7_727, s6_1001, a2_867, out a1_1828, out a2_1829, out a3_1830, out a4_1831, out a5_1832, out a6_1833, out a7_1834);
					word32 s2_1838;
					word32 s4_1840;
					word32 a2_1836;
					word32 s1_1835;
					word32 s3_1839;
					word32 a4_1837;
					process_wpa_ie(a0, a1, a2, out s1_1835, out a2_1836, out a4_1837, out s2_1838, out s3_1839, out s4_1840);
					s3_857->b0411 = (byte) s7_727;
					a0_851 = s7_727;
				}
			}
			struct Eq_35621 * a5_904;
			((word32) a0_851 + 48)->u0 = 0x00;
			struct Eq_35626 * a5_899 = (char *) s5_1014 + 0x05D8 + s1_1017;
			if ((a5_899->dw03E8 & 0x12FFF800) != 0x00)
				a5_904 = (struct Eq_35621 *) 0x09;
			else
			{
				if (((word32) a5_899->w03AE & 0x10) != 0x00)
				{
					a5_899->b03E9 = (byte) ((word32) a5_899->b03E9 | 2);
					((word32) a0_851 + 59)->u1 = 0x01;
l2300B058:
					struct Eq_35641 * s3_926 = (char *) s5_1014 + 0x05D8 + s1_1017;
					struct Eq_35674 ** a5_930;
					word32 a3_1843;
					word32 a7_1846;
					word32 a6_1845;
					word32 a4_1844;
					word32 a1_1841;
					word32 a2_1842;
					memcpy((word32) a0_851 + 64, s7_727, (word32) s3_926->b0411, out a1_1841, out a2_1842, out a3_1843, out a4_1844, out a5_930, out a6_1845, out a7_1846);
					*((char *) *a5_930 + 54) = (struct Eq_35674 **) (word16) (word32) s3_926->b0411;
					word32 s7_1854;
					word32 s9_1855;
					word32 t4_1857;
					word32 s11_1856;
					word32 a7_1852;
					word32 s3_1853;
					word32 a0_1847;
					word32 a4_1851;
					word32 a3_1850;
					word32 a2_1849;
					word32 a1_1848;
					printf(ra_711, &g_t23075174, s3_926->t03E8 >> 0x0D & 0x01, a5_685, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_1017, out a0_1847, out a1_1848, out a2_1849, out a3_1850, out a4_1851, out a5_611, out a7_1852, out s2_147, out s3_1853, out s4_1031, out s5_1014, out s6_1001, out s7_1854, out s8_1022, out s9_1855, out s10_524, out s11_1856, out t4_1857);
					goto l2300B0A2;
				}
				a5_904 = (struct Eq_35621 *) 0x02;
			}
			a5_904->t0030 = a0_851;
