pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300B4F0: void scanu_start(Register Eq_2 ra, Register (ptr32 Eq_36534) s0, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
// Called from:
//      scanu_join_req_handler
//      scanu_start_req_handler
void scanu_start(Eq_2 ra, struct Eq_36534 * s0, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	if ((word32) g_t4201BBAE == 0x00)
	{
		struct Eq_36571 * a5_12 = &g_ptr4201BA44;
		do
		{
			a5_12->b004C = 0x00;
			a5_12->b004D = 0x80;
			++a5_12;
		} while (a5_12 != &g_t4201BB94);
		g_w4201BA58 = 0x00;
	}
	struct Eq_36545 * a5_31;
	word32 s1_156;
	word32 a0_157;
	word32 a1_158;
	word32 s2_159;
	word32 s3_160;
	word32 s4_161;
	Eq_2 a4_30;
	ke_state_set(0x04, 0x01, mstatus, out s1_156, out a0_157, out a1_158, out a4_30, out a5_31, out s2_159, out s3_160, out s4_161);
	word32 * a3_44 = a5_31->ptr0148;
	if (a3_44 != null)
	{
		a4_30 = (word32) a5_31->w014C;
		if (a4_30 <= 200)
		{
			*a3_44 = 0x42047DCC;
			g_t42047DD4 = (word16) a4_30;
			hal_dma_push(s0, 0x00, 0x42047DCC, mstatus, dwArg14, dwArg18, dwArg0128, dwArg0168);
			return;
		}
	}
	scanu_scan_next(ra, a4_30, mstatus);
}

word32 g_dw2300B4F8 = 2266220038;
// 2300B570: Register word32 txl_get_seq_ctrl()
// Called from:
//      sm_disconnect
//      sm_auth_send
//      sm_assoc_req_send
//      sm_handle_supplicant_result
word32 txl_get_seq_ctrl()
{
	uint32 a0_8 = (word32) g_w4201A3FC + 0x01 << 16;
	g_w4201A3FC = (word16) (a0_8 >> 16);
	return (word32) (word16) (a0_8 >> 16 << 4);
}

// 2300B58E: Register Eq_2 sm_delete_resources(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg88, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0158, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s6Out, Register out ptr32 s10Out)
// Called from:
//      sm_disconnect
//      sm_connect_ind
Eq_2 sm_delete_resources(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg88, Eq_2 dwArgF8, Eq_2 dwArg0158, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s6Out, ptr32 & s10Out)
{
	Eq_2 a4_25;
	word32 s1_30;
	struct Eq_36651 * s0_52;
	Eq_2 s2_54;
	word32 s0_305;
	word32 a0_306;
	word32 a1_307;
	word32 a2_308;
	word32 a3_309;
	word32 a5_310;
	word32 s2_312;
	word32 a6_311;
	word32 s3_313;
	word32 s4_314;
	word32 s8_315;
	word32 s1_316;
	word32 a0_317;
	word32 a1_318;
	word32 a2_319;
	word32 a3_320;
	word32 a4_321;
	word32 a5_322;
	word32 a6_323;
	word32 s3_324;
	word32 s4_325;
	word32 s8_326;
	Eq_2 ra_131 = ke_msg_alloc(ke_msg_alloc(ra, 0x01000413, 0x05, 0x02, a4, mstatus, dwArg08, out s0_305, out s1_30, out a0_306, out a1_307, out a2_308, out a3_309, out a4_25, out a5_310, out a6_311, out s2_312, out s3_313, out s4_314, out s8_315), s1_30 + 0x0411, 0x05, 0x02, a4_25, mstatus, dwArg08, out s0_52, out s1_316, out a0_317, out a1_318, out a2_319, out a3_320, out a4_321, out a5_322, out a6_323, out s2_54, out s3_324, out s4_325, out s8_326);
	s2_54->u1 = 0x00;
	*((word32) s2_54 + 1) = (byte) (word32) s0_52->b0057;
	Eq_2 a4_70;
	word32 a0_327;
	word32 a1_328;
	word32 a2_329;
	word32 a5_330;
	word32 s2_331;
	word32 s3_332;
	word32 s4_333;
	word32 s8_334;
	Eq_2 a3_110;
	Eq_2 s1_115;
	Eq_2 s0_114 = ke_msg_send(s2_54, mstatus, out s1_115, out a0_327, out a1_328, out a2_329, out a3_110, out a4_70, out a5_330, out s2_331, out s3_332, out s4_333, out s8_334);
	if ((word32) *((word32) s0_114 + 88) != 0x00)
	{
		Eq_2 a0_87;
		struct Eq_36766 * s0_95;
		word32 s1_335;
		word32 a1_336;
		word32 a2_337;
		word32 a3_338;
		word32 a4_339;
		word32 a5_340;
		word32 a6_341;
		word32 s2_342;
		word32 s3_343;
		word32 s4_344;
		word32 s8_345;
		ra_131 = ke_msg_alloc(ra_131, 0x1E, 0x00, 0x04, a4_70, mstatus, dwArg08, out s0_95, out s1_335, out a0_87, out a1_336, out a2_337, out a3_338, out a4_339, out a5_340, out a6_341, out s2_342, out s3_343, out s4_344, out s8_345);
		((word32) a0_87 + 2)->u1 = 0x00;
		*((word32) a0_87 + 3) = (byte) (word32) s0_95->b0057;
		word32 a0_346;
		word32 a1_347;
		word32 a2_348;
		word32 a4_349;
		word32 a5_350;
		word32 s2_351;
		word32 s3_352;
		word32 s4_353;
		word32 s8_354;
		s0_114 = ke_msg_send(a0_87, mstatus, out s1_115, out a0_346, out a1_347, out a2_348, out a3_110, out a4_349, out a5_350, out s2_351, out s3_352, out s4_353, out s8_354);
	}
	Eq_2 a4_125 = (word32) *((word32) s0_114 + 96);
	struct Eq_36761 * a5_126 = (struct Eq_36761 *) 0x00FF;
	if (a4_125 != 0x00FF)
	{
		Eq_2 a0_134;
		struct Eq_36837 * s0_142;
		word32 s1_355;
		word32 a1_356;
		word32 a2_357;
		word32 a3_358;
		word32 a4_359;
		word32 a5_360;
		word32 a6_361;
		word32 s2_362;
		word32 s3_363;
		word32 s4_364;
		word32 s8_365;
		ra_131 = ke_msg_alloc(ra_131, 0x0C, 0x00, 0x01, a4_125, mstatus, dwArg08, out s0_142, out s1_355, out a0_134, out a1_356, out a2_357, out a3_358, out a4_359, out a5_360, out a6_361, out s2_362, out s3_363, out s4_364, out s8_365);
		a0_134->u1 = (byte) (word32) s0_142->b0060;
		word32 a0_366;
		word32 a1_367;
		word32 a2_368;
		word32 a4_369;
		word32 s2_370;
		word32 s3_371;
		word32 s4_372;
		word32 s8_373;
		ke_msg_send(a0_134, mstatus, out s1_115, out a0_366, out a1_367, out a2_368, out a3_110, out a4_369, out a5_126, out s2_370, out s3_371, out s4_372, out s8_373);
	}
	Eq_2 s0_171 = a5_126->t0040;
	if (a5_126 != null)
	{
		word32 a4_383;
		ra_131 = chan_ctxt_unlink(ra_131, s0_171, (word32) *((word32) s0_171 + 87), a3_110, mstatus, dwLoc08, dwArg18, dwArg28, dwArg88, dwArgF8, dwArg0158, out s1_115, out a4_383, out s6, out s10);
	}
	s1_115->u1 = 0x00;
	*((word32) s1_115 + 1) = (byte) (word32) *((word32) s0_171 + 87);
	ptr32 s1_217;
	ptr32 s2_218;
	word32 a0_374;
	word32 a1_375;
	word32 a2_376;
	word32 a3_377;
	word32 a4_378;
	word32 a5_379;
	word32 s3_380;
	word32 s4_381;
	word32 s8_382;
	*((word32) ke_msg_send(s1_115, mstatus, out s1_217, out a0_374, out a1_375, out a2_376, out a3_377, out a4_378, out a5_379, out s2_218, out s3_380, out s4_381, out s8_382) + 992) = 0x00;
	0x00 = (uint16) dwArg38;
	s1Out = s1_217;
	s2Out = s2_218;
	s6Out = s6;
	s10Out = s10;
	return ra_131;
}

// 2300B642: void sm_frame_tx_cfm_handler(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register ui32 a1, Register (ptr32 Eq_13120) a3, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg98, Stack Eq_2 dwArgCC)
void sm_frame_tx_cfm_handler(Eq_2 ra, Eq_2 s1, Eq_2 a0, ui32 a1, struct Eq_13120 * a3, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg98, Eq_2 dwArgCC)
{
	up32 a0_15;
	word32 a2_107;
	word32 a4_108;
	word32 s2_109;
	ke_state_get(0x06, dwArg18, out a0_15, out a2_107, out a4_108, out s2_109);
	if ((a1 & 0x40030000) != 0x00 && a0_15 <= ~0x05)
	{
		struct Eq_36977 * s0_39;
		word32 s1_40;
		word32 a0_110;
		word32 a1_111;
		word32 a3_112;
		word32 a4_113;
		word32 a5_114;
		word32 s2_115;
		word32 s3_116;
		word32 s4_117;
		word32 s5_118;
		word32 s6_119;
		word32 s7_120;
		word32 s9_121;
		word32 s10_122;
		word32 s11_123;
		txl_frame_push(ra, a0, 0x03, a3, (struct Eq_13346 *) 0x40030000, mstatus, dwArg18, s1, dwArg98, dwArgCC, out s0_39, out s1_40, out a0_110, out a1_111, out a3_112, out a4_113, out a5_114, out s2_115, out s3_116, out s4_117, out s5_118, out s6_119, out s7_120, out s9_121, out s10_122, out s11_123);
		s0_39->b02D6 = (byte) s1_40;
	}
}

word32 g_dw2300B656 = 0x400307B7;
// 2300B67C: void sm_init(Register ptr32 mstatus)
// Called from:
//      me_init
void sm_init(ptr32 mstatus)
{
	g_dw4201CBD8 = 0x00;
	word32 s1_22;
	word32 a0_23;
	word32 a1_24;
	word32 a4_25;
	word32 a5_26;
	word32 s2_27;
	word32 s3_28;
	word32 s4_29;
	ke_state_set(0x06, 0x00, mstatus, out s1_22, out a0_23, out a1_24, out a4_25, out a5_26, out s2_27, out s3_28, out s4_29);
}

// 2300B68C: Register Eq_2 sm_get_bss_params(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 word32) a0, Register (ptr32 word32) a1, Register Eq_2 a3, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgE8, Stack word32 dwArg0198, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      scanu_start_cfm_handler
//      sm_connect_req_handler
//      me_set_active_cfm_handler
Eq_2 sm_get_bss_params(Eq_2 ra, Eq_2 s1, word32 * a0, word32 * a1, Eq_2 a3, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C, Eq_2 dwArgE8, word32 dwArg0198, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	Eq_2 s0_180 = g_t4201BBD8;
	*a0 = 0x00;
	*a1 = 0x00;
	word32 s1_416;
	word32 s8_429;
	word32 s10_431;
	word32 t4_433;
	word32 s11_432;
	word32 s9_430;
	word32 s2_423;
	word32 s4_425;
	word32 s6_427;
	word32 s7_428;
	word32 s5_426;
	word32 s3_424;
	word32 a0_417;
	word32 a2_419;
	word32 a5_421;
	word32 a7_422;
	word32 a4_420;
	word32 a1_418;
	Eq_2 a3_44;
	Eq_2 ra_47 = printf(ra, &g_t230752E4, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_416, out a0_417, out a1_418, out a2_419, out a3_44, out a4_420, out a5_421, out a7_422, out s2_423, out s3_424, out s4_425, out s5_426, out s6_427, out s7_428, out s8_429, out s9_430, out s10_431, out s11_432, out t4_433);
	word32 s8_63 = 0x23075000;
	do
	{
		word32 s1_85;
		word32 s7_93;
		word32 s11_447;
		word32 t4_448;
		word32 s3_441;
		word32 s5_443;
		word32 s9_445;
		word32 s10_446;
		word32 s6_444;
		word32 s4_442;
		word32 a1_435;
		word32 a4_437;
		word32 a7_439;
		word32 s2_440;
		word32 a5_438;
		word32 a2_436;
		word32 a0_434;
		ra_47 = printf(ra_47, s8_63 + 772, a3_44, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_85, out a0_434, out a1_435, out a2_436, out a3_44, out a4_437, out a5_438, out a7_439, out s2_440, out s3_441, out s4_442, out s5_443, out s6_444, out s7_93, out s8_63, out s9_445, out s10_446, out s11_447, out t4_448);
	} while (s1_85 != s7_93);
	Eq_2 a3_140;
	Eq_2 ra_121;
	uint16 ** s4_127;
	uint16 * a5_142;
	ui32 a5_100 = (word32) *((word32) s0_180 + 0x0022);
	if ((a5_100 & 1) == 0x00 && (a5_100 != 0x00 || ((word32) (*((word32) s0_180 + 35)) != 0x00 || ((word32) (*((word32) s0_180 + 36)) != 0x00 || ((word32) (*((word32) s0_180 + 37)) != 0x00 || ((word32) (*((word32) s0_180 + 38)) != 0x00 || (word32) (*((word32) s0_180 + 39)) != 0x00))))))
	{
		struct Eq_34226 * s3_126;
		struct Eq_34226 ** s6_129;
		word32 s11_495;
		word32 t4_496;
		word32 s8_492;
		word32 s10_494;
		word32 s9_493;
		word32 s2_489;
		word32 s7_491;
		word32 s5_490;
		word32 a4_486;
		word32 a7_488;
		word32 a5_487;
		word32 a1_483;
		word32 a3_485;
		word32 a2_484;
		word32 a0_482;
		word32 s1_481;
		ra_121 = printf(ra_47, &g_t23075348, a3_44, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_481, out a0_482, out a1_483, out a2_484, out a3_485, out a4_486, out a5_487, out a7_488, out s2_489, out s3_126, out s4_127, out s5_490, out s6_129, out s7_491, out s8_492, out s9_493, out s10_494, out s11_495, out t4_496);
		*s6_129 = (struct Eq_34226 **) s3_126;
		if (scanu_search_by_bssid(s3_126, out a3_140, out a5_142) == 0x00)
		{
l2300B794:
			if ((word32) *((word32) s0_180 + 40) != 0x0FFFFFFF)
				*s4_127 = (word32) s0_180 + 40;
			goto l2300B756;
		}
	}
	else
	{
		word32 s10_465;
		word32 t4_467;
		word32 s11_466;
		word32 s4_459;
		word32 s6_461;
		word32 s8_463;
		word32 s9_464;
		word32 s7_462;
		word32 s5_460;
		word32 a3_453;
		word32 a5_455;
		word32 s2_457;
		word32 s3_458;
		word32 a7_456;
		word32 a4_454;
		word32 s1_449;
		word32 a1_451;
		word32 a2_452;
		word32 a0_450;
		Eq_2 ra_160 = printf(ra_47, &g_t23075318, a3_44, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_449, out a0_450, out a1_451, out a2_452, out a3_453, out a4_454, out a5_455, out a7_456, out s2_457, out s3_458, out s4_459, out s5_460, out s6_461, out s7_462, out s8_463, out s9_464, out s10_465, out s11_466, out t4_467);
		Eq_2 a3_192;
		s0_180 = scanu_search_by_ssid(s0_180, fp + -52, dwArgE8, out a3_192);
		word32 s1_207;
		struct Eq_37217 * s5_213;
		word32 * s6_214;
		word32 t4_480;
		word32 s9_477;
		word32 s11_479;
		word32 s10_478;
		word32 a4_471;
		word32 s2_473;
		word32 s7_475;
		word32 s8_476;
		word32 s3_474;
		word32 a7_472;
		word32 a1_469;
		word32 a2_470;
		word32 a0_468;
		ra_121 = printf(ra_160, &g_t2307532C, a3_192, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_207, out a0_468, out a1_469, out a2_470, out a3_140, out a4_471, out a5_142, out a7_472, out s2_473, out s3_474, out s4_127, out s5_213, out s6_214, out s7_475, out s8_476, out s9_477, out s10_478, out s11_479, out t4_480);
		if (s1_207 == 0x00)
			goto l2300B794;
		if (a5_142 >= null)
		{
			*s6_214 = s1_207;
			s5_213->ptr0014 = a5_142;
		}
	}
	*s4_127 = (uint16 **) a5_142;
l2300B756:
	ptr32 a0_249;
	ptr32 a1_252;
	ptr32 a4_255;
	ptr32 s5_264;
	ptr32 s6_265;
	word32 t4_510;
	word32 s11_509;
	word32 s10_508;
	word32 s9_507;
	word32 s8_506;
	word32 s7_505;
	word32 s4_504;
	word32 s3_503;
	word32 s2_502;
	word32 a7_501;
	word32 a3_499;
	word32 a5_500;
	word32 s1_497;
	word32 a2_498;
	Eq_2 ra_257 = printf(ra_121, &g_t2307535C, a3_140, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_497, out a0_249, out a1_252, out a2_498, out a3_499, out a4_255, out a5_500, out a7_501, out s2_502, out s3_503, out s4_504, out s5_264, out s6_265, out s7_505, out s8_506, out s9_507, out s10_508, out s11_509, out t4_510);
	0x00 = dwArg0198;
	a0Out = a0_249;
	a1Out = a1_252;
	a4Out = a4_255;
	s5Out = s5_264;
	s6Out = s6_265;
	return ra_257;
}

