pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300B7AA: Register word32 sm_scan_bss(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack word32 dwArg0128)
// Called from:
//      sm_connect_req_handler
word32 sm_scan_bss(Eq_2 ra, Eq_2 a4, ptr32 mstatus, word32 dwArg0128)
{
	Eq_2 a0_30;
	Eq_2 s1_39;
	Eq_2 s2_40;
	Eq_2 s3_41;
	word32 s8_317;
	word32 a6_315;
	word32 s4_316;
	word32 s0_309;
	word32 a5_314;
	word32 a2_311;
	word32 a3_312;
	word32 a4_313;
	word32 a1_310;
	ke_msg_alloc(ra, 0x01000000, 0x04, 340, a4, mstatus, dwLoc18, out s0_309, out s1_39, out a0_30, out a1_310, out a2_311, out a3_312, out a4_313, out a5_314, out a6_315, out s2_40, out s3_41, out s4_316, out s8_317);
	word32 a5_48 = (word32) *((word32) s3_41 + 61);
	((word32) a0_30 + 328)->u0 = 0x00;
	((word32) a0_30 + 334)->u1 = (byte) a5_48;
	*((word32) a0_30 + 332) = 0x00;
	word32 a1_318;
	word32 a2_319;
	word32 a3_320;
	word32 a4_321;
	word32 a5_322;
	word32 a6_323;
	word32 a7_324;
	memcpy((word32) a0_30 + 252, s3_41, 0x0022, out a1_318, out a2_319, out a3_320, out a4_321, out a5_322, out a6_323, out a7_324);
	((word32) a0_30 + 336)->u1 = 0x01;
	Eq_2 a1_73 = s2_40;
	if (s2_40 == 0x00)
		a1_73.u0 = 0x2308DD8C;
	word32 a1_325;
	word32 a2_326;
	word32 a3_327;
	word32 a4_328;
	word32 a5_329;
	word32 a6_330;
	word32 a7_331;
	memcpy((word32) a0_30 + 320, a1_73, 0x06, out a1_325, out a2_326, out a3_327, out a4_328, out a5_329, out a6_330, out a7_331);
	if (s1_39 != 0x00)
	{
		word32 a1_332;
		word32 a2_333;
		word32 a3_334;
		word32 a4_335;
		word32 a5_336;
		word32 a6_337;
		word32 a7_338;
		memcpy(a0_30, s1_39, 0x06, out a1_332, out a2_333, out a3_334, out a4_335, out a5_336, out a6_337, out a7_338);
		((word32) a0_30 + 335)->u1 = 0x01;
	}
	else
	{
		((word32) a0_30 + 335)->u1 = 0x00;
		byte * s2_104 = fp + -44;
		int32 * s3_106 = fp + -40;
		do
		{
			int32 s1_109;
			for (s1_109 = 0x06; s1_109 < (word32) (*s2_104); ++s1_109)
			{
				Eq_2 a1_118 = s1_109 + 0x00 + *s3_106;
				if (((word32) *((word32) a1_118 + 3) & 0x02) == 0x00)
				{
					word32 a0_122 = (word32) *((word32) a0_30 + 335);
					((word32) a0_30 + 335)->u1 = (byte) (a0_122 + 1);
					word32 a1_357;
					word32 a2_358;
					word32 a3_359;
					word32 a4_360;
					word32 a5_361;
					word32 a6_362;
					word32 a7_363;
					memcpy((word32) a0_30 + (a0_122 + 0x06), a1_118, 0x06, out a1_357, out a2_358, out a3_359, out a4_360, out a5_361, out a6_362, out a7_363);
				}
			}
			++s2_104;
			++s3_106;
		} while (s2_104 != fp + -42);
	}
	word32 s1_346;
	word32 a0_347;
	word32 a1_348;
	word32 a2_349;
	word32 a3_350;
	word32 a4_351;
	word32 a5_352;
	word32 s2_353;
	word32 s3_354;
	word32 s4_355;
	word32 s8_356;
	ke_msg_send(a0_30, mstatus, out s1_346, out a0_347, out a1_348, out a2_349, out a3_350, out a4_351, out a5_352, out s2_353, out s3_354, out s4_355, out s8_356);
	0x00 = dwArg0128;
	word32 s4_211;
	word32 s1_339;
	word32 a0_340;
	word32 a1_341;
	word32 a4_342;
	word32 a5_343;
	word32 s2_344;
	word32 s3_345;
	ke_state_set(0x06, 0x01, mstatus, out s1_339, out a0_340, out a1_341, out a4_342, out a5_343, out s2_344, out s3_345, out s4_211);
	return s4_211;
}

// 2300B8B6: Register word32 sm_join_bss(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a4, Register ptr32 mstatus)
// Called from:
//      scanu_start_cfm_handler
//      scanu_join_cfm_handler
//      sm_connect_req_handler
//      me_set_active_cfm_handler
word32 sm_join_bss(Eq_2 ra, Eq_2 a0, Eq_2 a4, ptr32 mstatus)
{
	Eq_2 a0_33;
	struct Eq_37650 * s1_42;
	word32 s2_43;
	Eq_2 s3_44;
	Eq_2 s4_45;
	word32 a1_185;
	word32 a2_186;
	word32 a3_187;
	word32 a4_188;
	word32 a5_189;
	word32 a6_190;
	word32 s8_191;
	word32 s0_184;
	ke_msg_alloc(ra, 0x01000002, 0x04, 340, a4, mstatus, dwLoc08, out s0_184, out s1_42, out a0_33, out a1_185, out a2_186, out a3_187, out a4_188, out a5_189, out a6_190, out s2_43, out s3_44, out s4_45, out s8_191);
	word32 a1_192;
	word32 a2_193;
	word32 a3_194;
	word32 a4_195;
	word32 a5_196;
	word32 a6_197;
	word32 a7_198;
	memcpy(a0_33, s4_45, 0x06, out a1_192, out a2_193, out a3_194, out a4_195, out a5_196, out a6_197, out a7_198);
	((word32) a0_33 + 335)->u1 = 0x01;
	word32 a1_199;
	word32 a2_200;
	word32 a3_201;
	word32 a4_202;
	word32 a5_203;
	word32 a6_204;
	word32 a7_205;
	memcpy((word32) a0_33 + 252, s3_44, 0x0022, out a1_199, out a2_200, out a3_201, out a4_202, out a5_203, out a6_204, out a7_205);
	((word32) a0_33 + 336)->u1 = 0x01;
	*((word32) a0_33 + 332) = 0x00;
	((word32) a0_33 + 328)->u0 = 0x00;
	((word32) a0_33 + 334)->u1 = (byte) (word32) *((word32) s3_44 + 61);
	word32 a1_206;
	word32 a2_207;
	word32 a3_208;
	word32 a4_209;
	word32 a5_210;
	word32 a6_211;
	word32 a7_212;
	memcpy((word32) a0_33 + 320, a0, 0x06, out a1_206, out a2_207, out a3_208, out a4_209, out a5_210, out a6_211, out a7_212);
	if (s2_43 != 0x00)
		*((word32) a0_33 + 3) = (byte) ((word32) *((word32) a0_33 + 3) | 1);
	s1_42->bFFFFFBE8 = (byte) s2_43;
	word32 s1_213;
	word32 a0_214;
	word32 a1_215;
	word32 a2_216;
	word32 a3_217;
	word32 a4_218;
	word32 a5_219;
	word32 s2_220;
	word32 s3_221;
	word32 s4_222;
	word32 s8_223;
	ke_msg_send(a0_33, mstatus, out s1_213, out a0_214, out a1_215, out a2_216, out a3_217, out a4_218, out a5_219, out s2_220, out s3_221, out s4_222, out s8_223);
	word32 s4_151;
	word32 s1_224;
	word32 a0_225;
	word32 a1_226;
	word32 a4_227;
	word32 a5_228;
	word32 s2_229;
	word32 s3_230;
	ke_state_set(0x06, 0x02, mstatus, out s1_224, out a0_225, out a1_226, out a4_227, out a5_228, out s2_229, out s3_230, out s4_151);
	return s4_151;
}

// 2300B958: Register Eq_2 sm_add_chan_ctx(Register (ptr32 byte) a0, Stack Eq_2 dwArg88, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      scanu_join_cfm_handler
Eq_2 sm_add_chan_ctx(byte * a0, Eq_2 dwArg88, ptr32 & a0Out, ptr32 & a4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	ptr32 a0_32;
	ptr32 a4_34;
	ptr32 s5_42;
	ptr32 s6_43;
	word32 s1_61;
	word32 s2_62;
	word32 s3_63;
	Eq_2 s0_37 = chan_ctxt_add(fp + ~0x1B, a0, 1107404720, dwArg88, out s1_61, out a0_32, out a4_34, out s2_62, out s3_63, out s5_42, out s6_43);
	a0Out = a0_32;
	a4Out = a4_34;
	s5Out = s5_42;
	s6Out = s6_43;
	return s0_37;
}

