pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300B9BA: void sm_send_next_bss_param(Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus)
// Called from:
//      sm_set_bss_param
//      me_set_ps_disable_cfm_handler
//      mm_bss_param_setting_handler
void sm_send_next_bss_param(Eq_2 a4, Eq_2 a5, ptr32 mstatus)
{
	word32 a5_43;
	Eq_2 a0_12 = co_list_pop_front(a4, a5, out a5_43);
	if (a0_12 != 0x00)
	{
		word32 s1_44;
		word32 a0_45;
		word32 a1_46;
		word32 a2_47;
		word32 a3_48;
		word32 a4_49;
		word32 a5_50;
		word32 s2_51;
		word32 s3_52;
		word32 s4_53;
		word32 s8_54;
		ke_msg_send((word32) a0_12 + 0x0C, mstatus, out s1_44, out a0_45, out a1_46, out a2_47, out a3_48, out a4_49, out a5_50, out s2_51, out s3_52, out s4_53, out s8_54);
	}
	else
		assert_err();
}

// 2300B9F6: void sm_set_bss_param(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128)
// Called from:
//      mm_sta_add_cfm_handler
void sm_set_bss_param(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArgF8, Eq_2 dwArg0128)
{
	Eq_2 a4_38;
	Eq_2 a4_61;
	struct Eq_37893 * a0_80;
	Eq_2 a4_84;
	Eq_2 a4_107;
	word32 s1_112;
	struct Eq_37897 * s0_134;
	struct Eq_37898 * s2_136;
	struct Eq_37899 * s3_137;
	Eq_2 s8_139;
	word32 a5_416;
	word32 s3_419;
	word32 s2_418;
	word32 s2_406;
	word32 a6_417;
	word32 a2_414;
	word32 a3_415;
	word32 a0_412;
	word32 a1_413;
	word32 s0_410;
	word32 s1_411;
	word32 s4_408;
	word32 s8_409;
	word32 s0_398;
	word32 s1_399;
	word32 a0_400;
	word32 a1_401;
	word32 a2_402;
	word32 a3_403;
	word32 a6_405;
	word32 a5_404;
	word32 s3_407;
	word32 s4_420;
	word32 s8_421;
	word32 s0_422;
	word32 s1_423;
	word32 a1_424;
	word32 a2_425;
	word32 a3_426;
	word32 a5_427;
	word32 a6_428;
	word32 s2_429;
	word32 s3_430;
	word32 s4_431;
	word32 s8_432;
	word32 s0_433;
	word32 a0_434;
	word32 a1_435;
	word32 a2_436;
	word32 a3_437;
	word32 a5_438;
	word32 a6_439;
	word32 s2_440;
	word32 s3_441;
	word32 s4_442;
	word32 s8_443;
	word32 s1_444;
	word32 a0_445;
	word32 a1_446;
	word32 a2_447;
	word32 a3_448;
	word32 a4_449;
	word32 a5_450;
	word32 a6_451;
	word32 s4_452;
	Eq_2 ra_133 = ke_msg_alloc(ke_msg_alloc(ke_msg_alloc(ke_msg_alloc(ke_msg_alloc(ra, 0x01000413, 0x05, 0x02, a4, mstatus, dwLoc18, out s0_398, out s1_399, out a0_400, out a1_401, out a2_402, out a3_403, out a4_38, out a5_404, out a6_405, out s2_406, out s3_407, out s4_408, out s8_409), 0x18, 0x00, 0x07, a4_38, mstatus, dwLoc18, out s0_410, out s1_411, out a0_412, out a1_413, out a2_414, out a3_415, out a4_61, out a5_416, out a6_417, out s2_418, out s3_419, out s4_420, out s8_421), 22, 0x00, 0x08, a4_61, mstatus, dwLoc18, out s0_422, out s1_423, out a0_80, out a1_424, out a2_425, out a3_426, out a4_84, out a5_427, out a6_428, out s2_429, out s3_430, out s4_431, out s8_432), 0x14, 0x00, 0x04, a4_84, mstatus, dwLoc18, out s0_433, out s1_112, out a0_434, out a1_435, out a2_436, out a3_437, out a4_107, out a5_438, out a6_439, out s2_440, out s3_441, out s4_442, out s8_443), s1_112 + 0x0411, 0x05, 0x02, a4_107, mstatus, dwLoc18, out s0_134, out s1_444, out a0_445, out a1_446, out a2_447, out a3_448, out a4_449, out a5_450, out a6_451, out s2_136, out s3_137, out s4_452, out s8_139);
	co_list_init(&g_t4201BBE0);
	s0_134->b0000 = 0x01;
	Eq_2 a5_149 = (word32) s2_136->b003D;
	s0_134->b0001 = (byte) a5_149;
	co_list_push_back((char *) s0_134 - 0x0C, a5_149);
	word32 a1_453;
	word32 a2_454;
	word32 a3_455;
	word32 a4_456;
	word32 a5_457;
	word32 a6_458;
	word32 a7_459;
	memcpy(s8_139, (char *) s3_137 + 1107406176, 0x06, out a1_453, out a2_454, out a3_455, out a4_456, out a5_457, out a6_458, out a7_459);
	Eq_2 a5_177 = (word32) s2_136->b003D;
	*((word32) s8_139 + 6) = (byte) a5_177;
	co_list_push_back((word32) s8_139 - 0x0C, a5_177);
	a0_80->b0005 = (byte) (word32) s3_137->ptr4201AD8C->b0002;
	word32 a0_191;
	struct Eq_38113 * s2_199;
	struct Eq_38114 * s5_202;
	word32 s6_203;
	struct Eq_38116 * s7_204;
	word32 s1_460;
	word32 s3_461;
	word32 s4_462;
	word32 s8_463;
	Eq_2 a4_194;
	Eq_2 s0_197 = me_legacy_rate_bitfield_build((char *) &s3_137->ptr4201AD8C + 0x0C, 0x01, dwArgF8, out s1_460, out a0_191, out a4_194, out s2_199, out s3_461, out s4_462, out s5_202, out s6_203, out s7_204, out s8_463);
	s5_202->dw0000 = a0_191;
	Eq_2 a5_209 = (word32) s2_199->b003D;
	s5_202->b0004 = (byte) a5_209;
	co_list_push_back((char *) s5_202 - 0x0C, a5_209);
	s7_204->w0000 = (word16) (word32) *((word32) s0_197 + 940);
	Eq_2 a5_220 = (word32) s2_199->b003D;
	s7_204->b0002 = (byte) a5_220;
	co_list_push_back((char *) s7_204 - 0x0C, a5_220);
	do
	{
		struct Eq_38177 * a0_240;
		struct Eq_38209 * s0_248;
		struct Eq_38195 * s2_250;
		ptr32 s3_251;
		struct Eq_38210 * s4_252;
		struct Eq_38188 * s8_253;
		word32 s1_464;
		word32 a1_465;
		word32 a2_466;
		word32 a3_467;
		word32 a4_468;
		word32 a5_469;
		word32 a6_470;
		ra_133 = ke_msg_alloc(ra_133, 0x1A, 0x00, 0x08, a4_194, mstatus, dwLoc18, out s0_248, out s1_464, out a0_240, out a1_465, out a2_466, out a3_467, out a4_468, out a5_469, out a6_470, out s2_250, out s3_251, out s4_252, out s8_253);
		struct Eq_38177 ** a5_258 = s0_248->ptr03C4;
		a0_240->b0005 = (byte) s3_251;
		*a5_258 = (struct Eq_38177 **) a0_240;
		a0_240->b0006 = (byte) (word32) s2_250->b003D;
		a4_194 = g_t42018ED0;
		Eq_2 a5_265 = 0x00;
		if (a4_194 != 0x00)
		{
			a4_194 = (int32) s8_253->b03C0;
			if (a4_194 < 0x00)
			{
				a4_194 = (word32) s2_250->b003C;
				a5_265 = (word32) (((word32) (s3_251 + (s6_203 + -632)) & a4_194) != 0x00);
			}
		}
		a0_240->b0004 = (byte) a5_265;
		co_list_push_back((char *) a0_240 - 0x0C, a5_265);
	} while (s3_251 != ~0x02);
	s4_252->b0000 = 0x01;
	Eq_2 a5_292 = (word32) s2_250->b003D;
	s4_252->b0001 = (byte) a5_292;
	co_list_push_back((char *) s4_252 - 0x0C, a5_292);
	sm_send_next_bss_param(a4_194, a5_292, mstatus);
	0x00 = (uint16) dwArg0128;
	word32 s1_471;
	word32 a0_472;
	word32 a1_473;
	word32 a4_474;
	word32 a5_475;
	word32 s2_476;
	word32 s3_477;
	word32 s4_478;
	ke_state_set(0x06, 0x04, mstatus, out s1_471, out a0_472, out a1_473, out a4_474, out a5_475, out s2_476, out s3_477, out s4_478);
}

// 2300BBB4: Register Eq_2 sm_disconnect_process(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0148, Register out ptr32 a4Out, Register out (ptr32 byte) s4Out)
// Called from:
//      sm_deauth_cfm
//      sm_disconnect
//      mm_connection_loss_ind_handler
//      sm_connect_req_handler
//      rxu_mgt_ind_handler
Eq_2 sm_disconnect_process(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg78, Eq_2 dwArgE8, Eq_2 dwArg0148, ptr32 & a4Out, byte & s4Out)
{
	Eq_2 a0_23;
	Eq_2 a4_27;
	struct Eq_38315 * s1_51;
	word32 s2_52;
	word32 a2_129;
	word32 a3_130;
	word32 a5_131;
	word32 a6_132;
	word32 a1_128;
	word32 s1_127;
	word32 s0_126;
	word32 s2_133;
	word32 s3_134;
	word32 s4_135;
	word32 s8_136;
	word32 s6_137;
	word32 s10_138;
	Eq_2 ra_50 = sm_delete_resources(ke_msg_alloc(ra, 0x01FFF805, 0x0D, 0x04, a4, mstatus, dwArg08, out s0_126, out s1_127, out a0_23, out a1_128, out a2_129, out a3_130, out a4_27, out a5_131, out a6_132, out s2_133, out s3_134, out s4_135, out s8_136), a4_27, mstatus, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg78, dwArgE8, dwArg0148, out s1_51, out s2_52, out s6_137, out s10_138);
	*a0_23 = (word16) s2_52;
	*((word32) a0_23 + 2) = (byte) (word32) s1_51->b0057;
	if ((word32) g_b4201BBE9 != 0x00)
		((word32) a0_23 + 3)->u1 = 0x01;
	0x00 = (uint16) dwArg38;
	ptr32 a4_85;
	byte * s4_92;
	word32 s1_139;
	word32 a0_140;
	word32 a1_141;
	word32 a2_142;
	word32 a3_143;
	word32 a5_144;
	word32 s2_145;
	word32 s3_146;
	word32 s8_147;
	ke_msg_send(a0_23, mstatus, out s1_139, out a0_140, out a1_141, out a2_142, out a3_143, out a4_85, out a5_144, out s2_145, out s3_146, out s4_92, out s8_147);
	a4Out = a4_85;
	s4Out = s4_92;
	return ra_50;
}

// 2300BC06: void sm_deauth_cfm(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0148)
void sm_deauth_cfm(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg78, Eq_2 dwArgE8, Eq_2 dwArg0148)
{
	word32 a4_39;
	word32 s4_40;
	sm_disconnect_process(ra, a4, mstatus, dwArg08, dwArg18, dwArg28, dwArg38, dwArg78, dwArgE8, dwArg0148, out a4_39, out s4_40);
}

