pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300BC0C: Register Eq_2 sm_disconnect(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_38422) a0, Register (ptr32 Eq_32424) a1, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack word32 dwArgA8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out Eq_2 a4Out)
// Called from:
//      sm_disconnect_req_handler
Eq_2 sm_disconnect(Eq_2 ra, Eq_2 s1, struct Eq_38422 * a0, struct Eq_31105 * a1, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg78, Eq_2 dwArg98, word32 dwArgA8, Eq_2 dwArgCC, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, union Eq_2 & a4Out)
{
	if ((word32) a0->b4201AA3E == 0x00 && (word32) a0->b4201AA40 != 0x00)
	{
		word32 s6_33 = (word32) a0->b4201AA48;
		Eq_2 a4_37;
		word32 s1_362;
		word32 a0_363;
		word32 a1_364;
		word32 a5_365;
		word32 s2_366;
		word32 s3_367;
		word32 s4_368;
		Eq_2 a5_49 = *((word32) ke_state_set(0x06, 0x08, mstatus, out s1_362, out a0_363, out a1_364, out a4_37, out a5_365, out s2_366, out s3_367, out s4_368) + 932);
		Eq_2 s0_59;
		word32 s4_61;
		struct Eq_38485 * a0_65;
		word32 s1_369;
		word32 a1_370;
		word32 a3_371;
		word32 a5_372;
		word32 s2_373;
		word32 s3_374;
		word32 s5_375;
		word32 s6_376;
		word32 s7_377;
		word32 s8_378;
		word32 s9_379;
		word32 s10_380;
		word32 s11_381;
		txl_frame_get(ra, (word32) ((word32) *((word32) a5_49 + 2) != 0x00), (struct Eq_14556 *) 0x0100, a4_37, a5_49, fflags, frm, mstatus, dwArgE8, dwArg0108, dwArg0128, out s0_59, out s1_369, out a0_65, out a1_370, out a3_371, out a4, out a5_372, out s2_373, out s3_374, out s4_61, out s5_375, out s6_376, out s7_377, out s8_378, out s9_379, out s10_380, out s11_381);
		if (a0_65 == null)
		{
l2300BD14:
			0x00 = dwArgA8;
			Eq_2 a4_229;
			word32 s4_417;
			Eq_2 ra_232 = sm_disconnect_process(ra, a4, mstatus, dwArg08, dwArg18, dwArg28, dwArg38, dwArg78, dwArgE8, dwArg0148, out a4_229, out s4_417);
			a4Out = a4_229;
			return ra_232;
		}
		word32 a4_382;
		tpc_update_frame_tx_power(ra, s0_59, fflags, frm, out a4_382);
		struct Eq_38532 * s2_91 = a0_65->ptr0068;
		s2_91->b014C = 0xC0;
		s2_91->b014D = 0x00;
		s2_91->b014E = 0x00;
		s2_91->b014F = 0x00;
		word32 a1_383;
		word32 a2_384;
		word32 a3_385;
		word32 a4_386;
		word32 a5_387;
		word32 a6_388;
		word32 a7_389;
		memcpy(&s2_91->b014F + 1, s6_33 + 0x420190EE, 0x06, out a1_383, out a2_384, out a3_385, out a4_386, out a5_387, out a6_388, out a7_389);
		word32 a1_390;
		word32 a2_391;
		word32 a3_392;
		word32 a4_393;
		word32 a5_394;
		word32 a6_395;
		word32 a7_396;
		memcpy(&s2_91->b014F + 7, (word32) s0_59 + 80, 0x06, out a1_390, out a2_391, out a3_392, out a4_393, out a5_394, out a6_395, out a7_396);
		struct Eq_13120 * a3_143;
		word32 a1_397;
		word32 a2_398;
		word32 a4_399;
		word32 a5_400;
		word32 a6_401;
		word32 a7_402;
		memcpy(&s2_91->b014F + 0x0D, s6_33 + 0x420190EE, 0x06, out a1_397, out a2_398, out a3_143, out a4_399, out a5_400, out a6_401, out a7_402);
		uint32 a0_151 = txl_get_seq_ctrl();
		s2_91->b0162 = (byte) a0_151;
		s2_91->b0163 = (byte) (a0_151 >> 8);
		a0_65->dw02CC = 0x2300BC06;
		a0_65->t02D0 = s0_59;
		a0_65->b002F = (byte) s4_61;
		struct Eq_38639 * a5_161 = (word32) *((word32) s0_59 + 96);
		a0_65->b0030 = (byte) a5_161;
		struct Eq_38648 * a0_165 = me_build_deauthenticate(&s2_91->b0163 + 1, a1);
		word32 a4_169 = a5_161->dw0014;
		a0_165->dw0038 = a4_169;
		word32 a5_171 = a5_161 + 0x17 + a0_165;
		a5_171->dw0018 = a4_169;
		word32 a0_176;
		word32 s0_403;
		word32 s1_404;
		word32 a1_405;
		word32 a3_406;
		word32 a5_407;
		word32 s2_408;
		word32 s3_409;
		word32 s4_410;
		word32 s5_411;
		word32 s6_412;
		word32 s7_413;
		word32 s9_414;
		word32 s10_415;
		word32 s11_416;
		ra = txl_frame_push(ra, s0_59, 0x03, a3_143, a5_171, mstatus, dwArg18, s1, dwArg98, dwArgCC, out s0_403, out s1_404, out a0_176, out a1_405, out a3_406, out a4, out a5_407, out s2_408, out s3_409, out s4_410, out s5_411, out s6_412, out s7_413, out s9_414, out s10_415, out s11_416);
		if (a0_176 == 0x00)
			goto l2300BD14;
	}
	0x00 = dwArgA8;
	a4Out = a4;
	return ra;
}

// 2300BD44: Register Eq_2 sm_connect_ind(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0128, Register out ptr32 a4Out, Register out (ptr32 Eq_38727) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s10Out)
// Called from:
//      sm_supplicant_deauth_cfm
//      sm_auth_send
//      sm_assoc_req_send
//      sm_auth_handler
//      sm_assoc_rsp_handler
//      sm_handle_supplicant_result
//      sm_rsp_timeout_ind_handler
//      scanu_start_cfm_handler
//      scanu_join_cfm_handler
//      rxu_mgt_ind_handler
//      mm_set_vif_state_cfm_handler
//      mm_sta_add_cfm_handler
Eq_2 sm_connect_ind(Eq_2 ra, Eq_2 s0, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgC8, Eq_2 dwArg0128, ptr32 & a4Out, struct Eq_38727 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s10Out)
{
	struct Eq_38731 * s3_27 = (word32) *((word32) g_t4201BBD8 + 61);
	((word32) s0 + 9)->u1 = (byte) s3_27;
	Eq_2 a3_46;
	word32 a4_436;
	word32 a1_434;
	word32 a2_435;
	word32 a6_438;
	word32 a5_437;
	word32 a7_439;
	memcpy((word32) s0 + 2, &s3_27->b4201AA48 + 792, 0x06, out a1_434, out a2_435, out a3_46, out a4_436, out a5_437, out a6_438, out a7_439);
	*((word32) s0 + 0x0A) = (byte) (word32) s3_27->b4201AA48;
	struct Eq_38771 * a5_61;
	word32 s3_73;
	word32 s4_74;
	word32 s9_451;
	word32 s11_452;
	word32 t4_453;
	word32 a1_442;
	word32 s1_440;
	word32 a0_441;
	word32 a3_444;
	word32 a2_443;
	word32 a7_446;
	word32 a4_445;
	word32 s2_447;
	word32 s5_448;
	word32 s8_450;
	word32 s7_449;
	word32 s6_244;
	ptr32 s10_241;
	Eq_2 ra_231 = printf(ra, &g_t2307523C, a3_46, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_440, out a0_441, out a1_442, out a2_443, out a3_444, out a4_445, out a5_61, out a7_446, out s2_447, out s3_73, out s4_74, out s5_448, out s6_244, out s7_449, out s8_450, out s9_451, out s10_241, out s11_452, out t4_453);
	((word32) s0 + 11)->u1 = 0x00;
	if (a5_61 != null)
	{
		struct Eq_38840 * a5_90 = (word32) a5_61->b0004;
		((word32) s0 + 822)->u1 = (byte) a5_90;
		struct Eq_38849 * a5_93 = (word32) a5_90->w0006;
		((word32) s0 + 0x0338)->u0 = (word16) a5_93;
		struct Eq_38828 * a5_96 = (word32) a5_93->w0008;
		*((word32) s0 + 828) = a5_96;
		Eq_8894 a5_99 = (word32) a5_96->w000A;
		*((word32) s0 + 832) = a5_99;
		*((word32) s0 + 0x033A) = (byte) (word32) *((word32) a5_99 + 5);
	}
	else
	{
		((word32) s0 + 822)->u1 = 0x00;
		((word32) s0 + 0x0338)->u0 = 0x00;
		*((word32) s0 + 828) = null;
		((word32) s0 + 832)->u1 = 0x00;
		((word32) s0 + 0x033A)->u1 = 0x00;
	}
	struct Eq_38894 * a5_109 = s3_73 + 0x05D8 + s4_74;
	int32 a4_111 = a5_109->dw03E0;
	((word32) s0 + 0x0C)->u1 = (byte) (a4_111 & 0x01);
	Eq_2 a3_107 = 0x00;
	if ((a4_111 & 0x01) != 0x00)
		a3_107 = (word32) a5_109->b03C1;
	int32 * s2_233;
	*((word32) s0 + 0x0D) = (byte) a3_107;
	((word32) s0 + 8)->u1 = 0x00;
	if (s6_244 == 0x00)
	{
		word32 s1_478;
		word32 a0_479;
		word32 a1_480;
		word32 a4_481;
		word32 a5_482;
		word32 s3_483;
		word32 s4_484;
		ke_state_set(0x06, 0x00, mstatus, out s1_478, out a0_479, out a1_480, out a4_481, out a5_482, out s2_233, out s3_483, out s4_484);
	}
	else
	{
		word32 s3_460;
		word32 s4_461;
		word32 a4_457;
		word32 a5_458;
		word32 s2_459;
		word32 s1_454;
		word32 a0_455;
		word32 a1_456;
		ke_state_set(0x06, 0x08, mstatus, out s1_454, out a0_455, out a1_456, out a4_457, out a5_458, out s2_459, out s3_460, out s4_461);
		word32 s5_471;
		word32 s4_470;
		word32 s8_473;
		word32 s6_472;
		word32 s9_474;
		word32 s10_475;
		Eq_2 a3_158;
		int32 s7_170;
		word32 s2_468;
		word32 s3_469;
		word32 a5_466;
		word32 a7_467;
		word32 a1_464;
		word32 a2_465;
		word32 a0_463;
		word32 s1_462;
		word32 s11_476;
		word32 t4_477;
		Eq_2 a4_159;
		Eq_2 ra_161 = printf(ra_231, &g_t2307525C, a3_107, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_462, out a0_463, out a1_464, out a2_465, out a3_158, out a4_159, out a5_466, out a7_467, out s2_468, out s3_469, out s4_470, out s5_471, out s6_472, out s7_170, out s8_473, out s9_474, out s10_475, out s11_476, out t4_477);
		if (s7_170 >= 0x00)
		{
			struct Eq_39007 * s2_189;
			byte * s5_192;
			struct Eq_36001 * s7_194;
			word32 s1_486;
			word32 a0_487;
			word32 a1_488;
			word32 a2_489;
			word32 a3_490;
			word32 a4_491;
			word32 a5_492;
			word32 a7_493;
			word32 s3_494;
			word32 s4_495;
			word32 s6_496;
			word32 s8_497;
			word32 s9_498;
			word32 s10_499;
			word32 s11_500;
			word32 t4_501;
			ra_161 = scanu_rm_exist_ssid(printf(ra_161, &g_t23075288, a3_158, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_486, out a0_487, out a1_488, out a2_489, out a3_490, out a4_491, out a5_492, out a7_493, out s2_189, out s3_494, out s4_495, out s5_192, out s6_496, out s7_194, out s8_497, out s9_498, out s10_499, out s11_500, out t4_501), s5_192, s7_194, out a4_159);
			s2_189->dw0014 = ~0x00;
		}
		word32 s1_485;
		ra_231 = sm_delete_resources(ra_161, a4_159, mstatus, s6, dwLoc18, dwLoc08, dwArg08, s5, dwArgC8, dwArg0128, out s1_485, out s2_233, out s6_244, out s10_241);
	}
	struct Eq_39056 * s2_275;
	word32 s1_502;
	word32 a3_503;
	word32 a4_504;
	word32 a5_505;
	word32 s4_506;
	Eq_2 s0_273 = ke_msg_free(*s2_233 + ~0x0B, mstatus, out s1_502, out a3_503, out a4_504, out a5_505, out s2_275, out s4_506);
	s2_275->dw0000 = 0x00;
	s2_275->b0011 = 0x00;
	*s0_273 = (word16) s6_244;
	ptr32 a4_288;
	struct Eq_38727 * s2_293;
	ptr32 s3_294;
	word32 s1_507;
	word32 a0_508;
	word32 a1_509;
	word32 a2_510;
	word32 a3_511;
	word32 a5_512;
	word32 s4_513;
	word32 s8_514;
	ke_msg_send(s0_273, mstatus, out s1_507, out a0_508, out a1_509, out a2_510, out a3_511, out a4_288, out a5_512, out s2_293, out s3_294, out s4_513, out s8_514);
	s2_293->dw0004 = 0x00;
	0x00 = (uint16) dwArg0128;
	a4Out = a4_288;
	s2Out = s2_293;
	s3Out = s3_294;
	s4Out = dwArg78;
	s10Out = s10_241;
	return ra_231;
}

// 2300BEB2: void sm_supplicant_deauth_cfm(Register Eq_2 ra, Register Eq_2 s0, Register ui32 a1, Register Eq_2 a3, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0128)
void sm_supplicant_deauth_cfm(Eq_2 ra, Eq_2 s0, ui32 a1, Eq_2 a3, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArg0128)
{
	if (a1 << 0x08 >= 0x00)
	{
		word32 a5_105;
		word32 a4_104;
		word32 a3_103;
		word32 a2_102;
		word32 a1_101;
		word32 a0_100;
		word32 s1_99;
		word32 a7_106;
		word32 s2_107;
		word32 s3_108;
		word32 s4_109;
		word32 s7_110;
		word32 s8_111;
		word32 s9_112;
		word32 s10_113;
		word32 s11_114;
		word32 t4_115;
		ra = printf(ra, &g_t230753F8, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_99, out a0_100, out a1_101, out a2_102, out a3_103, out a4_104, out a5_105, out a7_106, out s2_107, out s3_108, out s4_109, out s5, out s6, out s7_110, out s8_111, out s9_112, out s10_113, out s11_114, out t4_115);
	}
	word32 a4_116;
	word32 s2_117;
	word32 s3_118;
	word32 s4_119;
	word32 s10_120;
	sm_connect_ind(ra, s0, s5, s6, mstatus, dwArg08, dwArg40, dwArg44, dwArg68, dwArg8C, dwArgC8, dwArg0128, out a4_116, out s2_117, out s3_118, out s4_119, out s10_120);
}

word32 g_dw2300BEC6 = 0x60EFC606;
// 2300BED6: void sm_auth_send(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s5, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128)
// Called from:
//      sm_auth_handler
//      me_set_active_cfm_handler
void sm_auth_send(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s5, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128)
{
	struct Eq_39215 * a5_24 = (word32) *((word32) g_t4201BBD8 + 61);
	Eq_2 a5_35 = a5_24->t4201AD8C;
	word32 s7_36 = (word32) a5_24->b4201AA48;
	struct Eq_39231 * s1_47;
	struct Eq_39232 * s4_48;
	word32 a0_52;
	Eq_2 s2_56;
	word32 s0_395;
	word32 a1_396;
	word32 a3_397;
	word32 a4_398;
	word32 a5_399;
	word32 s3_400;
	word32 s5_401;
	word32 s6_402;
	word32 s7_403;
	word32 s8_404;
	word32 s9_405;
	word32 s10_406;
	word32 s11_407;
	txl_frame_get(ra, (word32) ((word32) *((word32) a5_35 + 2) != 0x00), (struct Eq_14556 *) 0x0100, 0x05D8, a5_35, fflags, frm, mstatus, dwArgD8, dwArgF8, dwArg0118, out s0_395, out s1_47, out a0_52, out a1_396, out a3_397, out a4_398, out a5_399, out s2_56, out s3_400, out s4_48, out s5_401, out s6_402, out s7_403, out s8_404, out s9_405, out s10_406, out s11_407);
	if (a0_52 == 0x00)
	{
		0x00 = (uint16) dwArg0128;
		word32 a4_445;
		word32 s2_446;
		word32 s3_447;
		word32 s4_448;
		word32 s10_449;
		sm_connect_ind(ra, dwArgE4, a0, a1, mstatus, dwArg08, dwArg40, dwArg44, dwArg68, dwArg8C, dwArgC8, dwArg0128, out a4_445, out s2_446, out s3_447, out s4_448, out s10_449);
	}
	else
	{
		word32 a4_408;
		tpc_update_frame_tx_power(ra, s2_56, fflags, frm, out a4_408);
		struct Eq_20436 * s0_114 = s1_47->ptr0068;
		s1_47->b014C = 0xB0;
		s1_47->b014D = 0x00;
		s1_47->b014E = 0x00;
		s1_47->b014F = 0x00;
		word32 a1_409;
		word32 a2_410;
		word32 a3_411;
		word32 a4_412;
		word32 a5_413;
		word32 a6_414;
		word32 a7_415;
		memcpy(&s1_47->b014F + 1, s7_36 + 0x420190EE, 0x06, out a1_409, out a2_410, out a3_411, out a4_412, out a5_413, out a6_414, out a7_415);
		word32 a1_416;
		word32 a2_417;
		word32 a3_418;
		word32 a4_419;
		word32 a5_420;
		word32 a6_421;
		word32 a7_422;
		memcpy(&s1_47->b014F + 7, (word32) s2_56 + 80, 0x06, out a1_416, out a2_417, out a3_418, out a4_419, out a5_420, out a6_421, out a7_422);
		word32 a1_423;
		word32 a2_424;
		word32 a3_425;
		word32 a4_426;
		word32 a5_427;
		word32 a6_428;
		word32 a7_429;
		memcpy(&s1_47->b014F + 0x0D, s7_36 + 0x420190EE, 0x06, out a1_423, out a2_424, out a3_425, out a4_426, out a5_427, out a6_428, out a7_429);
		uint32 a0_174 = txl_get_seq_ctrl();
		s1_47->b0162 = (byte) a0_174;
		s1_47->b0163 = (byte) (a0_174 >> 8);
		s0_114->b002F = (byte) (word32) *((word32) s2_56 + 87);
		word32 a5_182 = (word32) *((word32) s2_56 + 96);
		s0_114->b005E = 0x00;
		s0_114->b0060 = 0x00;
		s0_114->b0030 = (byte) a5_182;
		byte * s1_180 = &s1_47->b014C;
		int32 s2_188 = 0x18;
		if ((word32) s4_48->b003B == 0x01 && a0 == 0x03)
		{
			s0_114 = txu_cntrl_protect_mgmt_frame(s0_114, &s1_47->b014C, 0x18, out s1_180);
			s2_188 = (word32) s0_114->b005E + 24;
		}
		struct Eq_13120 * a3_226;
		word32 a5_430;
		struct Eq_38648 * a0_223 = me_build_authenticate(s1_180 + s2_188, (word32) s4_48->b003B, a0, 0x00, a1, out a3_226, out a5_430);
		word32 a5_229 = (word32) s0_114->b0060;
		Eq_2 s0_230 = *((word32) a1 + 0x006C);
		*((word32) s0_230 + 720) = s0_230;
		*((word32) s0_230 + 0x02CC) = &g_t2300B642;
		struct Eq_39451 * a0_233 = a0_223 + (a5_229 + s2_188) / 0x2300BEE5;
		word32 a4_237 = g_dw2300B656;
		a0_233->dw0020 = a4_237;
		a0_233->dw2300B659 = a4_237;
		Eq_2 a3_251;
		Eq_2 a4_252;
		word32 s0_431;
		word32 s1_432;
		word32 a0_433;
		word32 a1_434;
		word32 a5_435;
		word32 s2_436;
		word32 s3_437;
		word32 s4_438;
		word32 s5_439;
		word32 s6_440;
		word32 s7_441;
		word32 s9_442;
		word32 s10_443;
		word32 s11_444;
		ke_timer_set(txl_frame_push(ra, s0_230, 0x03, a3_226, (char *) &a0_233->dw0020 + 0x2300B621, mstatus, dwArg08, s5, dwArg88, dwArgBC, out s0_431, out s1_432, out a0_433, out a1_434, out a3_251, out a4_252, out a5_435, out s2_436, out s3_437, out s4_438, out s5_439, out s6_440, out s7_441, out s9_442, out s10_443, out s11_444), 0x01FFF806, 0x06, 0x00032000, a3_251, a4_252, mstatus, dwLoc18, dwArg78, dwArgD8);
		0x00 = (uint16) dwArg0128;
		word32 s1_450;
		word32 a0_451;
		word32 a1_452;
		word32 a4_453;
		word32 a5_454;
		word32 s2_455;
		word32 s3_456;
		word32 s4_457;
		ke_state_set(0x06, 0x05, mstatus, out s1_450, out a0_451, out a1_452, out a4_453, out a5_454, out s2_455, out s3_456, out s4_457);
	}
}

// 2300C056: void sm_assoc_req_send(Register Eq_2 ra, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s10, Register (ptr32 byte) s11, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack word32 dwArg0198)
// Called from:
//      sm_auth_handler
//      me_set_active_cfm_handler
void sm_assoc_req_send(Eq_2 ra, Eq_2 a4, Eq_2 s2, Eq_2 s7, Eq_2 s9, Eq_2 s10, byte * s11, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, word32 dwArg0198)
{
	Eq_2 s6_30 = g_t4201BBD8;
	struct Eq_39592 * s2_33 = (word32) *((word32) s6_30 + 61);
	Eq_2 a5_38 = s2_33->t4201AD8C;
	word32 s9_39 = (word32) s2_33->b4201AA48;
	Eq_2 s0_50;
	Eq_2 s1_51;
	word32 s4_52;
	word32 a0_56;
	struct Eq_39610 * s2_60;
	word32 s9_469;
	word32 s10_470;
	word32 s11_471;
	word32 s6_466;
	word32 s7_467;
	word32 s8_468;
	word32 a1_460;
	word32 s3_464;
	word32 s5_465;
	word32 a3_461;
	word32 a4_462;
	word32 a5_463;
	txl_frame_get(ra, (word32) ((word32) *((word32) a5_38 + 2) != 0x00), (struct Eq_14556 *) 0x0100, a4, a5_38, fflags, frm, mstatus, dwArgC8, dwArgE8, dwArg0108, out s0_50, out s1_51, out a0_56, out a1_460, out a3_461, out a4_462, out a5_463, out s2_60, out s3_464, out s4_52, out s5_465, out s6_466, out s7_467, out s8_468, out s9_469, out s10_470, out s11_471);
	uint16 wLoc36_368 = SLICE(s10, uint16, 16);
	if (a0_56 != 0x00)
	{
		int32 s8_99 = g_dw4201BBDC;
		word32 a4_477;
		tpc_update_frame_tx_power(ra, s1_51, fflags, frm, out a4_477);
		int32 a5_110 = (word32) g_b4201BBE9;
		if (a5_110 != 0x00)
			a5_110 = 32;
		*((word32) s1_51 + 332) = (byte) a5_110;
		((word32) s1_51 + 333)->u1 = 0x00;
		((word32) s1_51 + 334)->u1 = 0x00;
		((word32) s1_51 + 335)->u1 = 0x00;
		word32 a6_483;
		word32 a7_484;
		word32 a4_481;
		word32 a5_482;
		word32 a2_479;
		word32 a3_480;
		word32 a1_478;
		memcpy((word32) s1_51 + 336, s9_39 + 0x420190EE, 0x06, out a1_478, out a2_479, out a3_480, out a4_481, out a5_482, out a6_483, out a7_484);
		word32 a7_491;
		word32 a6_490;
		word32 a5_489;
		word32 a3_487;
		word32 a4_488;
		word32 a1_485;
		word32 a2_486;
		memcpy((word32) s1_51 + 342, (char *) s2_60 + 0x4201AA38, 0x06, out a1_485, out a2_486, out a3_487, out a4_488, out a5_489, out a6_490, out a7_491);
		word32 a2_493;
		word32 a1_492;
		word32 a3_494;
		word32 a4_495;
		word32 a5_496;
		word32 a6_497;
		word32 a7_498;
		memcpy((word32) s1_51 + 348, s9_39 + 0x420190EE, 0x06, out a1_492, out a2_493, out a3_494, out a4_495, out a5_496, out a6_497, out a7_498);
		uint32 a0_184 = txl_get_seq_ctrl();
		((word32) s1_51 + 354)->u1 = (byte) a0_184;
		((word32) s1_51 + 355)->u1 = (byte) (a0_184 >> 8);
		struct Eq_39771 * a0_206;
		word32 a3_209;
		struct Eq_39773 * a4_210;
		struct Eq_39774 * s2_217;
		struct Eq_39775 * s8_223;
		Eq_2 ra_214 = me_build_associate_req(ra, s4_52 + 1107404648, (word32) s2_60->b4201AA3F, fp + -52, fp + -54, s6_30, s6_30, s8_99, (word32) s1_51 + 332, s11, dwLoc3C, dwArg00, out a0_206, out a3_209, out a4_210, out s2_217, out s8_223);
		Eq_2 s0_230 = a4_210->t006C;
		((word32) s0_230 + 47)->u1 = (byte) (word32) s2_217->b0057;
		word32 a5_233 = (word32) s2_217->b0060;
		*((word32) s0_230 + 720) = s0_230;
		*((word32) s0_230 + 48) = (byte) a5_233;
		*((word32) s0_230 + 0x02CC) = &g_t2300B642;
		word32 a4_240 = g_dw2300B656;
		a0_206->dw2300B671 = a4_240;
		a0_206->dw0038 = a4_240;
		struct Eq_13120 * a3_235 = a3_209 - s8_223;
		struct Eq_39775 * a5_247 = s8_223;
		struct Eq_39775 * a4_248 = s8_223 + (word32) wLoc36_368;
		while (a5_247 != a4_248)
		{
			++a5_247;
			Mem256[a5_247 + 19:byte] = SLICE(CONVERT(Mem253[a3_235 + a5_247:byte], byte, word32), byte, 0);
		}
		struct Eq_13346 * a5_258 = (word32) wLoc36_368;
		s8_223[0x0E] = (struct Eq_39775) (word16) a5_258;
		Eq_2 a3_270;
		Eq_2 a4_271;
		word32 s0_499;
		word32 s1_500;
		word32 a0_501;
		word32 a1_502;
		word32 a5_503;
		word32 s2_504;
		word32 s3_505;
		word32 s4_506;
		word32 s5_507;
		word32 s6_508;
		word32 s7_509;
		word32 s9_510;
		word32 s10_511;
		word32 s11_512;
		ke_timer_set(txl_frame_push(ra_214, s0_230, 0x03, a3_235, a5_258, mstatus, dwLoc08, s9, dwArg78, dwArgAC, out s0_499, out s1_500, out a0_501, out a1_502, out a3_270, out a4_271, out a5_503, out s2_504, out s3_505, out s4_506, out s5_507, out s6_508, out s7_509, out s9_510, out s10_511, out s11_512), 0x01FFF806, 0x06, 0x00032000, a3_270, a4_271, mstatus, s2, dwArg68, dwArgC8);
		word32 s1_513;
		word32 a0_514;
		word32 a1_515;
		word32 a4_516;
		word32 a5_517;
		word32 s2_518;
		word32 s3_519;
		word32 s4_520;
		ke_state_set(0x06, 0x06, mstatus, out s1_513, out a0_514, out a1_515, out a4_516, out a5_517, out s2_518, out s3_519, out s4_520);
	}
	else
	{
		word32 s4_475;
		word32 s10_476;
		word32 a4_472;
		word32 s2_473;
		word32 s3_474;
		sm_connect_ind(ra, s0_50, 0x4201A000, s6_30, mstatus, s10, dwArg00, dwArg04, dwArg28, s7, dwArg88, dwArgE8, out a4_472, out s2_473, out s3_474, out s4_475, out s10_476);
	}
	0x00 = dwArg0198;
}

