pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300C1F4: Register Eq_2 sm_assoc_done(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Register out ptr32 s4Out)
// Called from:
//      sm_assoc_rsp_handler
Eq_2 sm_assoc_done(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, ptr32 & s4Out)
{
	Eq_2 a0_20;
	struct Eq_39944 * s0_28;
	word32 s1_29;
	word32 a1_85;
	word32 a2_86;
	word32 a3_87;
	word32 a4_88;
	word32 a5_89;
	word32 a6_90;
	word32 s2_91;
	word32 s3_92;
	word32 s4_93;
	word32 s8_94;
	Eq_2 ra_27 = ke_msg_alloc(ra, 0x1E, 0x00, 0x04, a4, mstatus, dwArg08, out s0_28, out s1_29, out a0_20, out a1_85, out a2_86, out a3_87, out a4_88, out a5_89, out a6_90, out s2_91, out s3_92, out s4_93, out s8_94);
	*a0_20 = (word16) s1_29;
	((word32) a0_20 + 2)->u1 = 0x01;
	*((word32) a0_20 + 3) = (byte) (word32) s0_28->b003D;
	word32 s1_95;
	word32 a0_96;
	word32 a1_97;
	word32 a2_98;
	word32 a3_99;
	word32 a4_100;
	word32 a5_101;
	word32 s2_102;
	word32 s3_103;
	word32 s4_104;
	word32 s8_105;
	ke_msg_send(a0_20, mstatus, out s1_95, out a0_96, out a1_97, out a2_98, out a3_99, out a4_100, out a5_101, out s2_102, out s3_103, out s4_104, out s8_105);
	ptr32 s4_73;
	word32 s1_106;
	word32 a0_107;
	word32 a1_108;
	word32 a4_109;
	word32 a5_110;
	word32 s2_111;
	word32 s3_112;
	ke_state_set(0x06, 0x07, mstatus, out s1_106, out a0_107, out a1_108, out a4_109, out a5_110, out s2_111, out s3_112, out s4_73);
	s4Out = s4_73;
	return ra_27;
}

// 2300C238: void sm_auth_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s10, Register (ptr32 byte) s11, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack word32 dwArg0198)
// Called from:
//      rxu_mgt_ind_handler
void sm_auth_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s10, byte * s11, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, word32 dwArg0198)
{
	Eq_2 a1_105;
	Eq_2 a0_106;
	struct Eq_40080 * s1_18;
	Eq_2 a3_22;
	Eq_2 s0_27;
	Eq_2 s2_28;
	Eq_2 ra_26 = ke_timer_clear(ra, a0, 0x01FFF806, 0x06, mstatus, dwArg0108, out s0_27, out s1_18, out a3_22, out s2_28);
	if (((word32) s1_18->b0005 << 8 | (word32) s1_18->b0004) == 0x00)
	{
		Eq_2 a4_108 = (word32) *((word32) s0_27 + 28);
		ui32 a5_110 = (word32) *((word32) s0_27 + 29) << 8 | a4_108;
		if (a5_110 == 0x00)
		{
l2300C26E:
			sm_assoc_req_send(ra_26, a4_108, s2_28, s7, s9, s10, s11, fflags, frm, mstatus, dwArg00, dwArg04, dwArg28, dwArg68, dwArg78, dwArg88, dwArgAC, dwArgC8, dwArgE8, dwArg0108, dwArg0198);
			return;
		}
		if (a5_110 != 0x01)
			return;
		ui32 a5_119 = (word32) s1_18->b0003 << 8 | (word32) s1_18->b0002;
		a4_108.u0 = 0x04;
		if (a5_119 == 0x04)
			goto l2300C26E;
		if (a5_119 != 0x02)
		{
			word32 a4_425;
			word32 s2_426;
			word32 s3_427;
			word32 s4_428;
			word32 s10_429;
			sm_connect_ind(ra_26, s0_27, s5, s6, mstatus, dwLoc08, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgB8, dwArg0118, out a4_425, out s2_426, out s3_427, out s4_428, out s10_429);
			assert_warn();
			return;
		}
		if ((word32) *s0_27 <= 0x0087)
		{
			word32 s1_430;
			word32 a0_431;
			word32 a1_432;
			word32 a2_433;
			word32 a3_434;
			word32 a4_435;
			word32 a5_436;
			word32 a7_437;
			word32 s2_438;
			word32 s3_439;
			word32 s4_440;
			word32 s5_441;
			word32 s6_442;
			word32 s7_443;
			word32 s8_444;
			word32 s9_445;
			word32 s10_446;
			word32 s11_447;
			word32 t4_448;
			printf(ra_26, &g_t230751DC, a3_22, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_430, out a0_431, out a1_432, out a2_433, out a3_434, out a4_435, out a5_436, out a7_437, out s2_438, out s3_439, out s4_440, out s5_441, out s6_442, out s7_443, out s8_444, out s9_445, out s10_446, out s11_447, out t4_448);
			return;
		}
		a1_105 = (word32) s0_27 + 36;
		a0_106.u0 = 0x03;
	}
	else
	{
		Eq_2 a5_38 = g_t4201BBD8;
		Eq_2 a3_40 = (word32) *((word32) a5_38 + 59);
		if (a3_40 != 0x01 || (word32) (*((word32) a5_38 + 320)) == 0x00)
		{
			word32 a1_405;
			word32 a2_406;
			Eq_2 s5_63;
			Eq_2 s6_64;
			word32 a3_407;
			word32 a4_408;
			word32 a5_409;
			word32 a7_410;
			word32 s2_411;
			word32 s3_412;
			word32 s4_413;
			word32 s7_414;
			word32 a0_404;
			word32 s1_403;
			word32 s8_415;
			word32 s9_416;
			word32 s10_417;
			word32 s11_418;
			word32 t4_419;
			Eq_2 ra_56 = printf(ra_26, &g_t23075204, a3_40, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_403, out a0_404, out a1_405, out a2_406, out a3_407, out a4_408, out a5_409, out a7_410, out s2_411, out s3_412, out s4_413, out s5_63, out s6_64, out s7_414, out s8_415, out s9_416, out s10_417, out s11_418, out t4_419);
			word32 a4_420;
			word32 s2_421;
			word32 s3_422;
			word32 s4_423;
			word32 s10_424;
			sm_connect_ind(ra_56, s0, s5_63, s6_64, mstatus, dwArg08, dwArg40, dwArg44, dwArg68, dwArg8C, dwArgC8, dwArg0128, out a4_420, out s2_421, out s3_422, out s4_423, out s10_424);
			return;
		}
		((word32) a5_38 + 59)->u1 = 0x00;
		a1_105.u0 = 0x00;
		a0_106.u0 = 0x01;
	}
	sm_auth_send(ra_26, a0_106, a1_105, s5, fflags, frm, mstatus, dwArg08, dwArg40, dwArg44, dwArg68, dwArg78, dwArg88, dwArg8C, dwArgBC, dwArgC8, dwArgD8, dwArgE4, dwArgF8, dwArg0118, dwArg0128);
}

// 2300C336: void sm_assoc_rsp_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s7, Register Eq_2 s9, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack word32 dwArg48, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack word32 dwArg0158, Stack word32 dwArg0198)
// Called from:
//      rxu_mgt_ind_handler
void sm_assoc_rsp_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s7, Eq_2 s9, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, word32 dwArg48, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, word32 dwArg0158, word32 dwArg0198)
{
	Eq_2 a3_46;
	struct Eq_40324 * s2_52;
	word32 s0_391;
	word32 s1_392;
	Eq_2 ra_50 = ke_timer_clear(ra, s0, 0x01FFF806, 0x06, mstatus, dwArgD8, out s0_391, out s1_392, out a3_46, out s2_52);
	Eq_2 s0_60 = (word32) s2_52->b0003 << 8 | (word32) s2_52->b0002;
	word32 dwLoc34_314 = SEQ(bLoc31, 0x00, wLoc34);
	if (s0_60 == 0x00)
	{
		Eq_2 a4_115 = (word32) *a0;
		word32 s4_148;
		Eq_2 a3_168;
		word32 s1_175;
		word32 s3_179;
		ptr32 s5_181;
		struct Eq_40422 * s6_182;
		ptr32 s7_183;
		int32 s1_209;
		word32 a5_415;
		word32 s4_416;
		word32 s8_417;
		word32 s9_418;
		word32 a3_419;
		word32 a4_420;
		word32 s2_421;
		word32 s3_422;
		Eq_2 s0_208 = tpc_update_vif_tx_power(me_init_rate(sm_assoc_done(ra_50, a4_115, mstatus, dwLoc38, out s4_148), s4_148 + 0x420190D0, s9, fflags, frm, mstatus, dwLoc34_314, dwLoc1C, dwLoc08, dwArg28, dwArgA8, dwArgD8, dwArg0158, out s1_175, out a3_168, out a5_415, out s3_179, out s4_416, out s5_181, out s6_182, out s7_183, out s8_417, out s9_418), s1_175 + s3_179, fp + -49, fp + -50, a3_168, fflags, frm, out s1_209, out a3_419, out a4_420, out s2_421, out s3_422);
		Eq_2 a4_219 = 0x00;
		byte (* a3_220)[] = &s6_182->w0010 + 2 + (word32) s6_182->w000E / 18;
		while (s0_208 != a4_219)
		{
			Mem230[a3_220 + a4_219:byte] = SLICE(CONVERT(Mem225[s5_181 + a4_219 + 0x0022:byte], byte, word32), byte, 0);
			a4_219 = (word32) a4_219 + 1;
		}
		s6_182->w0010 = (word16) s0_208;
		if (((s7_183 + 0x05D8 + s1_209)->dw03E8 & 0x12FFFA00) != 0x00)
			supplicantInitSession(mstatus, dwArg48, dwArgD8, dwArgF8, dwArg0118, dwArg0138);
	}
	else
	{
		Eq_2 s5_79;
		Eq_2 s6_80;
		word32 s10_407;
		word32 s9_406;
		word32 s8_405;
		word32 s7_404;
		word32 s1_393;
		word32 a0_394;
		word32 a1_395;
		word32 a2_396;
		word32 a4_398;
		word32 a3_397;
		word32 a5_399;
		word32 a7_400;
		word32 s2_401;
		word32 s3_402;
		word32 s4_403;
		word32 s11_408;
		word32 t4_409;
		word32 a4_410;
		word32 s2_411;
		word32 s3_412;
		word32 s4_413;
		word32 s10_414;
		sm_connect_ind(printf(ra_50, &g_t230751A8, a3_46, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_393, out a0_394, out a1_395, out a2_396, out a3_397, out a4_398, out a5_399, out a7_400, out s2_401, out s3_402, out s4_403, out s5_79, out s6_80, out s7_404, out s8_405, out s9_406, out s10_407, out s11_408, out t4_409), s0_60, s5_79, s6_80, mstatus, dwLoc38, dwArg00, dwArg04, dwArg28, s7, dwArg88, dwArgE8, out a4_410, out s2_411, out s3_412, out s4_413, out s10_414);
	}
	0x00 = dwArg0198;
}

// 2300C48E: void sm_deauth_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128)
// Called from:
//      rxu_mgt_ind_handler
void sm_deauth_handler(Eq_2 ra, Eq_2 a3, Eq_2 s2, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArg0108, Eq_2 dwArg0128)
{
	Eq_2 s0_19 = g_t4201BBD8;
	word32 a0_20;
	word32 s2_252;
	word32 a4_251;
	word32 a2_250;
	ke_state_get(0x06, dwArg18, out a0_20, out a2_250, out a4_251, out s2_252);
	if (a0_20 == 0x08)
		return;
	word32 a0_29;
	struct Eq_40550 * s2_34;
	word32 a4_254;
	word32 a2_253;
	Eq_2 s1_33 = ke_state_get(0x06, dwArg18, out a0_29, out a2_253, out a4_254, out s2_34);
	if (a0_29 == 0x00)
	{
		if ((word32) *((word32) s1_33 + 0x4201AA40) != 0x00)
		{
			word32 a5_264;
			word32 s2_265;
			word32 a4_263;
			word32 a1_262;
			word32 a0_261;
			word32 s1_260;
			word32 s3_266;
			word32 s4_267;
			ke_state_set(0x06, 0x08, mstatus, out s1_260, out a0_261, out a1_262, out a4_263, out a5_264, out s2_265, out s3_266, out s4_267);
			Eq_2 a4_74;
			word32 s1_268;
			word32 a0_269;
			word32 a1_270;
			word32 a2_271;
			word32 a3_272;
			word32 a5_273;
			word32 a7_274;
			word32 s2_275;
			word32 s3_276;
			word32 s4_277;
			word32 s5_278;
			word32 s6_279;
			word32 s7_280;
			word32 s8_281;
			word32 s9_282;
			word32 s10_283;
			word32 s11_284;
			word32 t4_285;
			word32 a4_286;
			word32 s4_287;
			sm_disconnect_process(printf(ra, &g_t230752B8, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_268, out a0_269, out a1_270, out a2_271, out a3_272, out a4_74, out a5_273, out a7_274, out s2_275, out s3_276, out s4_277, out s5_278, out s6_279, out s7_280, out s8_281, out s9_282, out s10_283, out s11_284, out t4_285), a4_74, mstatus, s2, dwLoc08, dwArg08, dwArg18, dwArg58, dwArgC8, dwArg0128, out a4_286, out s4_287);
		}
	}
	else
	{
		if ((word32) *((word32) s0_19 + 61) != (word32) s2_34->b0008)
			return;
		word32 s10_259;
		word32 s4_258;
		word32 s3_257;
		word32 s2_256;
		word32 a4_255;
		sm_connect_ind(ra, s0_19, s5, s6, mstatus, s2, dwArg20, dwArg24, dwArg48, ra, dwArgA8, dwArg0108, out a4_255, out s2_256, out s3_257, out s4_258, out s10_259);
	}
}

// 2300C52A: Register Eq_2 sm_handle_supplicant_result(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s5, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out ptr32 a4Out, Register out ptr32 s10Out)
// Called from:
//      keyMgmtKeyGroupTxDone.isra.1
//      keyMgmtStaRsnSecuredTimeoutHandler
Eq_2 sm_handle_supplicant_result(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a1, Eq_2 a3, Eq_2 s2, Eq_2 s5, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, ptr32 & a4Out, ptr32 & s10Out)
{
	Eq_2 a4_41 = (word32) a0 + 432;
	Eq_2 s6_211 = (word32) *((word32) a0 + 1107398890);
	if (a1 == 0x00)
		((word32) a0 + 0x42019101)->u1 = 0x02;
	else
	{
		s5 = a0;
		if (a1 == 0x0F)
		{
			word32 s1_381;
			word32 a0_382;
			word32 a1_383;
			word32 a2_384;
			word32 a3_385;
			word32 a5_386;
			word32 a7_387;
			word32 s2_388;
			word32 s3_389;
			word32 s4_390;
			word32 s7_391;
			word32 s8_392;
			word32 s9_393;
			word32 s10_394;
			word32 s11_395;
			word32 t4_396;
			ra = printf(ra, &g_t2307537C, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_381, out a0_382, out a1_383, out a2_384, out a3_385, out a4_41, out a5_386, out a7_387, out s2_388, out s3_389, out s4_390, out s5, out s6_211, out s7_391, out s8_392, out s9_393, out s10_394, out s11_395, out t4_396);
		}
		Eq_2 a5_65 = *((word32) s6_211 + 1107406220);
		Eq_2 s0_81;
		struct Eq_31105 * s4_83;
		word32 a0_87;
		Eq_2 s2_91;
		word32 s3_92;
		word32 s1_369;
		word32 a1_370;
		word32 a3_371;
		word32 a4_372;
		word32 a5_373;
		word32 s5_374;
		word32 s6_375;
		word32 s7_376;
		word32 s8_377;
		word32 s9_378;
		word32 s10_379;
		word32 s11_380;
		txl_frame_get(ra, (word32) ((word32) *((word32) a5_65 + 2) != 0x00), (struct Eq_14556 *) 0x0100, a4_41, a5_65, fflags, frm, mstatus, dwArgE8, dwArg0108, dwArg0128, out s0_81, out s1_369, out a0_87, out a1_370, out a3_371, out a4_372, out a5_373, out s2_91, out s3_92, out s4_83, out s5_374, out s6_375, out s7_376, out s8_377, out s9_378, out s10_379, out s11_380);
		if (a0_87 != 0x00)
		{
			word32 a4_397;
			tpc_update_frame_tx_power(ra, s2_91, fflags, frm, out a4_397);
			Eq_2 s1_112 = *((word32) s0_81 + 0x0068);
			((word32) s0_81 + 332)->u1 = 0xC0;
			((word32) s0_81 + 333)->u1 = 0x00;
			((word32) s0_81 + 334)->u1 = 0x00;
			((word32) s0_81 + 335)->u1 = 0x00;
			word32 s3_123 = s3_92 + ((word32) s5 + 432);
			word32 a1_398;
			word32 a2_399;
			word32 a3_400;
			word32 a4_401;
			word32 a5_402;
			word32 a6_403;
			word32 a7_404;
			memcpy((word32) s0_81 + 336, s3_123 + 0x1E, 0x06, out a1_398, out a2_399, out a3_400, out a4_401, out a5_402, out a6_403, out a7_404);
			word32 a1_405;
			word32 a2_406;
			word32 a3_407;
			word32 a4_408;
			word32 a5_409;
			word32 a6_410;
			word32 a7_411;
			memcpy((word32) s0_81 + 342, (word32) s2_91 + 80, 0x06, out a1_405, out a2_406, out a3_407, out a4_408, out a5_409, out a6_410, out a7_411);
			struct Eq_13120 * a3_163;
			word32 a1_412;
			word32 a2_413;
			word32 a4_414;
			word32 a5_415;
			word32 a6_416;
			word32 a7_417;
			memcpy((word32) s0_81 + 348, s3_123 + 0x1E, 0x06, out a1_412, out a2_413, out a3_163, out a4_414, out a5_415, out a6_416, out a7_417);
			uint32 a0_171 = txl_get_seq_ctrl();
			((word32) s0_81 + 354)->u1 = (byte) a0_171;
			((word32) s0_81 + 355)->u1 = (byte) (a0_171 >> 8);
			*((word32) s1_112 + 0x02CC) = &g_t2300BEB2;
			*((word32) s1_112 + 720) = s2_91;
			((word32) s1_112 + 47)->u1 = (byte) s6_211;
			*((word32) s1_112 + 48) = (byte) s5;
			struct Eq_38648 * a0_184 = me_build_deauthenticate((word32) s0_81 + 356, s4_83);
			word32 a4_188 = g_dw2300BEC6;
			a0_184->dw0038 = a4_188;
			a0_184->dw2300BEE1 = a4_188;
			word32 a0_195;
			ptr32 a4_199;
			ptr32 s10_205;
			word32 s0_418;
			word32 s1_419;
			word32 a1_420;
			word32 a3_421;
			word32 a5_422;
			word32 s2_423;
			word32 s3_424;
			word32 s4_425;
			word32 s7_426;
			word32 s9_427;
			word32 s11_428;
			ra = txl_frame_push(ra, s0_81, 0x03, a3_163, (char *) &a0_184->dw0038 + 587251345, mstatus, dwArg18, s1, dwArg98, dwArgCC, out s0_418, out s1_419, out a0_195, out a1_420, out a3_421, out a4_199, out a5_422, out s2_423, out s3_424, out s4_425, out s5, out s6_211, out s7_426, out s9_427, out s10_205, out s11_428);
			if (a0_195 != 0x00)
			{
				0x00 = (uint16) dwArgA8;
				a4Out = a4_199;
				s10Out = s10_205;
				return ra;
			}
		}
	}
	0x00 = (uint16) dwArgA8;
	ptr32 a4_249;
	ptr32 s10_256;
	word32 s3_367;
	word32 s2_366;
	word32 s4_368;
	Eq_2 ra_253 = sm_connect_ind(ra, s1, s5, s6_211, mstatus, dwArg08, dwArg40, dwArg44, s1, dwArg8C, dwArgC8, dwArg0128, out a4_249, out s2_366, out s3_367, out s4_368, out s10_256);
	a4Out = a4_249;
	s10Out = s10_256;
	return ra_253;
}

// 2300C66A: Register (ptr32 Eq_20436) txu_cntrl_sec_hdr_append(Register (ptr32 Eq_20436) a0, Register (ptr32 Eq_20436) a1, Register word32 a2)
// Called from:
//      txu_cntrl_frame_build
//      txu_cntrl_protect_mgmt_frame
struct Eq_20436 * txu_cntrl_sec_hdr_append(struct Eq_20436 * a0, struct Eq_20436 * a1, word32 a2)
{
	struct Eq_40977 * a5_5 = (word32) a0->b0030;
	struct Eq_40982 * a6_10 = (word32) a0->b002F;
	struct Eq_40987 * a5_13 = *a5_5->ptr4201917C;
	if (a5_13 == null)
		return a1;
	if ((a6_10->dw4201AFAC & 0x02) != 0x00)
	{
		uint32 a6_21 = (word32) a0->w0020;
		if ((word32) a5_5->w42019108 == (word32) ((word16) (a6_21 << 0x08 | a6_21 >> 0x08)))
			return a1;
	}
	struct Eq_41003 * a3_47;
	ui32 a4_49;
	word32 a4_30 = (word32) a5_13->b0060;
	if (a4_30 != 0x01)
	{
		if (a4_30 == 0x00)
		{
l2300C6DC:
			a1->wFFFFFFFC = (word16) (word32) a0->t0022;
			a3_47 = (word32) a0->w0024;
			a1->wFFFFFFFE = (word16) ((word32) a5_13->b0061 << 0x0E | a3_47);
			a1 = (struct Eq_20436 *) &a1->wFFFFFFFC;
			goto l2300C6F6;
		}
		if (a4_30 != 0x02)
		{
			a3_47 = (struct Eq_41003 *) 0x03;
			if (a4_30 == 0x03)
				goto l2300C6DC;
			goto l2300C6F6;
		}
		a1->wFFFFFFF8 = (word16) (word32) a0->t0022;
		a3_47 = (struct Eq_41003 *) 0x02000000;
		a4_49 = (word32) a5_13->b0061 << 0x0E | 0x02000000;
	}
	else
	{
		uint32 a6_33 = (word32) a0->t0022;
		a1->wFFFFFFF8 = (word16) ((a6_33 | 0x02000000) & 0x07FFFF00 | a6_33 >> 0x08);
		ui32 a3_45 = (word32) a5_13->b0061;
		a3_47 = a3_45 << 0x0E;
		a4_49 = (word32) a0->t0022 | a3_45 << 0x0E | 0x02000000;
	}
	a1->wFFFFFFFA = (word16) a4_49;
	a1->wFFFFFFFC = (word16) (word32) a0->w0024;
	a1->wFFFFFFFE = (word16) (word32) a0->w0026;
	a1 = (struct Eq_20436 *) &a1->wFFFFFFF8;
l2300C6F6:
	((word32) a5_13->b0062 | a3_47 & 0x000FFC00)->dw000C = a3_47->dw000C;
	return a1;
}

// 2300C778: Register (ptr32 Eq_20436) txu_cntrl_sechdr_len_compute(Register (ptr32 Eq_20436) a0, Register Eq_2 a1, Register out (ptr32 Eq_41146) a5Out)
// Called from:
//      txu_cntrl_push
//      txu_cntrl_protect_mgmt_frame
struct Eq_20436 * txu_cntrl_sechdr_len_compute(struct Eq_20436 * a0, Eq_2 a1, struct Eq_41146 & a5Out)
{
	struct Eq_41147 * a2_14 = (word32) a0->b002F;
	struct Eq_41146 * a5_101 = **((char *) g_a4201917C + (word32) a0->b0030);
	*a1 = 0x00;
	struct Eq_20436 * s0_113 = null;
	if (a5_101 != null)
	{
		int32 a2_26 = a2_14->dw4201AFAC;
		struct Eq_41175 * a2_27 = a2_26 & 0x02;
		if ((a2_26 & 0x02) != 0x00)
		{
			uint32 a2_29 = (word32) a0->w0020;
			s0_113 = null;
			a2_27 = (word32) g_a42019108[(word32) a0->b0030];
			if (a2_27 == (word32) ((word16) (a2_29 << 0x08 | a2_29 >> 8)))
				goto l2300C82E;
		}
		union Eq_2 * a4_43;
		word32 a4_41 = (word32) a5_101->t0060;
		if (a4_41 != 0x01)
		{
			if (a4_41 == 0x00)
			{
l2300C800:
				*(union Eq_2 *) 0x04 = a1;
				ui32 a4_86 = (word32) a0->w0032;
				s0_113 = (struct Eq_20436 *) 0x04;
				if ((a4_86 & 0x01) == 0x00)
				{
					struct Eq_41232 * a3_93 = (a4_86 & 0x01) + 1;
					word32 a5_91 = a2_27->dw004C;
					a3_93->dw0048 = a5_91;
					(a2_27 + (word32) (a3_93 < (a4_86 & 0x01)) / 80)->dw004C = a5_91;
					word32 a7_204;
					word32 a6_203;
					word32 a4_202;
					word32 a3_201;
					word32 a2_200;
					word32 a1_199;
					memcpy(&a0->t0022, a5_91 + 72, 0x04, out a1_199, out a2_200, out a3_201, out a4_202, out a5_101, out a6_203, out a7_204);
				}
				goto l2300C82E;
			}
			if (a4_41 != 0x02)
			{
				s0_113 = null;
				if (a4_41 == 0x03)
					goto l2300C800;
				goto l2300C82E;
			}
			a4_43 = (union Eq_2 *) 0x08;
		}
		else
			a4_43 = (union Eq_2 *) 0x0C;
		*a4_43 = (union Eq_2 *) a1;
		ui32 a4_52 = (word32) a0->w0032;
		if ((a4_52 & 0x01) == 0x00)
		{
			struct Eq_41283 * a3_59 = (a4_52 & 0x01) + 1;
			word32 a5_57 = a2_27->dw004C;
			a3_59->dw0048 = a5_57;
			(a2_27 + (word32) (a3_59 < (a4_52 & 0x01)) / 80)->dw004C = a5_57;
			word32 a7_210;
			word32 a6_209;
			word32 a4_208;
			word32 a3_207;
			word32 a2_206;
			word32 a1_205;
			memcpy(&a0->t0022, a5_57 + 72, 0x06, out a1_205, out a2_206, out a3_207, out a4_208, out a5_101, out a6_209, out a7_210);
		}
		s0_113 = (struct Eq_20436 *) 0x08;
	}
l2300C82E:
	a5Out = a5_101;
	return s0_113;
}

