pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300C86C: Register (ptr32 Eq_20436) txu_cntrl_frame_build(Register (ptr32 Eq_20436) a0, Register (ptr32 Eq_20436) a1, Register out ptr32 a2Out)
// Called from:
//      txl_buffer_alloc
struct Eq_20436 * txu_cntrl_frame_build(struct Eq_20436 * a0, struct Eq_20436 * a1, ptr32 & a2Out)
{
	uint32 a4_9 = (word32) a0->w0020;
	if ((word32) (word16) (a4_9 << 0x08 | a4_9 >> 8) > 0x05FF)
	{
		a1->wFFFFFFF8 = ~0x0555;
		a1->wFFFFFFFA = 0x03;
		a1->wFFFFFFFC = 0x00;
		a1->wFFFFFFFE = (word16) (word32) a0->w0020;
		a1 = (struct Eq_20436 *) &a1->wFFFFFFF8;
	}
	word32 a0_31 = txu_cntrl_sec_hdr_append(a0, a1, 0x01);
	struct Eq_41343 * a3_41 = (word32) a0->b0030;
	int32 t1_46 = (word32) a0->b002E;
	struct Eq_41353 * a6_47 = (word32) a0->b002F;
	struct Eq_20436 * a1_276 = &g_t42018F20;
	int32 a7_52 = *a3_41->ptr4201917C;
	struct Eq_41367 * a5_53 = a0_31 + -26;
	if (t1_46 == 0x00FF)
		a5_53 = a0_31 + -24;
	uint16 * a0_59 = &a5_53->w0018;
	struct Eq_41367 * a2_184 = null;
	if (((word32) a0->w0032 & 0x0100) != 0x00)
	{
		a5_53 = (struct Eq_41367 *) ((char *) a5_53 - 6);
		a2_184 = a5_53;
	}
	if (t1_46 != 0x00FF)
	{
		a5_53->b0000 = 0x80;
		a5_53->b0001 = 0x00;
		*a0_59 = (word16) (word32) a0->b002E;
		uint32 a4_82 = (word32) a0->w002A << 20 >> 16;
		a5_53->b0016 = (byte) a4_82;
		a5_53->b0017 = (byte) (a4_82 >> 8);
		if (((word32) a0->w0032 & 0x0200) != 0x00)
			*a0_59 = (word16) ((word32) *a0_59 | 16);
	}
	else
	{
		a5_53->b0000 = 0x00;
		a5_53->b0001 = 0x00;
		a5_53->b0016 = 0x00;
		a5_53->b0017 = 0x00;
	}
	uint32 a4_115;
	ui32 a4_96 = (word32) a5_53->b0001 << 8 | (word32) a5_53->b0000;
	a5_53->b0000 = (byte) (a4_96 | 8);
	a5_53->b0001 = (byte) ((a4_96 | 8) >> 8);
	ui32 t1_102 = (word32) a0->w0032;
	if (t1_102 << 0x14 < 0x00)
		a4_115 = a4_96 & -769 | 8;
	else if ((t1_102 & 0x0100) != 0x00)
		a4_115 = a4_96 | 776;
	else
	{
		word32 t1_113 = (word32) a6_47->b4201AA3E;
		if (t1_113 == 0x00)
			a4_115 = a4_96 | 264;
		else
		{
			if (t1_113 != 0x02)
			{
l2300C986:
				if (((word32) a0->w0032 & 0x04) != 0x00)
				{
					ui32 a4_134 = (word32) a5_53->b0001 << 8 | (word32) a5_53->b0000;
					a5_53->b0000 = (byte) (a4_134 | 0x02000000);
					a5_53->b0001 = (byte) ((a4_134 | 0x02000000) >> 8);
				}
				word32 a4_215;
				a5_53->w000A = (word16) (word32) a6_47->w4201AA38;
				a5_53->w000C = (word16) (word32) a6_47->w4201AA3A;
				a5_53->w000E = (word16) (word32) a6_47->w4201AA3C;
				int32 t1_161 = (word32) a5_53->b0001 << 8 & 0x0300;
				if (t1_161 == 0x0100)
				{
					a5_53->w0004 = (word16) (word32) a3_41->w420190EE;
					a5_53->w0006 = (word16) (word32) a3_41->w420190F0;
					a5_53->w0008 = (word16) (word32) a3_41->w420190F2;
					a5_53->w0010 = (word16) (word32) a0->w0014;
					a5_53->w0012 = (word16) (word32) a0->w0016;
					a4_215 = (word32) a0->w0018;
				}
				else if (t1_161 == 0x0200)
				{
					a5_53->w0004 = (word16) (word32) a0->w0014;
					a5_53->w0006 = (word16) (word32) a0->w0016;
					a5_53->w0008 = (word16) (word32) a0->w0018;
					a5_53->w0010 = (word16) (word32) a0->w001A;
					a5_53->w0012 = (word16) (word32) a0->w001C;
					a4_215 = (word32) a0->w001E;
				}
				else
				{
					if (t1_161 != 0x00)
					{
						a2_184->w0004 = (word16) (word32) a3_41->w420190EE;
						a2_184->w0006 = (word16) (word32) a3_41->w420190F0;
						a2_184->w0008 = (word16) (word32) a3_41->w420190F2;
						a2_184->w0010 = (word16) (word32) a0->w0014;
						a2_184->w0012 = (word16) (word32) a0->w0016;
						a2_184->w0014 = (word16) (word32) a0->w0018;
						a2_184->w0018 = (word16) (word32) a0->w001A;
						a2_184->w001A = (word16) (word32) a0->w001C;
						a2_184->w001C = (word16) (word32) a0->w001E;
l2300CA20:
						if (a7_52 != 0x00)
						{
							if ((a6_47->dw4201AFAC & 0x02) == 0x00)
							{
l2300CA5C:
								ui32 a4_284 = (word32) a5_53->b0001 << 8 | (word32) a5_53->b0000;
								a5_53->b0000 = (byte) (a4_284 | 0x04000000);
								a5_53->b0001 = (byte) ((a4_284 | 0x04000000) >> 8);
								goto l2300CA76;
							}
							struct Eq_41664 * a3_270 = (word32) a0->b0030;
							uint32 a3_265 = (word32) a0->w0020;
							a1_276 = (struct Eq_20436 *) ((char *) a3_270 + 0x420190D0);
							if ((word32) a3_270->w42019108 != (word32) ((word16) (a3_265 << 0x08 | a3_265 >> 8)))
								goto l2300CA5C;
						}
l2300CA76:
						a2Out = dwArg10;
						return a1_276;
					}
					a5_53->w0004 = (word16) (word32) a0->w0014;
					a5_53->w0006 = (word16) (word32) a0->w0016;
					a5_53->w0008 = (word16) (word32) a0->w0018;
					a5_53->w0010 = (word16) (word32) a6_47->w4201AD60;
					a5_53->w0012 = (word16) (word32) a6_47->w4201AD62;
					a4_215 = (word32) a6_47->w4201AD64;
				}
				a5_53->w0014 = (word16) a4_215;
				goto l2300CA20;
			}
			a4_115 = a4_96 | 520;
		}
	}
	a5_53->b0000 = (byte) a4_115;
	a5_53->b0001 = (byte) (a4_115 >> 8);
	goto l2300C986;
}

// 2300CB86: Register Eq_2 txu_cntrl_push(Register Eq_2 ra, Register (ptr32 Eq_26613) s0, Register (ptr32 Eq_20436) a0, Register Eq_2 a1, Register Eq_2 s6, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgCC, Stack word32 dwArgDC, Stack word32 dwArg0128, Stack word32 dwArg0168, Register out ptr32 s0Out, Register out Eq_21852 s1Out, Register out ptr32 a4Out, Register out Eq_41912 s2Out, Register out Eq_2 s3Out, Register out ptr32 s5Out, Register out Eq_2 s6Out, Register out (ptr32 Eq_41916) s7Out, Register out ptr32 s8Out)
// Called from:
//      ipc_emb_tx_evt
Eq_2 txu_cntrl_push(Eq_2 ra, struct Eq_26613 * s0, struct Eq_20436 * a0, Eq_2 a1, Eq_2 s6, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg98, Eq_2 dwArgCC, word32 dwArgDC, word32 dwArg0128, word32 dwArg0168, ptr32 & s0Out, union Eq_21852 & s1Out, ptr32 & a4Out, union Eq_41912 & s2Out, union Eq_2 & s3Out, ptr32 & s5Out, union Eq_2 & s6Out, struct Eq_41916 & s7Out, ptr32 & s8Out)
{
	ptr32 a4_278;
	Eq_21852 s1_283;
	Eq_2 s3_212 = a1;
	word32 a3_571;
	struct Eq_20844 * a4_29;
	Eq_2 a0_25 = txl_cntrl_tx_check((word32) a0->b002F + 1107405288, out a3_571, out a4_29);
	if (a0_25 != 0x00)
	{
		Eq_2 a5_189;
		Eq_2 s0_211;
		ui32 a4_30 = (word32) a0->w0032;
		if ((a4_30 & 8) != 0x00)
		{
			struct Eq_41990 * a5_222;
			if ((a4_30 & 0x10) != 0x00 || (word32) (a4_30 & 8)->b0004 != 0x00)
				a5_222 = (struct Eq_41990 *) &g_dw42047A2C;
			else
				a5_222 = (struct Eq_41990 *) &g_dw420470B4;
			a5_222->ptr0054 = a0;
			word32 a4_574;
			word32 a1_572;
			word32 a3_573;
			Eq_2 a0_239 = tpc_get_vif_tx_power_vs_rate(ra, a0_25, fflags, frm, out a1_572, out a3_573, out a4_574, out a5_189);
			*((word32) a0_239 + 36) = a5_189;
			*((word32) a0_239 + 40) = a5_189;
			*((word32) a0_239 + 44) = a5_189;
			s0_211 = *((word32) a5_189 + 84);
			*((word32) a0_239 + 48) = a5_189;
			((word32) s0_211 + 94)->u1 = 0x00;
			((word32) s0_211 + 96)->u1 = 0x00;
			goto l2300CBEE;
		}
		struct Eq_41961 * a5_32 = (word32) a0->b0030;
		uint32 a1_34 = (word32) a0->w0020;
		s2.u0 = 0x42018F20;
		word32 a6_42 = (word32) a5_32->b42019101;
		if ((word32) a5_32->w42019108 == (word32) ((word16) (a1_34 << 0x08 | a1_34 >> 8)))
			a0->w0032 = (word16) (a4_30 & -0x0101);
		else
			a0_25.u0 = 0x00;
		if (a6_42 == 0x02)
		{
l2300CC62:
			struct Eq_42052 * a3_79 = (word32) a0->b002E;
			word32 s1_105 = 0x18;
			if (a3_79 != (struct Eq_42052 *) 0x00FF)
			{
				s1_105 = 0x1A;
				if (((word32) a0->w0032 & 0x01) == 0x00)
				{
					word32 a5_91 = a5_32 + 0x00D8 + a3_79 + 0x0078 << 1;
					word32 a3_95 = (word32) a5_91->w42018F28;
					a5_91->w42018F28 = (word16) (word32) (word12) (a3_95 + 1);
					a0->w002A = (word16) a3_95;
				}
			}
			if (((word32) a0->w0032 & 0x0100) != 0x00)
				s1_105 += 0x06;
			word32 a5_575;
			word32 a0_114 = txu_cntrl_sechdr_len_compute(a0, fp + -36, out a5_575);
			uint32 a4_129 = (word32) a0->w0020;
			word32 a0_132 = a0_114 + s1_105;
			word32 a4_138 = 0x00;
			if ((word32) (word16) (a4_129 << 0x08 | a4_129 >> 8) > 0x0600)
			{
				a0_132 += 0x08;
				a4_138 = 0x08;
			}
			word32 a5_143 = (word32) a0->w000C;
			a0->b005E = (byte) a0_132;
			struct Eq_26611 * a0_146 = (word32) a0->b0030;
			a0->w005C = (word16) a5_143;
			a0->b005F = (byte) a4_138;
			a0->b0060 = (byte) a5_143;
			struct Eq_42163 * s0_173;
			word32 s2_177;
			ra = me_check_rc(ra, a0_146, s6, s0, dwLoc08, dwArg00, dwArg28, dwArgDC, out s0_173, out s2_177);
			struct Eq_42171 * a0_208;
			word32 s4_576;
			word32 s8_577;
			s0_211 = me_update_buffer_control(ra, (word32) s0_173->b0030 + 432 + s2_177, fflags, frm, mstatus, dwArg0168, out a0_208, out s3_212, out s4_576, out s8_577);
			a0_208->t0054 = s0_211;
			a5_189.u0 = 432;
l2300CBEE:
			ra = txl_cntrl_push(ra, s0_211, s3_212, a5_189, mstatus, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg68, dwArg6C, dwArg98, dwArgCC, out s1_283, out a4_278, out s2, out s3_212, out s5, out s6, out s7, out s8);
l2300CBF6:
			0x00 = dwArg0128;
			s0Out = dwArgE4;
			s1Out = s1_283;
			a4Out = a4_278;
			s2Out = s2;
			s3Out = s3_212;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			s8Out = s8;
			return ra;
		}
		a4_29 = (struct Eq_20844 *) 0x01;
		if (a6_42 == 0x01 && a0_25 != 0x00)
			goto l2300CC62;
	}
	Eq_2 a5_56 = txl_cntrl_inc_pck_cnt(a4_29);
	__csrrc(mstatus, 0x08);
	s1_283 = txl_cfm_push((struct Eq_20444 *) 0xC0000000, a1, a5_56, mstatus, out a4_278);
	__csrrs(mstatus, 0x08);
	goto l2300CBF6;
}

