pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300CD2A: Register Eq_2 txu_cntrl_tkip_mic_append(Register Eq_2 s0, Register (ptr32 Eq_20969) a0, Register Eq_2 a1, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out Eq_2 a1Out, Register out Eq_21246 a3Out, Register out Eq_21247 a4Out, Register out (ptr32 Eq_21248) s2Out, Register out (ptr32 Eq_21249) s3Out, Register out (ptr32 Eq_21250) s4Out, Register out Eq_21251 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      txl_payload_handle_backup
Eq_2 txu_cntrl_tkip_mic_append(Eq_2 s0, struct Eq_20969 * a0, Eq_2 a1, Eq_2 dwArgF8, Eq_2 dwArg0128, union Eq_2 & a1Out, union Eq_21246 & a3Out, union Eq_21247 & a4Out, struct Eq_21248 & s2Out, struct Eq_21249 & s3Out, struct Eq_21250 & s4Out, union Eq_21251 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out)
{
	Eq_21246 a3_106 = 432;
	Eq_21247 a4_107 = (word32) a0[48] + 432;
	if (a1 != 0x00)
	{
		word32 a5_27 = (word32) *((word32) a1 + 96);
		Eq_21247 a4_157 = 0x01;
		Eq_2 a0_29 = *((word32) s0 + 0x0068);
		if (a5_27 != 0x01)
		{
			if (a5_27 != 0x00)
			{
				a4_157.u0 = 0x03;
				if (a5_27 != 0x03)
					goto l2300CE34;
			}
			do
			{
				Eq_2 a5_166 = *((word32) a4_157 + 4);
			} while (a4_157 != 0x00);
			*((word32) s0 + 304) = a5_166;
			*((word32) s0 + 308) = (word32) s0 + 320;
			*((word32) s0 + 312) = (word32) s0 + 323;
			((word32) s0 + 300)->u0 = ~0x35010521;
			*((word32) s0 + 316) = 0x00;
			((word32) s0 + 304)->u0 = 0x00;
			a4_157 = (word32) s0 + 300;
l2300CE34:
			0x00 = (uint16) dwArg0128;
			a1Out = a1;
			a3Out = a3_106;
			a4Out = a4_157;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			s8Out = dwArg58;
			s9Out = s9;
			s10Out = s10;
			return s1;
		}
		do
		{
			Eq_2 a5_33 = *(union Eq_2 *) 0x05;
		} while (true);
		*((word32) s0 + 304) = a5_33;
		*((word32) s0 + 308) = (word32) s0 + 320;
		*((word32) s0 + 312) = (word32) s0 + 331;
		((word32) s0 + 300)->u0 = ~0x35010521;
		*((word32) s0 + 316) = 0x00;
		((word32) s0 + 304)->u0 = 0x00;
		struct Eq_42308 * s1_67;
		word32 s3_69;
		word32 s4_70;
		word32 s8_374;
		word32 s2_373;
		word32 a2_113;
		int32 a1_115;
		me_mic_calc(fp + -48, &me_mic_init(fp + -48, (word32) a0_29 + 20, (word32) a0_29 + 26, (word32) *((word32) a0_29 + 46), out s1_67, out s2_373, out s3_69, out s4_70, out s8_374)->b0008 + 0x0144 - s4_70 + s3_69, (word32) s1_67->b005F, dwLoc14, dwArgF8, out s1, out a1_115, out a2_113, out s2, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10);
		int32 s0_140 = s2[60];
		while (s0_140 != 0x00)
		{
			if (s1 == 0x00)
			{
				word32 a2_144;
				word32 a5_379;
				word32 a3_377;
				word32 a4_378;
				a1 = me_mic_end(s1, fp + -48, out a2_144, out a3_377, out a4_378, out a5_379);
				do
				{
					a3_106 = (word32) *((word32) s1 + (fp + -48));
					a4_157 = (word32) s1 + a2_144;
					*a4_157 = (byte) a3_106;
					s1 = (word32) s1 + 1;
				} while (s1 != 0x08);
				goto l2300CE34;
			}
			s0_140 = me_mic_calc(fp + -48, a1_115, a2_113 + 0x01 - a1_115, dwLoc14, dwArgF8, out s1, out a1_115, out a2_113, out s2, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10)->dw0004;
		}
		word32 a5_376;
		word32 a2_375;
		a1 = me_mic_end(s1, fp + -48, out a2_375, out a3_106, out a4_107, out a5_376);
		__ebreak();
	}
	a1Out = a1;
	a3Out = a3_106;
	a4Out = a4_107;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s8;
	s9Out = s9;
	s10Out = s10;
	return s1;
}

// 2300CE6C: Register Eq_2 txu_cntrl_cfm(Register (ptr32 Eq_42425) a5, Stack Eq_2 dwArg38, Register out Eq_42427 s1Out, Register out Eq_2 a1Out, Register out (ptr32 Eq_42429) a4Out, Register out Eq_42430 a5Out, Register out (ptr32 int32) s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out Eq_2 mstatusOut)
// Called from:
//      txl_cfm_evt
//      txl_cfm_flush
Eq_2 txu_cntrl_cfm(struct Eq_42425 * a5, Eq_2 dwArg38, union Eq_42427 & s1Out, union Eq_2 & a1Out, struct Eq_42429 & a4Out, union Eq_42430 & a5Out, int32 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_2 & mstatusOut)
{
	struct Eq_42436 * a5_19;
	struct Eq_42437 * a0_13 = a5->ptr006C;
	ui32 a5_17 = (word32) a0_13->w0032;
	struct Eq_42437 * s0_14 = a0_13;
	int32 * s2_15 = a0_13->ptr0010;
	struct Eq_42429 * a4_18 = a5_17 & 8;
	if ((a5_17 & 8) != 0x00)
	{
		if ((a5_17 & 32) != 0x00)
		{
			a4_18 = (a5_17 & 32) << 0x08;
			if (a4_18 >= null)
				rxu_cntrl_get_pm();
		}
		ui32 a5_27 = (word32) a0_13->w0032;
		a5_19 = a5_27 & 0x0200;
		if ((a5_27 & 0x0200) == 0x00)
		{
l2300CEFC:
			struct Eq_42497 * s1_67 = a5_19->ptr0010;
			(a5_19 | 1)->ptr0010 = s1_67;
			s1_67->w000C = 0x0101;
			s0_14->dw0FAC = 0x00;
			Eq_42427 s1_74 = *(union Eq_42427 *) 0x0111;
			*s2_15 = 0x0101;
			0x00 = (uint16) dwArg38;
			s1Out = s1_74;
			a1Out.u0 = <invalid>;
			a4Out = a4_18;
			a5Out.u0 = 0x0101;
			s2Out = s2_15;
			s3Out.u0 = <invalid>;
			s4Out.u0 = <invalid>;
			s5Out.u0 = <invalid>;
			mstatusOut.u0 = <invalid>;
			return <invalid>;
		}
		if ((word32) a0_13->b0030 == 0x00FF)
			assert_err();
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg120 = <invalid>;
		Eq_2 stackArg172 = <invalid>;
		Eq_2 stackArg408 = <invalid>;
		word32 s1_135;
		word32 a0_136;
		word32 a1_137;
		word32 a2_138;
		word32 a3_139;
		word32 a5_140;
		word32 s3_141;
		word32 s4_142;
		word32 s5_143;
		word32 s6_144;
		word32 s7_145;
		word32 s9_146;
		word32 s10_147;
		word32 s11_148;
		txl_frame_send_qosnull_frame(s9, s10, fflags, frm, mstatus, stackArg120, stackArg172, stackArg408, out s0_14, out s1_135, out a0_136, out a1_137, out a2_138, out a3_139, out a5_140, out s2_15, out s3_141, out s4_142, out s5_143, out s6_144, out s7_145, out s9_146, out s10_147, out s11_148);
	}
	else
	{
		a5_19 = a5_17 & 0x0200;
		if ((a5_17 & 0x0200) == 0x00)
			goto l2300CEFC;
	}
	struct Eq_42484 * a4_58 = (word32) s0_14->b0030;
	a4_58->dw42019104 = 0x00;
	a4_18 = (struct Eq_42429 *) ((char *) a4_58 + 432);
	a5_19 = (struct Eq_42436 *) ((char *) a4_58 + 0x420190D0);
	goto l2300CEFC;
}

// 2300CF22: Register word32 txu_cntrl_protect_mgmt_frame(Register (ptr32 Eq_20436) a0, Register (ptr32 Eq_39523) a1, Register word32 a2, Register out (ptr32 Eq_39523) s1Out)
// Called from:
//      sm_auth_send
word32 txu_cntrl_protect_mgmt_frame(struct Eq_20436 * a0, struct Eq_39523 * a1, word32 a2, struct Eq_39523 & s1Out)
{
	word32 a0_16;
	word32 a1_13 = (word32) a0->b005E;
	if (a1_13 == 0x00)
	{
		word32 a5_24;
		a0_16 = txu_cntrl_sechdr_len_compute(a0, fp + -20, out a5_24);
		a0->b005E = (byte) a0_16;
		a0->b0060 = (byte) a5_24;
	}
	else
		a0_16 = a1_13;
	ui32 a5_46 = (word32) a1->b0001 << 8 | (word32) a1->b0000;
	a1->b0000 = (byte) (a5_46 | 0x04000000);
	a1->b0001 = (byte) ((a5_46 | 0x04000000) >> 8);
	txu_cntrl_sec_hdr_append(a0, a1 + a2 / 2 + a0_16 / 2, 0x00);
	s1Out = a1;
	return dwArgE4;
}

// 2300CF84: Register Eq_2 _aid_list_delete(Register Eq_2 ra, Register Eq_2 a0, Stack Eq_2 dwArgA8, Register out ptr32 s0Out, Register out ptr32 s1Out)
// Called from:
//      apm_tx_cfm_handler
//      apm_sta_remove
Eq_2 _aid_list_delete(Eq_2 ra, Eq_2 a0, Eq_2 dwArgA8, ptr32 & s0Out, ptr32 & s1Out)
{
	struct Eq_42631 * s2_23 = &g_ptr4201BBF8;
	byte * s0_24 = g_a4201BC1D;
	do
	{
		if ((word32) s2_23->b001E != 0x00)
		{
			Eq_2 s4_30 = (char *) s2_23 + 24;
			word32 a1_153;
			word32 a3_155;
			word32 a2_154;
			word32 a5_157;
			word32 a4_156;
			if (memcmp(s4_30, a0, 0x06, out a1_153, out a2_154, out a3_155, out a4_156, out a5_157) == 0x00)
			{
				word32 t1_158;
				word32 a0_159;
				word32 a1_160;
				word32 a2_161;
				word32 a3_162;
				word32 a4_163;
				word32 a5_164;
				ra = memset(ra, s4_30, 0x00, 0x06, out t1_158, out a0_159, out a1_160, out a2_161, out a3_162, out a4_163, out a5_164);
				*s0_24 = 0x00;
				break;
			}
		}
		++s0_24;
		++s2_23;
	} while (s0_24 != (byte *) 3187557357);
	0x00 = (uint16) dwArgA8;
	s0Out = s1;
	s1Out = 1107409912;
	return ra;
}

// 2300CFF8: Register Eq_2 apm_sta_delete(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg88, Stack Eq_2 dwArgF8, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      apm_sta_fw_delete
//      apm_auth_handler
//      apm_deauth_handler
//      apm_disassoc_handler
//      apm_sta_remove
Eq_2 apm_sta_delete(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg88, Eq_2 dwArgF8, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	Eq_2 a4_29;
	Eq_2 s3_60;
	word32 s1_74;
	word32 s0_175;
	word32 s1_176;
	word32 a0_177;
	word32 a1_178;
	word32 a2_179;
	word32 a3_180;
	word32 a5_181;
	word32 a6_182;
	word32 s2_183;
	word32 s3_184;
	word32 s4_185;
	word32 s8_186;
	word32 s0_187;
	word32 s1_188;
	word32 a0_189;
	word32 a1_190;
	word32 a2_191;
	word32 a3_192;
	word32 a4_193;
	word32 a5_194;
	word32 a6_195;
	word32 s2_196;
	word32 s4_197;
	word32 s8_198;
	word32 s0_199;
	Eq_2 ra_86 = _aid_list_delete(ke_msg_alloc(ke_msg_alloc(ra, 0x01000409, 0x05, 0x02, a4, mstatus, dwLoc08, out s0_175, out s1_176, out a0_177, out a1_178, out a2_179, out a3_180, out a4_29, out a5_181, out a6_182, out s2_183, out s3_184, out s4_185, out s8_186), 0x01FFFC09, 0x0D, 0x01, a4_29, mstatus, dwLoc08, out s0_187, out s1_188, out a0_189, out a1_190, out a2_191, out a3_192, out a4_193, out a5_194, out a6_195, out s2_196, out s3_60, out s4_197, out s8_198), s3_60, dwArg88, out s0_199, out s1_74);
	Eq_2 s2_100;
	word32 a2_200;
	word32 a4_201;
	word32 s3_202;
	word32 s6_203;
	Eq_2 s1_99 = mm_sec_machwkey_del(s1_74 + 8 & 0x00FF, dwArgF8, out a2_200, out a4_201, out s2_100, out s3_202, out s6_203);
	g_t4201BC0E = (byte) ((word32) g_t4201BC0E + ~0x00);
	s2_100->u1 = (byte) s1_99;
	word32 s1_123;
	word32 a0_204;
	word32 a1_205;
	word32 a2_206;
	word32 a3_207;
	word32 a4_208;
	word32 a5_209;
	word32 s2_210;
	word32 s3_211;
	word32 s4_212;
	word32 s8_213;
	Eq_2 s0_122 = ke_msg_send(s2_100, mstatus, out s1_123, out a0_204, out a1_205, out a2_206, out a3_207, out a4_208, out a5_209, out s2_210, out s3_211, out s4_212, out s8_213);
	s0_122->u1 = (byte) s1_123;
	((word32) s0_122 + 1)->u1 = 0x00;
	ptr32 a3_142;
	ptr32 a4_143;
	ptr32 s1_147;
	ptr32 s2_148;
	ptr32 s3_149;
	ptr32 s4_150;
	word32 a0_214;
	word32 a1_215;
	word32 a2_216;
	word32 a5_217;
	word32 s8_218;
	s0Out = ke_msg_send(s0_122, mstatus, out s1_147, out a0_214, out a1_215, out a2_216, out a3_142, out a4_143, out a5_217, out s2_148, out s3_149, out s4_150, out s8_218);
	s1Out = s1_147;
	a3Out = a3_142;
	a4Out = a4_143;
	s2Out = s2_148;
	s3Out = s3_149;
	s4Out = s4_150;
	return ra_86;
}

// 2300D074: void apm_tx_cfm_handler(Register Eq_2 ra, Register Eq_2 a0, Register ui32 a1, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg9C)
void apm_tx_cfm_handler(Eq_2 ra, Eq_2 a0, ui32 a1, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg9C)
{
	if (a1 << 0x08 >= 0x00)
	{
		word32 s0_17;
		word32 s1_167;
		Eq_2 ra_30 = _aid_list_delete(ra, a0, dwArg88, out s0_17, out s1_167);
		Eq_2 a3_36;
		word32 s1_168;
		word32 a4_169;
		word32 a5_170;
		word32 s2_171;
		word32 s4_172;
		ke_msg_free(s0_17 + -0x0C, mstatus, out s1_168, out a3_36, out a4_169, out a5_170, out s2_171, out s4_172);
		word32 s1_173;
		word32 a0_174;
		word32 a1_175;
		word32 a2_176;
		word32 a3_177;
		word32 a4_178;
		word32 a5_179;
		word32 a7_180;
		word32 s2_181;
		word32 s3_182;
		word32 s4_183;
		word32 s5_184;
		word32 s6_185;
		word32 s7_186;
		word32 s8_187;
		word32 s9_188;
		word32 s10_189;
		word32 s11_190;
		word32 t4_191;
		printf(ra_30, &g_t23075454, a3_36, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_173, out a0_174, out a1_175, out a2_176, out a3_177, out a4_178, out a5_179, out a7_180, out s2_181, out s3_182, out s4_183, out s5_184, out s6_185, out s7_186, out s8_187, out s9_188, out s10_189, out s11_190, out t4_191);
		g_t4201BC0E = (byte) ((word32) g_t4201BC0E + ~0x00);
	}
	else if ((word32) *((word32) a0 + 0x0044) == 0x00)
	{
		word32 s1_203;
		word32 a3_204;
		word32 a4_205;
		word32 a5_206;
		word32 s2_207;
		word32 s4_208;
		ke_msg_free((word32) a0 - 0x0C, mstatus, out s1_203, out a3_204, out a4_205, out a5_206, out s2_207, out s4_208);
	}
	else
	{
		word32 s1_192;
		word32 a0_193;
		word32 a1_194;
		word32 a2_195;
		word32 a3_196;
		word32 a4_197;
		word32 a5_198;
		word32 s2_199;
		word32 s3_200;
		word32 s4_201;
		word32 s8_202;
		ke_msg_send(a0, mstatus, out s1_192, out a0_193, out a1_194, out a2_195, out a3_196, out a4_197, out a5_198, out s2_199, out s3_200, out s4_201, out s8_202);
	}
}

