pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300D0DA: Register Eq_2 apm_init(Register Eq_2 ra, Register ptr32 mstatus)
// Called from:
//      me_init
Eq_2 apm_init(Eq_2 ra, ptr32 mstatus)
{
	word32 t1_49;
	word32 a0_50;
	word32 a1_51;
	word32 a2_52;
	word32 a3_53;
	word32 a4_54;
	word32 a5_55;
	Eq_2 ra_18 = memset(ra, 1107409912, 0x00, 96, out t1_49, out a0_50, out a1_51, out a2_52, out a3_53, out a4_54, out a5_55);
	g_b4201BC04 = 0x00;
	g_t4201BC0E.u1 = 0xFC00;
	word32 s1_56;
	word32 a0_57;
	word32 a1_58;
	word32 a4_59;
	word32 a5_60;
	word32 s2_61;
	word32 s3_62;
	word32 s4_63;
	ke_state_set(0x07, 0x00, mstatus, out s1_56, out a0_57, out a1_58, out a4_59, out a5_60, out s2_61, out s3_62, out s4_63);
	return ra_18;
}

// 2300D112: void apm_start_cfm(Register Eq_2 ra, Register word32 a0, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgD8, Stack word32 dwArg0128)
// Called from:
//      mm_bcn_change_cfm_handler
void apm_start_cfm(Eq_2 ra, word32 a0, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgD8, word32 dwArg0128)
{
	struct Eq_43045 * a0_35;
	word32 s0_283;
	word32 s1_284;
	word32 a1_285;
	word32 a2_286;
	word32 a5_287;
	word32 a6_288;
	word32 s3_289;
	word32 s4_290;
	word32 s8_291;
	Eq_2 s2_153;
	Eq_2 a4_141;
	Eq_2 a3_140;
	Eq_2 ra_161 = ke_msg_alloc(ra, 0x01FFFC01, 0x0D, 0x04, a4, mstatus, dwLoc18, out s0_283, out s1_284, out a0_35, out a1_285, out a2_286, out a3_140, out a4_141, out a5_287, out a6_288, out s2_153, out s3_289, out s4_290, out s8_291);
	struct Eq_43045 * s3_151 = a0_35;
	if (a0 == 0x00)
	{
		struct Eq_43143 * s5_56 = (word32) *((word32) s2_153 + 0x0033);
		Eq_2 a0_60;
		word32 s0_307;
		word32 s1_308;
		word32 a1_309;
		word32 a2_310;
		word32 a3_311;
		word32 a4_312;
		word32 a5_313;
		word32 a6_314;
		word32 s2_315;
		word32 s3_316;
		word32 s4_317;
		word32 s8_318;
		ra_161 = ke_msg_alloc(ra_161, 0x1E, 0x00, 0x04, a4_141, mstatus, dwLoc18, out s0_307, out s1_308, out a0_60, out a1_309, out a2_310, out a3_311, out a4_312, out a5_313, out a6_314, out s2_315, out s3_316, out s4_317, out s8_318);
		((word32) a0_60 + 2)->u1 = 0x01;
		*((word32) a0_60 + 3) = (byte) (word32) s5_56->b4201AA3F;
		struct Eq_43191 * s1_97;
		word32 s8_101;
		word32 a0_319;
		word32 a1_320;
		word32 a2_321;
		word32 a3_322;
		word32 a4_323;
		word32 a5_324;
		word32 s4_325;
		Eq_2 s0_96 = ke_msg_send(a0_60, mstatus, out s1_97, out a0_319, out a1_320, out a2_321, out a3_322, out a4_323, out a5_324, out s2_153, out s3_151, out s4_325, out s8_101);
		s1_97->t05C4 = *((word32) s2_153 + 44);
		struct Eq_43220 * a5_109 = (word32) *((word32) s2_153 + 48);
		s1_97->b034A = 0x00;
		s1_97->w034C = (word16) a5_109;
		s3_151->b0002 = (byte) (word32) a5_109->b0017;
		s3_151->b0003 = (byte) ((word32) *((word32) s2_153 + 0x0033) + 0x0A);
		word32 s0_120 = s0_96 + (s5_56 + 442);
		word32 a1_326;
		word32 a2_327;
		word32 a3_328;
		word32 a4_329;
		word32 a5_330;
		word32 a6_331;
		word32 a7_332;
		memcpy(&s0_120->b00B0, s2_153, 0x0D, out a1_326, out a2_327, out a3_328, out a4_329, out a5_330, out a6_331, out a7_332);
		s0_120->b0031 = 0x02;
		a3_140 = me_init_bcmc_rate(s0_120, out a4_141);
		ui32 a5_143 = (word32) s0_120->b011A;
		s0_120->w001E = (word16) s8_101;
		s0_120->b011A = (byte) (a5_143 | 16);
		s0_120->b001B = (byte) ((word32) *((word32) s2_153 + 0x0033) + 0x0A);
	}
	s3_151->t0000 = (byte) a0;
	s3_151->b0001 = (byte) (word32) *((word32) s2_153 + 0x0033);
	word32 s2_193;
	word32 s1_292;
	word32 a0_293;
	word32 a1_294;
	word32 a2_295;
	word32 a3_296;
	word32 a4_297;
	word32 a5_298;
	word32 s3_299;
	word32 s4_300;
	word32 s8_301;
	ke_msg_send(ke_timer_set(ra_161, 0x01FFFC0A, 0x07, 5000000, a3_140, a4_141, mstatus, dwLoc18, dwArg78, dwArgD8), mstatus, out s1_292, out a0_293, out a1_294, out a2_295, out a3_296, out a4_297, out a5_298, out s2_193, out s3_299, out s4_300, out s8_301);
	word32 * s4_210;
	word32 s1_302;
	word32 a3_303;
	word32 a4_304;
	word32 a5_305;
	word32 s2_306;
	ke_msg_free(s2_193 + -0x0C, mstatus, out s1_302, out a3_303, out a4_304, out a5_305, out s2_306, out s4_210);
	*s4_210 = 0x00;
	0x00 = dwArg0128;
	word32 s1_333;
	word32 a0_334;
	word32 a1_335;
	word32 a4_336;
	word32 a5_337;
	word32 s2_338;
	word32 s3_339;
	word32 s4_340;
	ke_state_set(0x07, 0x00, mstatus, out s1_333, out a0_334, out a1_335, out a4_336, out a5_337, out s2_338, out s3_339, out s4_340);
}

// 2300D240: Register word32 apm_send_next_bss_param(Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus)
// Called from:
//      apm_set_bss_param
//      me_set_ps_disable_cfm_handler
//      mm_bss_param_setting_handler
word32 apm_send_next_bss_param(Eq_2 a4, Eq_2 a5, ptr32 mstatus)
{
	word32 a5_43;
	Eq_2 a0_12 = co_list_pop_front(a4, a5, out a5_43);
	if (a0_12 != 0x00)
	{
		word32 a3_27;
		word32 s1_44;
		word32 a0_45;
		word32 a1_46;
		word32 a2_47;
		word32 a4_48;
		word32 a5_49;
		word32 s2_50;
		word32 s3_51;
		word32 s4_52;
		word32 s8_53;
		ke_msg_send((word32) a0_12 + 0x0C, mstatus, out s1_44, out a0_45, out a1_46, out a2_47, out a3_27, out a4_48, out a5_49, out s2_50, out s3_51, out s4_52, out s8_53);
		return a3_27;
	}
	else
		assert_err();
}

// 2300D27C: Register Eq_2 apm_set_bss_param(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out (ptr32 Eq_43374) s5Out)
// Called from:
//      apm_start_req_handler
Eq_2 apm_set_bss_param(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s3Out, struct Eq_43374 & s5Out)
{
	struct Eq_43375 * s7_31 = (word32) g_ptr4201BBF8->b0033;
	Eq_2 a4_38;
	Eq_2 a0_57;
	Eq_2 a4_61;
	Eq_2 a4_84;
	Eq_2 a4_107;
	word32 s1_112;
	struct Eq_26405 * s0_134;
	struct Eq_43389 * s2_136;
	struct Eq_43390 * s3_137;
	word32 s0_294;
	word32 s1_295;
	word32 a0_296;
	word32 a1_297;
	word32 a2_298;
	word32 a3_299;
	word32 a5_300;
	word32 a6_301;
	word32 s2_302;
	word32 s3_303;
	word32 s4_304;
	word32 s8_305;
	word32 s0_306;
	word32 s1_307;
	word32 a1_308;
	word32 a2_309;
	word32 a3_310;
	word32 a5_311;
	word32 a6_312;
	word32 s2_313;
	word32 s3_314;
	word32 s4_315;
	word32 s8_316;
	word32 s0_317;
	word32 s1_318;
	word32 a0_319;
	word32 a1_320;
	word32 a2_321;
	word32 a3_322;
	word32 a5_323;
	word32 a6_324;
	word32 s2_325;
	word32 s3_326;
	word32 s4_327;
	word32 s8_328;
	word32 s0_329;
	word32 a0_330;
	word32 a1_331;
	word32 a2_332;
	word32 a3_333;
	word32 a5_334;
	word32 a6_335;
	word32 s2_336;
	word32 s3_337;
	word32 s4_338;
	word32 s8_339;
	word32 s1_340;
	word32 a0_341;
	word32 a1_342;
	word32 a2_343;
	word32 a3_344;
	word32 a4_345;
	word32 a5_346;
	word32 a6_347;
	word32 s4_348;
	word32 s8_349;
	Eq_2 ra_133 = ke_msg_alloc(ke_msg_alloc(ke_msg_alloc(ke_msg_alloc(ke_msg_alloc(ra, 0x01000413, 0x05, 0x02, a4, mstatus, dwLoc18, out s0_294, out s1_295, out a0_296, out a1_297, out a2_298, out a3_299, out a4_38, out a5_300, out a6_301, out s2_302, out s3_303, out s4_304, out s8_305), 0x18, 0x00, 0x07, a4_38, mstatus, dwLoc18, out s0_306, out s1_307, out a0_57, out a1_308, out a2_309, out a3_310, out a4_61, out a5_311, out a6_312, out s2_313, out s3_314, out s4_315, out s8_316), 22, 0x00, 0x08, a4_61, mstatus, dwLoc18, out s0_317, out s1_318, out a0_319, out a1_320, out a2_321, out a3_322, out a4_84, out a5_323, out a6_324, out s2_325, out s3_326, out s4_327, out s8_328), 0x14, 0x00, 0x04, a4_84, mstatus, dwLoc18, out s0_329, out s1_112, out a0_330, out a1_331, out a2_332, out a3_333, out a4_107, out a5_334, out a6_335, out s2_336, out s3_337, out s4_338, out s8_339), s1_112 + 0x0411, 0x05, 0x02, a4_107, mstatus, dwLoc18, out s0_134, out s1_340, out a0_341, out a1_342, out a2_343, out a3_344, out a4_345, out a5_346, out a6_347, out s2_136, out s3_137, out s4_348, out s8_349);
	s2_136->b0000 = 0x01;
	Eq_2 a5_153 = (word32) s7_31->b4201AA3F;
	s2_136->b0001 = (byte) a5_153;
	word32 a1_350;
	word32 a2_351;
	word32 a3_352;
	word32 a4_353;
	word32 a5_354;
	word32 a6_355;
	word32 a7_356;
	memcpy(a0_57, (word32) co_list_push_back((char *) s2_136 - 0x0C, a5_153) + 80, 0x06, out a1_350, out a2_351, out a3_352, out a4_353, out a5_354, out a6_355, out a7_356);
	Eq_2 a5_176 = (word32) s0_134->b0033;
	*((word32) a0_57 + 6) = (byte) a5_176;
	co_list_push_back((word32) a0_57 - 0x0C, a5_176);
	s3_137->b0005 = (byte) (word32) s0_134->b0010;
	word32 a0_187;
	Eq_2 a4_190;
	struct Eq_43599 * s3_196;
	struct Eq_43600 * s4_197;
	struct Eq_43374 * s5_198;
	word32 s8_201;
	word32 s1_357;
	word32 s2_358;
	word32 s6_359;
	word32 s7_360;
	Eq_2 s0_193 = me_legacy_rate_bitfield_build(s0_134, 0x01, dwArgF8, out s1_357, out a0_187, out a4_190, out s2_358, out s3_196, out s4_197, out s5_198, out s6_359, out s7_360, out s8_201);
	s3_196->dw0000 = a0_187;
	Eq_2 a5_205 = (word32) *((word32) s0_193 + 0x0033);
	s3_196->b0004 = (byte) a5_205;
	co_list_push_back((char *) s3_196 - 0x0C, a5_205);
	s5_198->w0000 = (word16) (word32) *((word32) s0_193 + 40);
	Eq_2 a5_216 = (word32) *((word32) s0_193 + 0x0033);
	s5_198->b0002 = (byte) a5_216;
	co_list_push_back((char *) s5_198 - 0x0C, a5_216);
	s4_197->b0000 = (byte) s8_201;
	Eq_2 a5_222 = (word32) *((word32) s0_193 + 0x0033);
	s4_197->b0001 = (byte) a5_222;
	co_list_push_back((char *) s4_197 - 0x0C, a5_222);
	ptr32 a3_232 = apm_send_next_bss_param(a4_190, a5_222, mstatus);
	0x00 = (uint16) dwArg0128;
	ptr32 s2_263;
	ptr32 s3_264;
	word32 s1_361;
	word32 a0_362;
	word32 a1_363;
	word32 a4_364;
	word32 a5_365;
	word32 s4_366;
	ke_state_set(0x07, 0x01, mstatus, out s1_361, out a0_362, out a1_363, out a4_364, out a5_365, out s2_263, out s3_264, out s4_366);
	a3Out = a3_232;
	s2Out = s2_263;
	s3Out = s3_264;
	s5Out = s5_198;
	return ra_133;
}

// 2300D3B8: Register Eq_2 apm_stop(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg88, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out ptr32 a4Out, Register out ptr32 s2Out)
// Called from:
//      apm_stop_req_handler
Eq_2 apm_stop(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg88, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0158, union Eq_2 & s0Out, ptr32 & a4Out, ptr32 & s2Out)
{
	Eq_2 a4_25;
	word32 s1_30;
	Eq_2 s0_52;
	struct Eq_43717 * s0_76;
	Eq_2 s2_77;
	word32 s0_256;
	word32 a0_257;
	word32 a1_258;
	word32 a2_259;
	word32 a3_260;
	word32 a5_261;
	word32 a6_262;
	word32 s2_263;
	word32 s3_264;
	word32 s4_265;
	word32 s8_266;
	word32 s1_267;
	word32 a0_268;
	word32 a1_269;
	word32 a2_270;
	word32 a3_271;
	word32 a4_272;
	word32 a5_273;
	word32 a6_274;
	word32 s2_275;
	word32 s3_276;
	word32 s4_277;
	word32 s8_278;
	word32 s1_279;
	word32 a3_280;
	Eq_2 ra_113 = ke_timer_clear(ke_msg_alloc(ke_msg_alloc(ra, 0x01000413, 0x05, 0x02, a4, mstatus, dwArg08, out s0_256, out s1_30, out a0_257, out a1_258, out a2_259, out a3_260, out a4_25, out a5_261, out a6_262, out s2_263, out s3_264, out s4_265, out s8_266), s1_30 + 0x0411, 0x05, 0x02, a4_25, mstatus, dwArg08, out s0_52, out s1_267, out a0_268, out a1_269, out a2_270, out a3_271, out a4_272, out a5_273, out a6_274, out s2_275, out s3_276, out s4_277, out s8_278), s0_52, 0x01FFFC0A, 0x07, mstatus, dwArg0108, out s0_76, out s1_279, out a3_280, out s2_77);
	s2_77->u1 = 0x00;
	*((word32) s2_77 + 1) = (byte) (word32) s0_76->b0057;
	Eq_2 a4_89;
	word32 a0_281;
	word32 a1_282;
	word32 a2_283;
	word32 a5_284;
	word32 s2_285;
	word32 s3_286;
	word32 s4_287;
	word32 s8_288;
	Eq_2 a3_129;
	Eq_2 s1_134;
	struct Eq_43813 * a5_101 = (word32) *((word32) ke_msg_send(s2_77, mstatus, out s1_134, out a0_281, out a1_282, out a2_283, out a3_129, out a4_89, out a5_284, out s2_285, out s3_286, out s4_287, out s8_288) + 88);
	if (a5_101 != null)
	{
		Eq_2 a0_106;
		struct Eq_43840 * s0_114;
		word32 s1_289;
		word32 a1_290;
		word32 a2_291;
		word32 a3_292;
		word32 a4_293;
		word32 a5_294;
		word32 a6_295;
		word32 s2_296;
		word32 s3_297;
		word32 s4_298;
		word32 s8_299;
		ra_113 = ke_msg_alloc(ra_113, 0x1E, 0x00, 0x04, a4_89, mstatus, dwArg08, out s0_114, out s1_289, out a0_106, out a1_290, out a2_291, out a3_292, out a4_293, out a5_294, out a6_295, out s2_296, out s3_297, out s4_298, out s8_299);
		((word32) a0_106 + 2)->u1 = 0x00;
		*((word32) a0_106 + 3) = (byte) (word32) s0_114->b0057;
		word32 a0_300;
		word32 a1_301;
		word32 a2_302;
		word32 a4_303;
		word32 s2_304;
		word32 s3_305;
		word32 s4_306;
		word32 s8_307;
		ke_msg_send(a0_106, mstatus, out s1_134, out a0_300, out a1_301, out a2_302, out a3_129, out a4_303, out a5_101, out s2_304, out s3_305, out s4_306, out s8_307);
	}
	Eq_2 s0_144 = a5_101->t0040;
	if (a5_101 != null)
	{
		word32 a4_308;
		word32 s6_309;
		word32 s10_310;
		ra_113 = chan_ctxt_unlink(ra_113, s0_144, (word32) *((word32) s0_144 + 87), a3_129, mstatus, dwLoc08, dwArg18, dwArg28, dwArg88, dwArgF8, dwArg0158, out s1_134, out a4_308, out s6_309, out s10_310);
	}
	s1_134->u1 = 0x00;
	*((word32) s1_134 + 1) = (byte) (word32) *((word32) s0_144 + 87);
	0x00 = (uint16) dwArg38;
	ptr32 a4_189;
	ptr32 s2_194;
	word32 s1_311;
	word32 a0_312;
	word32 a1_313;
	word32 a2_314;
	word32 a3_315;
	word32 a5_316;
	word32 s3_317;
	word32 s4_318;
	word32 s8_319;
	s0Out = ke_msg_send(s1_134, mstatus, out s1_311, out a0_312, out a1_313, out a2_314, out a3_315, out a4_189, out a5_316, out s2_194, out s3_317, out s4_318, out s8_319);
	a4Out = a4_189;
	s2Out = s2_194;
	return ra_113;
}

