pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300D44E: Register Eq_2 apm_tx_int_ps_check(Register Eq_2 a0, Register out (ptr32 Eq_19509) a3Out, Register out Eq_2 a4Out)
// Called from:
//      sta_mgmt_send_postponed_frame
//      txl_cntrl_push_int
Eq_2 apm_tx_int_ps_check(Eq_2 a0, struct Eq_19509 & a3Out, union Eq_2 & a4Out)
{
	Eq_2 a4_13;
	struct Eq_19509 * a3_14 = (struct Eq_19509 *) 0x05D8;
	if ((word32) (&g_b4201AA3E)[(word32) *((word32) a0 + 47)] == 0x02)
	{
		a3_14 = (word32) *((word32) a0 + 48);
		a4_13.u0 = 0x01;
		if (a3_14 <= (struct Eq_19509 *) 11)
		{
			a3_14 = (word32) a3_14->b420190EC;
			if (a3_14 == (struct Eq_19509 *) 0x01 && (a3_14->dw42019104 & 0x03) == 0x00)
			{
				*((word32) a0 + 50) = (word16) ((word32) *((word32) a0 + 50) | 0x01000000);
				a4_13.u0 = 0x00;
			}
		}
	}
	else
		a4_13.u0 = 0x01;
	a3Out = a3_14;
	a4Out = a4_13;
	return a4_13;
}

// 2300D4B0: Register Eq_2 apm_tx_int_ps_postpone(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_21361) a1, Register ptr32 mstatus, Stack Eq_2 dwArg08, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out (ptr32 Eq_21361) a1Out, Register out Eq_21367 a3Out, Register out Eq_21368 a4Out, Register out Eq_21369 a5Out, Register out Eq_21370 s3Out)
// Called from:
//      txl_cntrl_push_int
Eq_2 apm_tx_int_ps_postpone(Eq_2 ra, Eq_2 a0, struct Eq_21361 * a1, ptr32 mstatus, Eq_2 dwArg08, union Eq_2 & s0Out, ptr32 & s1Out, struct Eq_21361 & a1Out, union Eq_21367 & a3Out, union Eq_21368 & a4Out, union Eq_21369 & a5Out, union Eq_21370 & s3Out)
{
	Eq_21369 a5_117 = (word32) *((word32) a0 + 50);
	Eq_21368 a4_115 = a5_117 << 0x13;
	if (a5_117 << 0x13 < 0x00)
	{
		a3 = (word32) a1->b00F2;
		a5_117 = (word32) a1->b0032;
		a4_115.u0 = 0x2308DD88;
		if (((word32) g_a2308DD88[(word32) *((word32) a0 + 46)] & a3) != 0x00)
		{
			a5_117 |= 8;
			if ((a5_117 & 8) != 0x00)
				goto l2300D4E8;
		}
		else
		{
			if ((a5_117 & 2) != 0x00)
				goto l2300D4E8;
			a5_117 |= 2;
		}
		a1->b0032 = (byte) a5_117;
		struct Eq_44048 * a5_25 = (word32) *((word32) a0 + 46);
		a4_115 = &a5_25->b2308DD88;
		if (((word32) a5_25->b2308DD88 & a3) == 0x00)
		{
l2300D50C:
			Eq_2 a0_53;
			struct Eq_44062 * s0_61;
			word32 s8_181;
			word32 s3_179;
			word32 s4_180;
			word32 a6_177;
			word32 s2_178;
			word32 a4_175;
			word32 a5_176;
			word32 a2_173;
			word32 a3_174;
			word32 a1_172;
			word32 s1_171;
			Eq_2 ra_60 = ke_msg_alloc(ra, 65, 0x00, 0x04, &a5_25->b2308DD88, mstatus, dwArg08, out s0_61, out s1_171, out a0_53, out a1_172, out a2_173, out a3_174, out a4_175, out a5_176, out a6_177, out s2_178, out s3_179, out s4_180, out s8_181);
			*a0_53 = (word16) (word32) s0_61->w0018;
			*((word32) a0_53 + 3) = (byte) (word32) s0_61->b001A;
			((word32) a0_53 + 2)->u1 = 0x01;
			word32 s8_186;
			Eq_21367 a3_82;
			Eq_21368 a4_83;
			Eq_21369 a5_84;
			ptr32 s1_87;
			Eq_21370 s3_89;
			struct Eq_21361 * a1_94;
			word32 s4_185;
			word32 s2_184;
			word32 a2_183;
			word32 a0_182;
			s0Out = ke_msg_send(a0_53, mstatus, out s1_87, out a0_182, out a1_94, out a2_183, out a3_82, out a4_83, out a5_84, out s2_184, out s3_89, out s4_185, out s8_186);
			s1Out = s1_87;
			a1Out = a1_94;
			a3Out = a3_82;
			a4Out = a4_83;
			a5Out = a5_84;
			s3Out = s3_89;
			return ra_60;
		}
		a5_117.u0 = 0x0F;
		if (a3 == 0x0F)
			goto l2300D50C;
	}
l2300D4E8:
	s0Out = s0;
	s1Out = s1;
	a1Out = a1;
	a3Out = a3;
	a4Out = a4_115;
	a5Out = a5_117;
	s3Out = s3;
	return ra;
}

// 2300D542: Register Eq_2 apm_tx_int_ps_get_postpone(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register ptr32 mstatus, Stack word32 dwArg18, Stack Eq_2 dwArgA8, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_19531 a3Out, Register out Eq_2 a4Out, Register out Eq_19533 a5Out, Register out ptr32 a6Out, Register out Eq_19535 s2Out, Register out Eq_2 s3Out, Register out ptr32 s5Out, Register out Eq_2 s6Out)
// Called from:
//      sta_mgmt_send_postponed_frame
Eq_2 apm_tx_int_ps_get_postpone(Eq_2 ra, Eq_2 a0, Eq_2 a2, ptr32 mstatus, word32 dwArg18, Eq_2 dwArgA8, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_19531 & a3Out, union Eq_2 & a4Out, union Eq_19533 & a5Out, ptr32 & a6Out, union Eq_19535 & s2Out, union Eq_2 & s3Out, ptr32 & s5Out, union Eq_2 & s6Out)
{
	Eq_2 s1_134;
	Eq_19535 s2_135 = (word32) *((word32) a0 + 86);
	Eq_19533 a5_131 = 0x02;
	if (s2_135 == 0x02)
	{
		a1 = *(union Eq_2 *) 0x36;
		if (true)
		{
			ui32 s4_186 = 0x01;
			if (true)
			{
				s4_186 = 0x04;
				s2_135.u0 = 0x08;
			}
			a4 = s2_135 & (word32) (*((word32) a1 + 50));
			if (a4 != 0x00)
			{
				s1_134 = *((word32) a1 + 412);
				s3 = a2;
				s6.u0 = 0x00;
				s5 = 0x2308DD88;
				Eq_2 a5_43 = (word32) true;
				while (s1_134 != 0x00)
				{
					a3 = (word32) *((word32) a1 + 242);
					a4 = (word32) (((word32) g_a2308DD88[(word32) *((word16) s1_134.u0 + 46)] & a3) < 1);
					if (a4 != a5_43)
					{
						struct Eq_44218 * a5_70;
						struct Eq_44219 * a5_64;
						struct Eq_44220 * s1_61 = co_list_remove((word16) a1.u0 + 412, s6, s1_134, a5_43, dwArg18, out a5_64, out s2_135);
						struct Eq_44235 * s0_65 = a5_64->ptr0034;
						s1_61->b002E = (byte) ((word32) ((a5_64 & 0x08) != 0x00) + 0x03);
						a1 = s6;
						if (s6 == 0x00)
							a5_70 = s0_65->ptr019C;
						else
							a5_70 = (struct Eq_44218 *) *s6.u0;
						for (; a5_70 != null; a5_70 = a5_70->ptr0000)
						{
							struct Eq_44265 * a4_79 = (word32) s0_65->b00F2;
							s0_65 = a4_79->ptr0034;
							a4 = (word32) (a4_79 < (struct Eq_44265 *) ~0x02);
							if ((word32) (((word32) g_a2308DD88[(word32) a5_70->b002E] & a4_79) < 1) != a4)
								goto l2300D610;
						}
						ui32 s2_89 = ~s2_135 & (word32) s0_65->b0032;
						s0_65->b0032 = (byte) s2_89;
						s2_135 = s2_89 & s4_186;
						if (s2_135 != 0x00)
						{
l2300D610:
							s1_134 = *((word32) a4 + 0x0068);
							ui32 a5_148 = (word32) *((word32) a4 + 333) << 8 | (word32) (*((word32) a4 + 332));
							*((word32) a4 + 332) = (byte) (a5_148 | 0x02000000);
							a5_131 = (a5_148 | 0x02000000) >> 8;
							((word32) a4 + 333)->u1 = (byte) a5_131;
							a3.u0 = 0x02000000;
						}
						else
						{
							word32 a3_344;
							word32 a5_346;
							Eq_2 a0_104;
							struct Eq_44306 * s0_112;
							word32 a1_342;
							word32 s1_341;
							word32 a4_345;
							word32 a2_343;
							word32 a6_347;
							word32 s2_348;
							word32 s3_349;
							word32 s4_350;
							word32 s8_351;
							ra = ke_msg_alloc(ra, 65, 0x00, 0x04, a4, mstatus, dwLoc08, out s0_112, out s1_341, out a0_104, out a1_342, out a2_343, out a3_344, out a4_345, out a5_346, out a6_347, out s2_348, out s3_349, out s4_350, out s8_351);
							*a0_104 = (word16) (word32) s0_112->w0018;
							word32 a4_124 = (word32) s0_112->b001A;
							((word32) a0_104 + 2)->u1 = 0x00;
							*((word32) a0_104 + 3) = (byte) a4_124;
							word32 a2_353;
							word32 s4_354;
							word32 a0_352;
							word32 s8_355;
							ke_msg_send(a0_104, mstatus, out s1_134, out a0_352, out a1, out a2_353, out a3, out a4, out a5_131, out s2_135, out s3, out s4_354, out s8_355);
						}
						goto l2300D568;
					}
					s6 = s1_134;
					s1_134 = *s1_134.u0;
				}
				assert_warn();
				*a2 = 0x01;
				a1.u0 = 587678428;
				a5_131.u0 = 0x01;
l2300D568:
				0x00 = (uint16) dwArgA8;
				s0Out = s1;
				s1Out = s1_134;
				a0Out = s1_134;
				a1Out = a1;
				a3Out = a3;
				a4Out = a4;
				a5Out = a5_131;
				a6Out = dwArg28;
				s2Out = s2_135;
				s3Out = s3;
				s5Out = s5;
				s6Out = s6;
				return ra;
			}
			*(union Eq_2 *) 0x01 = a2;
			a5_131.u0 = 0x01;
l2300D566:
			s1_134.u0 = 0x00;
			goto l2300D568;
		}
	}
	*a2 = 0x00;
	goto l2300D566;
}

// 2300D69E: Register Eq_2 apm_tx_int_ps_clear(Register Eq_2 ra, Register Eq_2 a0, Register Eq_11075 a1, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArgAC, Stack Eq_2 dwArg0118, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out Eq_11075 a1Out, Register out ptr32 a2Out, Register out Eq_11087 a4Out, Register out (ptr32 Eq_11088) s3Out, Register out (ptr32 Eq_11089) s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out, Register out Eq_11092 s7Out, Register out (ptr32 Eq_11093) s9Out, Register out (ptr32 uint16) s10Out, Register out Eq_11095 s11Out)
// Called from:
//      mm_sta_del
//      rxl_cntrl_evt
Eq_2 apm_tx_int_ps_clear(Eq_2 ra, Eq_2 a0, Eq_11075 a1, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArgAC, Eq_2 dwArg0118, union Eq_2 & s0Out, ptr32 & s1Out, union Eq_11075 & a1Out, ptr32 & a2Out, union Eq_11087 & a4Out, struct Eq_11088 & s3Out, struct Eq_11089 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, union Eq_11092 & s7Out, struct Eq_11093 & s9Out, uint16 & s10Out, union Eq_11095 & s11Out)
{
	Eq_11087 a4_5 = (word32) *((word32) a0 + 86);
	if (a4_5 != 0x02)
	{
		s0Out = s0;
		s1Out = s1;
		a1Out = a1;
		a2Out = a2;
		a4Out = a4_5;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		return ra;
	}
	else
	{
		struct Eq_44422 * s0_24;
		ptr32 s1_25;
		struct Eq_11088 * s3_27;
		struct Eq_11089 * s4_28;
		Eq_2 s5_29;
		Eq_11075 a1_36;
		ptr32 s6_39;
		uint16 * s10_42;
		Eq_11095 s11_43;
		Eq_11092 s7_44;
		struct Eq_11093 * s9_45;
		word32 s2_191;
		word32 a6_190;
		word32 a3_189;
		word32 a2_188;
		word32 a0_187;
		Eq_2 ra_38 = sta_mgmt_send_postponed_frame(ra, a0, (word32) a1 + 0x420190D0, s5, mstatus, dwArg68, dwArg78, dwArgAC, dwArg0118, out s0_24, out s1_25, out a0_187, out a1_36, out a2_188, out a3_189, out a6_190, out s2_191, out s3_27, out s4_28, out s5_29, out s6_39, out s7_44, out s9_45, out s10_42, out s11_43);
		ui32 a5_46 = (word32) s0_24->b0032;
		if ((a5_46 & 0x0A) != 0x00)
		{
			s0_24->b0032 = (byte) (a5_46 & 0x00F5);
			if ((a5_46 & 0x00F5) == 0x00)
			{
				Eq_2 a0_59;
				struct Eq_44480 * s0_67;
				word32 a2_194;
				word32 a1_193;
				word32 s1_192;
				word32 a3_195;
				word32 a4_196;
				word32 a5_197;
				word32 a6_198;
				word32 s2_199;
				word32 s3_200;
				word32 s4_201;
				word32 s8_202;
				Eq_2 ra_66 = ke_msg_alloc(ra_38, 65, 0x00, 0x04, a5_46 & 0x0A, mstatus, dwArg08, out s0_67, out s1_192, out a0_59, out a1_193, out a2_194, out a3_195, out a4_196, out a5_197, out a6_198, out s2_199, out s3_200, out s4_201, out s8_202);
				*a0_59 = (word16) (word32) s0_67->w0018;
				word32 a4_79 = (word32) s0_67->b001A;
				((word32) a0_59 + 2)->u1 = 0x00;
				*((word32) a0_59 + 3) = (byte) a4_79;
				ptr32 a2_86;
				Eq_11087 a4_88;
				ptr32 s1_92;
				struct Eq_11088 * s3_94;
				struct Eq_11089 * s4_95;
				Eq_11075 a1_99;
				word32 a0_203;
				word32 a3_204;
				word32 a5_205;
				word32 s2_206;
				word32 s8_207;
				s0Out = ke_msg_send(a0_59, mstatus, out s1_92, out a0_203, out a1_99, out a2_86, out a3_204, out a4_88, out a5_205, out s2_206, out s3_94, out s4_95, out s8_207);
				s1Out = s1_92;
				a1Out = a1_99;
				a2Out = a2_86;
				a4Out = a4_88;
				s3Out = s3_94;
				s4Out = s4_95;
				s5Out = s5_29;
				s6Out = s6_39;
				s7Out = s7_44;
				s9Out = s9_45;
				s10Out = s10_42;
				s11Out = s11_43;
				return ra_66;
			}
		}
		s0Out = s0;
		s1Out = s1_25;
		a1Out = a1_36;
		a2Out = dwArg10;
		a4Out = a5_46 & 0x0A;
		s3Out = s3_27;
		s4Out = s4_28;
		s5Out = s5_29;
		s6Out = s6_39;
		s7Out = s7_44;
		s9Out = s9_45;
		s10Out = s10_42;
		s11Out = s11_43;
		return ra_38;
	}
}

// 2300D712: Register Eq_2 apm_sta_fw_delete(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg88, Stack Eq_2 dwArgF8, Register out Eq_44562 s0Out, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_44566 s2Out, Register out ptr32 s3Out, Register out Eq_44568 s4Out)
// Called from:
//      apm_sta_connect_timeout_ind_handler
Eq_2 apm_sta_fw_delete(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg88, Eq_2 dwArgF8, union Eq_44562 & s0Out, ptr32 & s1Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_44566 & s2Out, ptr32 & s3Out, union Eq_44568 & s4Out)
{
	ptr32 a3_17;
	ptr32 a4_18;
	Eq_44562 s0_23;
	ptr32 s1_24;
	Eq_44566 s2_25;
	ptr32 s3_26;
	Eq_44568 s4_27;
	Eq_2 ra_22 = apm_sta_delete(ra, a4, mstatus, dwArg88, dwArgF8, out s0_23, out s1_24, out a3_17, out a4_18, out s2_25, out s3_26, out s4_27);
	s0Out = s0_23;
	s1Out = s1_24;
	a3Out = a3_17;
	a4Out = a4_18;
	s2Out = s2_25;
	s3Out = s3_26;
	s4Out = s4_27;
	return ra_22;
}

// 2300D72A: Register word32 apm_sta_add(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Register out ptr32 a4Out)
// Called from:
//      ProcessPWKMsg4
//      apm_sta_add_cfm_handler
word32 apm_sta_add(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg38, ptr32 & a4Out)
{
	Eq_2 a0_21;
	struct Eq_44595 * s2_31;
	word32 s0_106;
	word32 s1_107;
	word32 a1_108;
	word32 a2_109;
	word32 a3_110;
	word32 a4_111;
	word32 a5_112;
	word32 a6_113;
	word32 s3_114;
	word32 s4_115;
	word32 s8_116;
	ke_msg_alloc(ra, 0x01FFFC08, 0x0D, 0x1C, a4, mstatus, dwArg08, out s0_106, out s1_107, out a0_21, out a1_108, out a2_109, out a3_110, out a4_111, out a5_112, out a6_113, out s2_31, out s3_114, out s4_115, out s8_116);
	s2_31->b42019101 = 0x02;
	*((word32) a0_21 + 0x00001000) = s2_31->dw420191BC;
	word32 a1_117;
	word32 a2_118;
	word32 a3_119;
	word32 a4_120;
	word32 a5_121;
	word32 a6_122;
	word32 a7_123;
	memcpy((word32) a0_21 + 4, &s2_31->b420190EB + 3, 0x06, out a1_117, out a2_118, out a3_119, out a4_120, out a5_121, out a6_122, out a7_123);
	((word32) a0_21 + 11)->u1 = (byte) (word32) s2_31->b420190EB;
	*((word32) a0_21 + 0x0A) = (byte) (word32) s2_31->b420190EA;
	struct Eq_44672 * a5_70 = (int32) s2_31->b420190F4;
	((word32) a0_21 + 0x0C)->u1 = (byte) a5_70;
	a5_70->t0010 = a0_21;
	struct Eq_44684 * s0_74 = a5_70->ptr002C;
	a5_70->t0014 = a0_21;
	((word32) a0_21 + 24)->u1 = (byte) (word32) s0_74->b0030;
	0x00 = (uint16) dwArg38;
	ptr32 a4_85;
	word32 s1_89;
	word32 a0_124;
	word32 a1_125;
	word32 a2_126;
	word32 a3_127;
	word32 a5_128;
	word32 s2_129;
	word32 s3_130;
	word32 s4_131;
	word32 s8_132;
	ke_msg_send(a0_21, mstatus, out s1_89, out a0_124, out a1_125, out a2_126, out a3_127, out a4_85, out a5_128, out s2_129, out s3_130, out s4_131, out s8_132);
	a4Out = a4_85;
	return s1_89;
}

// 2300D7AC: Register Eq_2 apm_send_mlme(Register Eq_2 ra, Register (ptr32 Eq_32357) a0, Register (ptr32 Eq_32421) a1, Register Eq_2 a2, Register Eq_2 a4, Register (ptr32 Eq_32424) a5, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 a1Out, Register out (ptr32 Eq_32440) a4Out, Register out Eq_32441 a5Out, Register out (ptr32 Eq_32424) s5Out, Register out (ptr32 Eq_32421) s6Out, Register out Eq_2 s7Out, Register out ptr32 s10Out)
// Called from:
//      rxu_cntrl_frame_handle
//      apm_probe_req_handler
//      apm_auth_handler
//      apm_assoc_req_handler
//      apm_disassoc_handler
//      apm_sta_remove
Eq_2 apm_send_mlme(Eq_2 ra, struct Eq_32357 * a0, struct Eq_32421 * a1, Eq_2 a2, Eq_2 a4, struct Eq_31105 * a5, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & a1Out, struct Eq_32440 & a4Out, union Eq_32441 & a5Out, struct Eq_31105 & s5Out, struct Eq_32421 & s6Out, union Eq_2 & s7Out, ptr32 & s10Out)
{
	Eq_2 a5_25 = a0->t03A4;
	struct Eq_32440 * a4_43;
	Eq_32441 a5_44;
	struct Eq_44730 * s0_45;
	word32 a0_51;
	ptr32 a1_52;
	word32 a3_372;
	word32 s4_373;
	word32 s5_374;
	word32 s6_375;
	word32 s7_376;
	word32 s8_377;
	word32 s9_378;
	word32 s10_379;
	word32 s11_380;
	struct Eq_44742 * s1_163;
	word32 s3_158;
	struct Eq_44744 * s2_157;
	txl_frame_get(ra, (word32) ((word32) *((word32) a5_25 + 2) != 0x00), (struct Eq_14556 *) 0x0100, a4, a5_25, fflags, frm, mstatus, dwArgD8, dwArgF8, dwArg0118, out s0_45, out s1_163, out a0_51, out a1_52, out a3_372, out a4_43, out a5_44, out s2_157, out s3_158, out s4_373, out s5_374, out s6_375, out s7_376, out s8_377, out s9_378, out s10_379, out s11_380);
	if (a0_51 == 0x00)
	{
		0x00 = (uint16) dwArg0128;
		a1Out = a1_52;
		a4Out = a4_43;
		a5Out = a5_44;
		s5Out = a5;
		s6Out = a1;
		s7Out = a2;
		s10Out = s10;
		return ra;
	}
	struct Eq_44776 * a0_145;
	struct Eq_44777 * a5_141;
	struct Eq_38648 * a0_150;
	struct Eq_44779 * a0_71 = s0_45->ptr0068;
	s0_45->b014D = (byte) (a1 >> 0x08);
	s0_45->b014C = (byte) a1;
	s0_45->b014E = 0x00;
	s0_45->b014F = 0x00;
	word32 a1_381;
	word32 a2_382;
	word32 a3_383;
	word32 a4_384;
	word32 a5_385;
	word32 a6_386;
	word32 a7_387;
	memcpy(&s0_45->b014F + 1, a2, 0x06, out a1_381, out a2_382, out a3_383, out a4_384, out a5_385, out a6_386, out a7_387);
	word32 a1_388;
	word32 a2_389;
	word32 a3_390;
	word32 a4_391;
	word32 a5_392;
	word32 a6_393;
	word32 a7_394;
	memcpy(&s0_45->b014F + 7, (char *) s1_163 + 80, 0x06, out a1_388, out a2_389, out a3_390, out a4_391, out a5_392, out a6_393, out a7_394);
	word32 a1_395;
	word32 a2_396;
	word32 a4_397;
	word32 a5_398;
	word32 a6_399;
	word32 a7_400;
	struct Eq_13120 * a3_119;
	memcpy(&s0_45->b014F + 0x0D, (char *) s1_163 + 80, 0x06, out a1_395, out a2_396, out a3_119, out a4_397, out a5_398, out a6_399, out a7_400);
	uint32 a4_131 = (word32) g_w4201A3FC + 0x01 << 16;
	g_w4201A3FC = (word16) (a4_131 >> 16);
	uint32 a4_136 = (word32) (word16) (a4_131 >> 16 << 4);
	s0_45->b0162 = (byte) a4_136;
	s0_45->b0163 = (byte) (a4_136 >> 8);
	struct Eq_44779 * s4_159 = a0_71;
	if (a1 == (struct Eq_32421 *) 0x00B0)
		a0_150 = me_build_authenticate(&s0_45->b0163 + 1, 0x00, 0x02, 0x00, 0x00, out a3_119, out a5_141);
	else
	{
		a5_141 = (struct Eq_44777 *) 0x00C0;
		if (a1 == (struct Eq_32421 *) 0x00C0)
			a0_150 = me_build_deauthenticate(&s0_45->b0163 + 1, a5);
		else if (a1 == (struct Eq_32421 *) 80)
			ra = me_build_probe_rsp(ra, &s0_45->b0163 + 1, (word32) s1_163->b0057, dwArg74, dwArg0168, out s1_163, out a0_150, out a3_119, out a5_141, out s2_157, out s3_158, out s4_159);
		else
		{
			a5_141 = (struct Eq_44777 *) 0x10;
			a0_145 = (struct Eq_44776 *) 0x18;
			if ((a1 & -33) != 0x10)
			{
l2300D868:
				word32 a4_216 = a5_141->dw0014;
				a0_145->dw0020 = a4_216;
				Mem222[a5_141 + ~0x00 + a0_145 + 24:word32] = a4_216;
				word32 a5_225 = (word32) s1_163->b0057;
				s4_159->b005E = 0x00;
				s4_159->b0060 = 0x00;
				s4_159->b002F = (byte) a5_225;
				s4_159->b0030 = ~0x00;
				s4_159->dw02CC = s3_158;
				s4_159->ptr02D0 = s2_157;
				0x00 = (uint16) dwArg0128;
				ptr32 a1_256;
				struct Eq_32440 * a4_259;
				Eq_32441 a5_260;
				ptr32 s10_265;
				struct Eq_31105 * s5_270;
				struct Eq_32421 * s6_271;
				Eq_2 s7_272;
				word32 s0_401;
				word32 s1_402;
				word32 a0_403;
				word32 a3_404;
				word32 s2_405;
				word32 s3_406;
				word32 s4_407;
				word32 s9_408;
				word32 s11_409;
				Eq_2 ra_262 = txl_frame_push(ra, dwArgE4, 0x03, a3_119, (struct Eq_13346 *) ~0x00, mstatus, dwArg38, dwArg88, dwArgB8, dwArgEC, out s0_401, out s1_402, out a0_403, out a1_256, out a3_404, out a4_259, out a5_260, out s2_405, out s3_406, out s4_407, out s5_270, out s6_271, out s7_272, out s9_408, out s10_265, out s11_409);
				a1Out = a1_256;
				a4Out = a4_259;
				a5Out = a5_260;
				s5Out = s5_270;
				s6Out = s6_271;
				s7Out = s7_272;
				s10Out = s10_265;
				return ra_262;
			}
			ra = me_build_associate_rsp(ra, &s0_45->b0163 + 1, (word32) s1_163->b0057, s2_157, dwArg74, out s1_163, out a0_150, out a3_119, out a5_141, out s2_157, out s3_158, out s4_159);
		}
	}
	a0_145 = (word32) (word16) ((char *) a0_150 + 24);
	goto l2300D868;
}

// 2300D910: Register Eq_2 apm_embedded_enabled(Register Eq_2 a0, Register out Eq_31521 a4Out)
// Called from:
//      rxu_mgt_frame_check
//      apm_bcn_set
//      apm_start_req_handler
Eq_2 apm_embedded_enabled(Eq_2 a0, union Eq_31521 & a4Out)
{
	if (a0 == 0x00)
	{
		Eq_2 a0_6 = (word32) g_b4201BC0C;
		a4Out = a4;
		return a0_6;
	}
	else
	{
		Eq_31521 a4_7 = (word32) *((word32) a0 + 86);
		ui32 a0_11 = 0x00;
		if (a4_7 == 0x02)
			a0_11 = (word32) g_b4201BC0C;
		a4Out = a4_7;
		return a0_11 & 0x01;
	}
}

// 2300D934: void apm_bcn_set(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38)
// Called from:
//      me_set_active_cfm_handler
void apm_bcn_set(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg38)
{
	Eq_2 a0_24;
	struct Eq_45083 * a5_29;
	struct Eq_45084 * s2_34;
	word32 s0_166;
	word32 s1_167;
	word32 a1_168;
	word32 a2_169;
	word32 a3_170;
	word32 a4_171;
	word32 a6_172;
	word32 s3_173;
	word32 s4_174;
	word32 s8_175;
	ke_msg_alloc(ra, 63, 0x00, (word32) (word16) ((word32) g_ptr4201BBF8->w0024 + 0x0C), a4, mstatus, dwArg08, out s0_166, out s1_167, out a0_24, out a1_168, out a2_169, out a3_170, out a4_171, out a5_29, out a6_172, out s2_34, out s3_173, out s4_174, out s8_175);
	struct Eq_45122 * s0_42 = a5_29->ptr0020;
	a5_29->t0000 = a0_24;
	*((word32) a0_24 + 4) = (word16) (word32) s0_42->w0024;
	*((word32) a0_24 + 6) = (word16) (word32) s0_42->w0026;
	((word32) a0_24 + 8)->u1 = (byte) (word32) s0_42->b0032;
	word32 a0_51 = (word32) s0_42->b0033;
	((word32) a0_24 + 9)->u1 = (byte) a0_51;
	word32 a4_176;
	word32 a0_58 = apm_embedded_enabled(a0_51 + 1107405288, out a4_176);
	Eq_2 s1_107 = a0_24;
	Eq_2 a2_61 = (word32) s0_42->w0024;
	if (a0_58 != 0x00)
	{
		word32 a1_184;
		word32 a2_185;
		word32 a3_186;
		word32 a4_187;
		word32 a5_188;
		word32 a6_189;
		word32 a7_190;
		memcpy((word32) a0_24 + 0x0C, s2_34->t0010, a2_61, out a1_184, out a2_185, out a3_186, out a4_187, out a5_188, out a6_189, out a7_190);
		struct Eq_45217 * s2_100;
		word32 a2_191;
		word32 a3_192;
		word32 a4_193;
		word32 a5_194;
		word32 s3_195;
		word32 s4_196;
		word32 s8_197;
		ke_free(s2_34->t0010, mstatus, out s1_107, out a2_191, out a3_192, out a4_193, out a5_194, out s2_100, out s3_195, out s4_196, out s8_197);
		s2_100->dw0010 = 0x00;
	}
	else
	{
		word32 a1_177;
		word32 a2_178;
		word32 a3_179;
		word32 a4_180;
		word32 a5_181;
		word32 a6_182;
		word32 a7_183;
		memcpy((word32) a0_24 + 0x0C, &s0_42->b0033 + 116, a2_61, out a1_177, out a2_178, out a3_179, out a4_180, out a5_181, out a6_182, out a7_183);
	}
	word32 s1_206;
	word32 a0_207;
	word32 a1_208;
	word32 a2_209;
	word32 a3_210;
	word32 a4_211;
	word32 a5_212;
	word32 s2_213;
	word32 s3_214;
	word32 s4_215;
	word32 s8_216;
	ke_msg_send(s1_107, mstatus, out s1_206, out a0_207, out a1_208, out a2_209, out a3_210, out a4_211, out a5_212, out s2_213, out s3_214, out s4_215, out s8_216);
	0x00 = (uint16) dwArg38;
	word32 s1_198;
	word32 a0_199;
	word32 a1_200;
	word32 a4_201;
	word32 a5_202;
	word32 s2_203;
	word32 s3_204;
	word32 s4_205;
	ke_state_set(0x07, 0x02, mstatus, out s1_198, out a0_199, out a1_200, out a4_201, out a5_202, out s2_203, out s3_204, out s4_205);
}

