pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300D9E0: void apm_probe_req_handler(Register Eq_2 ra, Register (ptr32 Eq_45301) a0, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg88, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
// Called from:
//      rxu_mgt_ind_handler
void apm_probe_req_handler(Eq_2 ra, struct Eq_45301 * a0, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg88, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	struct Eq_32357 * s0_19;
	int32 s0_13 = (word32) a0->b0008;
	if (s0_13 != 0x00FF)
		s0_19 = s0_13 + 1107405288;
	else
	{
		struct Eq_32357 * a0_16 = vif_mgmt_get_first_ap_inf();
		s0_19 = a0_16;
		if (a0_16 == null)
			goto l2300DA76;
	}
	word32 a5_474;
	Eq_2 a0_36 = mac_ie_find(&a0->b0008 + 44, (word32) (word16) ((word32) a0->w0000 + ~0x17), 0x00, out a5_474);
	if (a0_36 != 0x00)
	{
		Eq_2 a5_37 = (word32) *((word32) a0_36 + 1);
		if (a5_37 != 0x00)
		{
			Eq_2 a2_42 = (word32) s0_19->b037E;
			if (a2_42 != a5_37)
				goto l2300DA76;
			word32 a1_461;
			word32 a2_462;
			word32 a4_464;
			word32 a5_465;
			word32 a3_463;
			if (memcmp((word32) a0_36 + 2, &s0_19->b037E + 1, a2_42, out a1_461, out a2_462, out a3_463, out a4_464, out a5_465) != 0x00)
			{
l2300DA76:
				0x00 = (uint16) dwArg38;
				return;
			}
l2300DA3C:
			word32 a5_466;
			Eq_2 a0_64 = mac_ie_find(&a0->b0008 + 44, (word32) (word16) ((word32) a0->w0000 + ~0x17), 0x03, out a5_466);
			if (a0_64 == 0x00)
			{
l2300DA50:
				0x00 = (uint16) dwArg38;
				word32 s10_473;
				word32 a1_467;
				word32 s7_472;
				word32 a4_468;
				word32 s5_470;
				word32 s6_471;
				word32 a5_469;
				apm_send_mlme(ra, s0_19, (struct Eq_32421 *) 80, &a0->b0008 + 30, 0x00, null, fflags, frm, mstatus, dwArg38, ra, dwArg88, dwArgB8, dwArgD8, dwArgE4, dwArgEC, dwArgF8, dwArg0118, dwArg0128, dwArg0168, out a1_467, out a4_468, out a5_469, out s5_470, out s6_471, out s7_472, out s10_473);
				return;
			}
			ui32 a5_72;
			word32 a5_79;
			Eq_2 a5_67 = s0_19->t03A4;
			ui32 a1_68 = (word32) *((word32) a0_64 + 2);
			word32 a3_69 = (word32) *((word32) a5_67 + 2);
			word32 a4_70 = (word32) *a5_67;
			if (a3_69 == 0x00)
			{
				a5_72 = 0x00;
				if ((word32) (word16) (a4_70 + 0xFF000694) > 72)
					goto l2300DACE;
				a5_72 = 0x0E;
				if (a4_70 == 0x00FFF9B4)
				{
l2300DACE:
					if (a1_68 == a5_72)
						goto l2300DA50;
					goto l2300DA76;
				}
				a5_79 = 0xFF000699;
			}
			else
			{
				a5_72 = 0x00;
				if (a3_69 != 0x01 || (word32) ((word16) (a4_70 + ~0x0100038C)) > 0x0334)
					goto l2300DACE;
				a5_79 = ~0x01000387;
			}
			a5_72 = a4_70 + a5_79 ^ 0x05;
			goto l2300DACE;
		}
	}
	if ((word32) g_b4201BC0D != 0x00)
		goto l2300DA76;
	goto l2300DA3C;
}

// 2300DAF6: void apm_auth_handler(Register Eq_2 ra, Register (ptr32 Eq_45301) a0, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
// Called from:
//      rxu_mgt_ind_handler
void apm_auth_handler(Eq_2 ra, struct Eq_45301 * a0, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg38, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	int32 a5_13 = (word32) a0->b0008;
	if (a5_13 == 0x00FF)
		0x00 = (uint16) dwArg38;
	else
	{
		Eq_2 ra_40;
		struct Eq_32357 * s1_25 = a5_13 + 1107405288;
		ra_40 = ra;
		Eq_2 a4_28;
		word32 a3_181;
		if (hal_machw_search_addr(&a0->b0008 + 30, out a3_181, out a4_28) != 0x00FF)
		{
			word32 s0_182;
			word32 a3_183;
			word32 a4_184;
			word32 s2_185;
			word32 s3_186;
			word32 s4_187;
			ra_40 = apm_sta_delete(ra, a4_28, mstatus, dwArg78, dwArgE8, out s0_182, out s1_25, out a3_183, out a4_184, out s2_185, out s3_186, out s4_187);
		}
		0x00 = (uint16) dwArg38;
		word32 a1_188;
		word32 a4_189;
		word32 a5_190;
		word32 s5_191;
		word32 s6_192;
		word32 s7_193;
		word32 s10_194;
		apm_send_mlme(ra_40, s1_25, (struct Eq_32421 *) 0x00B0, dwArg10, 0x00, null, fflags, frm, mstatus, dwArg38, ra, dwArg88, dwArgB8, dwArgD8, dwArgE4, dwArgEC, dwArgF8, dwArg0118, dwArg0128, dwArg0168, out a1_188, out a4_189, out a5_190, out s5_191, out s6_192, out s7_193, out s10_194);
	}
}

// 2300DB5A: void apm_assoc_req_handler(Register Eq_2 ra, Register (ptr32 Eq_45301) a0, Register word32 a1, Register Eq_2 a4, Register Eq_2 s10, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108)
// Called from:
//      rxu_mgt_ind_handler
void apm_assoc_req_handler(Eq_2 ra, struct Eq_45301 * a0, word32 a1, Eq_2 a4, Eq_2 s10, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArg0108)
{
	if ((word32) a0->b0008 == 0x00FF)
		return;
	Eq_2 s1_111;
	ui32 s2_112;
	Eq_2 a0_43;
	struct Eq_45574 * s1_52;
	struct Eq_45575 * s8_56;
	word32 a1_1288;
	word32 a2_1289;
	word32 a3_1290;
	word32 s4_1296;
	word32 a0_1298;
	word32 a1_1299;
	word32 a3_1301;
	word32 a5_1303;
	word32 a4_1302;
	word32 a2_1300;
	word32 t1_1297;
	word32 a5_1292;
	word32 s3_1295;
	word32 a6_1293;
	word32 s2_1294;
	word32 a4_1291;
	word32 s0_1287;
	Eq_2 ra_371 = memset(ke_msg_alloc(ra, 0x01000407, 0x05, 88, a4, mstatus, s10, out s0_1287, out s1_52, out a0_43, out a1_1288, out a2_1289, out a3_1290, out a4_1291, out a5_1292, out a6_1293, out s2_1294, out s3_1295, out s4_1296, out s8_56), a0_43, 0x00, 88, out t1_1297, out a0_1298, out a1_1299, out a2_1300, out a3_1301, out a4_1302, out a5_1303);
	word32 a5_1308;
	word32 a6_1309;
	word32 a7_1310;
	word32 a3_1306;
	word32 a4_1307;
	word32 a2_1305;
	word32 a1_1304;
	memcpy(a0_43, &s1_52->b0008 + 30, 0x06, out a1_1304, out a2_1305, out a3_1306, out a4_1307, out a5_1308, out a6_1309, out a7_1310);
	struct Eq_45642 * a5_90 = (word32) s1_52->b0008;
	((word32) a0_43 + 73)->u1 = (byte) a5_90;
	a5_90->t004C = a0_43;
	struct Eq_45654 * s1_98 = a5_90->ptr0014;
	a5_90->t0050 = a0_43;
	*((word32) a0_43 + 84) = (byte) (int32) s1_98->b0018;
	*((word32) a0_43 + 0x0055) = (byte) (word32) s1_98->b001B;
	word32 s5_218 = a1;
	Eq_2 s0_213 = a0_43;
	Eq_2 s4_217 = &s1_52->b0008 + 30;
	struct Eq_32357 * s6_102 = (char *) s8_56 + 1107405288;
	word32 s2_108 = (word32) s1_98->w0000;
	uint32 a4_110 = (word32) s1_98->b0036 | (word32) s1_98->b0037 << 8;
	if (a1 != 0x00)
	{
		s1_111 = &s1_98->b0037 + 7;
		s2_112 = s2_108 + -0x0022;
	}
	else
	{
		s1_111 = &s1_98->b0037 + 1;
		s2_112 = s2_108 + ~0x1B;
	}
	struct Eq_31105 * a5_118 = (struct Eq_31105 *) 0x0033;
	if ((word32) s8_56->w4201ADFE < a4_110)
	{
l2300DC2E:
		struct Eq_32421 * a1_575 = (struct Eq_32421 *) 48;
		if (s5_218 == 0x00)
			a1_575 = (struct Eq_32421 *) 0x10;
		word32 s10_1326;
		word32 a4_1321;
		word32 s5_1323;
		word32 s7_1325;
		word32 s6_1324;
		word32 a5_1322;
		word32 a1_1320;
		apm_send_mlme(ra_371, s6_102, a1_575, s4_217, s0_213, a5_118, fflags, frm, mstatus, dwLoc28, dwArg14, dwArg28, dwArg58, dwArg78, dwArg84, dwArg8C, dwArg98, dwArgB8, dwArgC8, dwArg0108, out a1_1320, out a4_1321, out a5_1322, out s5_1323, out s6_1324, out s7_1325, out s10_1326);
		return;
	}
	uint32 s2_125 = s2_112 << 16;
	word32 a5_1311;
	Eq_2 a0_133 = mac_ie_find(s1_111, s2_125 >> 0x10, 0x00, out a5_1311);
	if (a0_133 == 0x00)
	{
l2300DC2C:
		a5_118 = (struct Eq_31105 *) 0x01;
		goto l2300DC2E;
	}
	Eq_2 a2_135 = (word32) s8_56->b4201AD66;
	if (a2_135 != (word32) (*((word32) a0_133 + 1)))
		goto l2300DC2C;
	word32 a5_1316;
	word32 a1_1312;
	word32 a4_1315;
	word32 a2_1313;
	word32 a3_1314;
	if (memcmp((word32) a0_133 + 2, &s8_56->b4201AD66 + 1, a2_135, out a1_1312, out a2_1313, out a3_1314, out a4_1315, out a5_1316) != 0x00)
		goto l2300DC2C;
	word32 a5_1317;
	Eq_2 a0_152 = mac_ie_find(s1_111, s2_125 >> 0x10, 0x01, out a5_1317);
	a5_118 = (struct Eq_31105 *) 0x12;
	if (a0_152 == 0x00)
		goto l2300DC2E;
	word32 a5_154 = (word32) *((word32) a0_152 + 1);
	byte * a4_156 = fp + -80;
	byte * a0_157 = (word32) a0_152 + 2;
	uint8 bLoc50_764 = (byte) a5_154;
	while (true)
	{
		a5_154 += ~0x00;
		++a4_156;
		if (a5_154 == ~0x00)
			break;
		*a4_156 = (byte) (word32) *a0_157;
		++a0_157;
	}
	word32 a5_1318;
	Eq_2 a0_178 = mac_ie_find(s1_111, s2_125 >> 0x10, 50, out a5_1318);
	uint16 wLoc50_776 = SEQ(bLoc4F, bLoc50_764);
	if (a0_178 != 0x00)
	{
		word32 a2_180 = (word32) bLoc50_764;
		int32 a4_181 = (word32) *((word32) a0_178 + 1);
		int32 a5_182;
		for (a5_182 = 0x00; a4_181 != a5_182; ++a5_182)
			a2_180 + a5_182 + (fp + -79) = (byte *) (byte) (word32) ((word32) a0_178 + 2 + a5_182);
		wLoc50_776 = SEQ(bLoc4F, (byte) (a4_181 + (word32) bLoc50_764));
	}
	int32 a0_207;
	Eq_2 s1_214;
	byte * s2_215;
	word32 s3_216;
	word32 s8_221;
	word32 a4_1319;
	struct Eq_45810 * s7_220;
	s0_213 = me_legacy_rate_bitfield_build(fp + -80, 0x00, dwArgC8, out s1_214, out a0_207, out a4_1319, out s2_215, out s3_216, out s4_217, out s5_218, out s6_102, out s7_220, out s8_221);
	((word32) s0_213 + 6)->u1 = 0x00;
	byte bLoc50_798 = (byte) wLoc50_776;
	uint32 s10_228 = 0x00;
	struct Eq_45833 * s3_229 = s3_216 + (s8_221 + 0x05D8);
	while (s10_228 < (word32) s3_229->b03B0)
	{
		struct Eq_45882 * s8_234 = s3_229 + s10_228 / 945;
		word32 a4_1327;
		if ((a0_207 >> me_rate_translate((word32) s8_234->b03B1, out a4_1327) & 0x01) != 0x00)
		{
			int32 a5_245 = (word32) *((word32) s0_213 + 6);
			(word32) s0_213 + a5_245 + 7 = (ptr32) (byte) (word32) s8_234->b03B1;
			*((word32) s0_213 + 6) = (byte) (a5_245 + 0x01);
		}
		else if ((int32) s8_234->b03B1 < 0x00)
		{
			a5_118 = (struct Eq_31105 *) 0x12;
			goto l2300DC2E;
		}
		s10_228 = s10_228 + 0x01 & 0x00FF;
	}
	word32 a5_1328;
	Eq_2 a0_263 = mac_ie_find(s1_214, s2_215, 45, out a5_1328);
	if (a0_263 != 0x00)
	{
		*((word32) s0_213 + 20) = (word16) ((word32) *((word32) a0_263 + 3) << 8 | (word32) (*((word32) a0_263 + 2)));
		*((word32) s0_213 + 22) = (byte) (word32) *((word32) a0_263 + 4);
		byte * a4_271 = (word32) a0_263 + 5;
		struct Eq_45945 * a5_273 = (word32) s0_213 + 23;
		while (a5_273 != (word32) s0_213 + 39)
		{
			++a5_273;
			a5_273[0x0FFF] = (struct Eq_45945) (byte) (word32) *a4_271;
			++a4_271;
		}
		*((word32) s0_213 + 40) = (word16) ((word32) *((word32) a0_263 + 22) << 8 | (word32) (*((word32) a0_263 + 21)));
		((word32) *((word32) a0_263 + 24) << 8 | (word32) (*((word32) a0_263 + 23)))->t002C = s0_213;
		struct Eq_45989 * a5_294 = (word32) *((word32) a0_263 + 27);
		*((word32) s0_213 + 48) = (byte) a5_294;
		s0_213 = a5_294->t0040;
		(a5_294 | 2)->t0040 = s0_213;
	}
	struct Eq_45905 * a0_308;
	struct Eq_45906 * a4_310;
	word32 a2_1329;
	Eq_2 s1_316 = mac_vsie_find(s1_214, s2_215, &g_t23075444, (byte *) 0x04, out a0_308, out a2_1329, out a4_310, out s4_217);
	if (a0_308 != null)
	{
		s0_213 = a4_310->t0040;
		uint32 a5_323 = (word32) a0_308->b0008;
		(a4_310 | 1)->t0040 = s0_213;
		((word32) s0_213 + 70)->u1 = (byte) (a5_323 & 0x0F);
		((word32) s0_213 + 71)->u1 = (byte) (a5_323 >> 4 & 0x06);
	}
	word32 t1_1330;
	word32 a5_1336;
	word32 a0_1338;
	word32 a1_1339;
	word32 a3_1341;
	word32 a5_1343;
	word32 a4_1342;
	word32 a2_1340;
	word32 t1_1337;
	word32 a1_1332;
	word32 a4_1335;
	word32 a2_1333;
	word32 a3_1334;
	word32 a0_1331;
	ra_371 = memset(memset(ra_371, fp + -80, 0x00, 0x02, out t1_1330, out a0_1331, out a1_1332, out a2_1333, out a3_1334, out a4_1335, out a5_1336), fp + -84, 0x00, 0x01, out t1_1337, out a0_1338, out a1_1339, out a2_1340, out a3_1341, out a4_1342, out a5_1343);
	word32 a5_1344;
	if (mac_ie_find(s1_316, s2_215, 48, out a5_1344) != 0x00)
		bLoc50_798 = (byte) (word16) ((word32) wLoc50_776 | 32);
	else
	{
		word32 a0_387;
		word32 a4_1346;
		word32 a2_1345;
		mac_vsie_find(s1_316, s2_215, &g_t2307544C, (byte *) 0x04, out a0_387, out a2_1345, out a4_1346, out s4_217);
		if (a0_387 == 0x00)
			goto l2300DDCA;
		bLoc50_798 = (byte) (word16) ((word32) wLoc50_776 | 8);
	}
l2300DDCA:
	Eq_2 a0_416 = g_t4201B9C4;
	if (a0_416 != 0x00)
	{
		a5_118 = (struct Eq_31105 *) 46;
		if (((word32) bLoc50_798 & 40) == 0x00)
			goto l2300DC2E;
		struct Eq_46125 * s1_439;
		ra_371 = InitStaKeyInfo(ra_371, a0_416, fp + -80, fp + -84, dwArg14, dwArgC8, out s0_213, out s1_439, out s4_217);
		cm_SetPeerAddr(s1_439->dwFFFFF9C4, 0x00, s0_213);
	}
	up32 a4_473 = (word32) g_t4201BC0E;
	up32 a5_474 = (word32) g_b4201BC0F;
	((word32) s0_213 + 0x0044)->u0 = 0x00;
	if (a4_473 >= a5_474)
	{
l2300DE18:
		a5_118 = (struct Eq_31105 *) 0x11;
		goto l2300DC2E;
	}
	struct Eq_46186 * s2_482 = &g_ptr4201BBF8;
	struct Eq_45810 * s1_483 = (struct Eq_45810 *) ~0x00;
	do
	{
		if ((word32) s2_482->b001E != 0x00)
		{
			word32 a2_1348;
			word32 a3_1349;
			word32 a4_1350;
			word32 a5_1351;
			word32 a1_1347;
			if (memcmp((char *) s2_482 + 24, s4_217, 0x06, out a1_1347, out a2_1348, out a3_1349, out a4_1350, out a5_1351) == 0x00)
			{
				s7_220[1107409949] = (struct Eq_45810) 0x01;
				s1_483 = s7_220;
				goto l2300DEE6;
			}
		}
		else if (s1_483 == (struct Eq_45810 *) ~0x00)
			s1_483 = s7_220;
		++s7_220;
		++s2_482;
	} while (s7_220 != (struct Eq_45810 *) 0x0A);
	if (s1_483 == (struct Eq_45810 *) ~0x00)
		goto l2300DE18;
	struct Eq_46233 * s2_512 = s1_483 + 7;
	word32 a5_1356;
	word32 a7_1358;
	word32 a6_1357;
	word32 a1_1352;
	word32 a4_1355;
	word32 a2_1353;
	word32 a3_1354;
	memcpy((char *) s2_512 + 0x4201BC10, s4_217, 0x06, out a1_1352, out a2_1353, out a3_1354, out a4_1355, out a5_1356, out a6_1357, out a7_1358);
	s2_512->b4201BC16 = 0x01;
l2300DEE6:
	word32 a5_544 = (word32) g_t4201BC0E;
	*((word32) s0_213 + 0x0044) = (word16) (s1_483 + 1);
	g_t4201BC0E = (byte) (a5_544 + 0x01);
	a5_118 = null;
	goto l2300DC2E;
}

// 2300DF2C: void apm_deauth_handler(Register Eq_2 ra, Register (ptr32 Eq_45301) a0, Register ptr32 mstatus, Stack Eq_2 dwArg88, Stack Eq_2 dwArgF8)
// Called from:
//      rxu_mgt_ind_handler
void apm_deauth_handler(Eq_2 ra, struct Eq_45301 * a0, ptr32 mstatus, Eq_2 dwArg88, Eq_2 dwArgF8)
{
	Eq_2 a4_5 = (word32) a0->b0008;
	if (a4_5 == 0x00FF || (word32) a0->b0007 == 0x00FF)
		return;
	word32 s4_105;
	word32 s2_103;
	word32 s3_104;
	word32 a4_102;
	word32 a3_101;
	word32 s1_100;
	word32 s0_99;
	apm_sta_delete(ra, a4_5, mstatus, dwArg88, dwArgF8, out s0_99, out s1_100, out a3_101, out a4_102, out s2_103, out s3_104, out s4_105);
}

// 2300DF4C: void apm_disassoc_handler(Register Eq_2 ra, Register (ptr32 Eq_45301) a0, Register Eq_2 a4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
// Called from:
//      rxu_mgt_ind_handler
void apm_disassoc_handler(Eq_2 ra, struct Eq_45301 * a0, Eq_2 a4, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	if ((word32) a0->b0008 == 0x00FF || (word32) a0->b0007 == 0x00FF)
		return;
	word32 s0_32;
	word32 s4_188;
	word32 s3_187;
	word32 s2_186;
	word32 a4_185;
	word32 a3_184;
	word32 s1_183;
	Eq_2 ra_31 = apm_sta_delete(ra, a4, mstatus, dwArg68, dwArgD8, out s0_32, out s1_183, out a3_184, out a4_185, out s2_186, out s3_187, out s4_188);
	word32 s10_195;
	word32 s7_194;
	word32 s6_193;
	word32 s5_192;
	word32 a5_191;
	word32 a4_190;
	word32 a1_189;
	apm_send_mlme(ra_31, s0_32 + 1107405288, (struct Eq_32421 *) 0x00C0, &a0->b0008 + 30, 0x00, (struct Eq_31105 *) 0x02, fflags, frm, mstatus, dwArg38, dwArg74, dwArg88, dwArgB8, dwArgD8, dwArgE4, dwArgEC, dwArgF8, dwArg0118, dwArg0128, dwArg0168, out a1_189, out a4_190, out a5_191, out s5_192, out s6_193, out s7_194, out s10_195);
}

// 2300DFA4: void apm_beacon_handler()
// Called from:
//      rxu_mgt_ind_handler
void apm_beacon_handler()
{
}

// 2300DFA6: Register word32 apm_sta_remove(Register Eq_2 ra, Register (ptr32 Eq_46396) a0, Register up32 a1, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
// Called from:
//      apm_sta_del_req_handler
word32 apm_sta_remove(Eq_2 ra, struct Eq_46396 * a0, up32 a1, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD4, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	Eq_2 a4_36;
	word32 a1_106;
	word32 a5_107;
	word32 s5_108;
	word32 s6_109;
	word32 s7_110;
	word32 s10_111;
	Eq_2 ra_56 = apm_send_mlme(ra, (char *) a0 + 1107405288, (struct Eq_32421 *) 0x00C0, a1 + 0x420190EE, 0x00, (struct Eq_31105 *) 0x02, fflags, frm, mstatus, dwArg28, dwArg64, dwArg78, dwArgA8, dwArgC8, dwArgD4, dwArgDC, dwArgE8, dwArg0108, dwArg0118, dwArg0158, out a1_106, out a4_36, out a5_107, out s5_108, out s6_109, out s7_110, out s10_111);
	word32 s0_75;
	word32 s1_112;
	word32 a3_113;
	word32 a4_114;
	word32 s2_115;
	word32 s3_116;
	word32 s4_117;
	apm_sta_delete(ra_56, a4_36, mstatus, dwArg88, dwArgF8, out s0_75, out s1_112, out a3_113, out a4_114, out s2_115, out s3_116, out s4_117);
	return s0_75;
}

// 2300DFF6: Register Eq_2 cfg_api_element_dump(Register Eq_2 ra, Register ptr32 s0, Register word32 a1, Register ptr32 a2, Register out ptr32 s0Out)
// Called from:
//      dump_cfg_entries
Eq_2 cfg_api_element_dump(Eq_2 ra, ptr32 s0, word32 a1, ptr32 a2, ptr32 & s0Out)
{
	if ((a1 + ~0x00 & 0x00FF) > 0x07)
	{
		s0Out = s0;
		return ra;
	}
	else
	{
		ptr32 s0_23;
		Eq_2 ra_24;
		g_t23075488();
		s0Out = s0_23;
		return ra_24;
	}
}

Eq_85320 g_t2300E088 = 
	{
		18051,
		0x05,
		55,
	};
Eq_85320 g_t2300E0DC = 
	{
		22147,
		0x05,
		55,
	};
// 2300E182: void cfg_api_element_general_set(Register Eq_2 ra, Register word32 a1, Register Eq_2 a3, Stack word32 dwArg10, Stack word32 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void cfg_api_element_general_set(Eq_2 ra, word32 a1, Eq_2 a3, word32 dwArg10, word32 dwArg14, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	word32 a1_20;
	word32 a3_22;
	struct Eq_46480 * s1_26;
	word32 a0_116;
	word32 a2_117;
	word32 a4_118;
	word32 a5_119;
	word32 a7_120;
	word32 s2_121;
	word32 s3_122;
	word32 s4_123;
	word32 s5_124;
	word32 s6_125;
	word32 s7_126;
	word32 s8_127;
	word32 s9_128;
	word32 s10_129;
	word32 s11_130;
	word32 t4_131;
	Eq_2 ra_25 = printf(ra, &g_t23075518, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_26, out a0_116, out a1_20, out a2_117, out a3_22, out a4_118, out a5_119, out a7_120, out s2_121, out s3_122, out s4_123, out s5_124, out s6_125, out s7_126, out s8_127, out s9_128, out s10_129, out s11_130, out t4_131);
	if ((word32) (word16) ((word32) s1_26->w0006 + ~0x00) > 0x06)
		return;
	word32 a5_52 = g_dw230754A8;
	g_dw230754A8();
}

