pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300E1EE: void cfg_api_element_general_get()
void cfg_api_element_general_get()
{
}

// 2300E1F2: Register Eq_2 cfg_api_element_set(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register ptr32 a2, Register ptr32 a3, Register ptr32 a4, Register Eq_2 a5, Register Eq_2 s6, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack word32 dwArg0128, Register out ptr32 s1Out, Register out ptr32 a4Out)
// Called from:
//      cfg_start_req_handler
Eq_2 cfg_api_element_set(Eq_2 ra, Eq_2 a0, Eq_2 a1, ptr32 a2, ptr32 a3, ptr32 a4, Eq_2 a5, Eq_2 s6, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, word32 dwArg0128, ptr32 & s1Out, ptr32 & a4Out)
{
	Eq_2 s2_145 = a0;
	Eq_2 s3_146 = a1;
	ptr32 s4_147 = a2;
	ptr32 s5_31 = a3;
	ptr32 s6_33 = a4;
	ptr32 s0_34 = 0x2308E3E0;
	ptr32 s1_105 = 587785268;
	word32 s7_148 = 0x23075000;
	while (s0_34 < s1_105)
	{
		struct Eq_46561 * s0_41 = *a5;
		if (a5 == s2_145)
		{
			a5 = (word32) s0_41->w0004;
			if (a5 == s3_146)
			{
				a4 = (word32) s0_41->w0006;
				if (a4 == s4_147)
					goto l2300E244;
				word32 s10_271;
				word32 t4_273;
				word32 s11_272;
				word32 a2_267;
				word32 s8_269;
				word32 s9_270;
				word32 a7_268;
				word32 a0_265;
				word32 a1_266;
				ra = printf(ra, s7_148 + 1332, s3_146, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_105, out a0_265, out a1_266, out a2_267, out a3, out a4, out a5, out a7_268, out s2_145, out s3_146, out s4_147, out s5_31, out s6_33, out s7_148, out s8_269, out s9_270, out s10_271, out s11_272, out t4_273);
			}
		}
		s0_34 = &s0_41->w0006 + 11;
	}
	if (s0_34 != s1_105)
	{
l2300E244:
		word32 s0_80 = *((word32) a5 + 16);
		word32 a5_118;
		word32 a7_123;
		word32 s10_124;
		word32 s11_125;
		word32 s9_126;
		word32 t0_127;
		word32 t4_128;
		a5();
	}
	0x00 = dwArg0128;
	s1Out = s1_105;
	a4Out = a4;
	return ra;
}

// 2300E278: void co_list_init(Register (ptr32 Eq_12719) a0)
// Called from:
//      mm_init
//      mm_timer_init
//      rxl_init
//      rxl_reset
//      sta_mgmt_init
//      txl_cntrl_init
//      txl_reset
//      txl_frame_init
//      vif_mgmt_init
//      sm_set_bss_param
//      hal_dma_init
//      txl_cfm_init
void co_list_init(struct Eq_12719 * a0)
{
	a0->dw0000 = 0x00;
	a0->dw0004 = 0x00;
}

// 2300E282: Register Eq_2 co_list_push_back(Register Eq_2 a1, Register Eq_2 a5)
// Called from:
//      mm_back_to_host_idle
//      mm_tim_update
//      rxl_timer_int_handler
//      scan_send_cancel_cfm
//      sta_mgmt_init
//      sta_mgmt_register
//      sta_mgmt_unregister
//      txl_cntrl_push_int
//      txl_cntrl_push
//      txl_frame_init
//      txl_frame_push_force
//      txl_frame_cfm
//      txl_frame_release
//      txl_frame_evt
//      vif_mgmt_init
//      vif_mgmt_register
//      vif_mgmt_unregister
//      rxu_mpdu_upload_and_indicate.constprop.11
//      rxu_cntrl_frame_handle
//      scanu_start
//      sm_set_bss_param
//      apm_set_bss_param
//      ke_task_schedule
//      chan_tbtt_insert
//      chan_init
//      chan_ctxt_del
//      chan_ctxt_link
//      txl_cfm_push
Eq_2 co_list_push_back(Eq_2 a1, Eq_2 a5)
{
	if (a1 != 0x00)
	{
		Eq_2 s1_20 = *a5;
		if (a5 == 0x00)
			*a1 = s1_20;
		else
		{
			s1_20 = *((word32) a5 + 4);
			*a1 = a5;
		}
		*((word32) a1 + 4) = s1_20;
		a1->u0 = 0x00;
		return s1_20;
	}
	else
		assert_err();
}

// 2300E2C4: Register Eq_2 co_list_push_front(Register Eq_2 a1, Register Eq_2 a5)
// Called from:
//      co_list_insert_after
Eq_2 co_list_push_front(Eq_2 a1, Eq_2 a5)
{
	if (a1 != 0x00)
	{
		Eq_2 s1_20 = *a5;
		if (a5 == 0x00)
			*((word32) a1 + 4) = s1_20;
		*a5 = a1;
		*a1 = s1_20;
		return s1_20;
	}
	else
		assert_err();
}

// 2300E2FE: Register Eq_2 co_list_pop_front(Register Eq_2 a4, Register Eq_2 a5, Register out Eq_2 a5Out)
// Called from:
//      mm_bcn_transmitted
//      mm_timer_schedule
//      rxl_cntrl_evt
//      sta_mgmt_entry_init
//      sta_mgmt_register
//      sta_mgmt_send_postponed_frame
//      txl_transmit_trigger
//      txl_frame_get
//      txl_frame_evt
//      vif_mgmt_register
//      rxu_swdesc_upload_evt
//      sm_send_next_bss_param
//      apm_send_next_bss_param
//      ke_task_schedule
//      ke_timer_clear
//      ke_timer_schedule
//      chan_upd_ctxt_status
//      chan_tbtt_schedule
//      chan_ctxt_add
//      hal_dma_evt
//      txl_cfm_evt
//      txl_cfm_flush
Eq_2 co_list_pop_front(Eq_2 a4, Eq_2 a5, union Eq_2 & a5Out)
{
	Eq_2 a0_5 = *a5;
	if (a5 != 0x00)
	{
		a5 = *a4;
		*a4 = a0_5;
	}
	a5Out = a5;
	return a5;
}

// 2300E30A: Register Eq_2 co_list_extract(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a4, Register Eq_2 a5, Register out Eq_2 a5Out)
// Called from:
//      sta_mgmt_unregister
//      vif_mgmt_unregister
//      chan_tbtt_insert
//      chan_upd_ctxt_status
//      chan_tbtt_switch_update
//      chan_bcn_to_evt
//      chan_ctxt_unlink
Eq_2 co_list_extract(Eq_2 a0, Eq_2 a1, Eq_2 a4, Eq_2 a5, union Eq_2 & a5Out)
{
	Eq_2 s1_13 = a1;
	if (a0 != 0x00)
	{
		Eq_2 s0_20 = *a5;
		if (a5 != 0x00)
		{
			if (a5 == a1)
			{
				s1_13 = *a5;
				*a5 = s0_20;
			}
			else
			{
				do
				{
					a5 = *a4;
					if (a4 == 0x00)
						goto l2300E33C;
				} while (a4 != a1);
				word32 s0_26 = *((word32) a4 + 4);
				if (a4 == a1)
					*((word32) a5 + 4) = s0_26;
				s1_13 = *a4;
				*a4 = a5;
			}
		}
l2300E33C:
		a5Out = a5;
		return s1_13;
	}
	else
		assert_err();
}

// 2300E35E: Register word32 co_list_cnt(Register Eq_2 a5, Register out Eq_2 a5Out)
// Called from:
//      rxl_cntrl_dump
//      txl_cntrl_env_dump
//      txl_frame_get
//      txl_frame_dump
//      txl_cfm_dump
word32 co_list_cnt(Eq_2 a5, union Eq_2 & a5Out)
{
	word32 a0_6 = 0x00;
	while (a5 != 0x00)
	{
		++a0_6;
		a5 = *a5;
	}
	a5Out = a5;
	return a0_6;
}

