pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300E36C: Register Eq_2 co_list_insert(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register (ptr32 code) a2, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out)
// Called from:
//      ke_timer_set
//      chan_upd_ctxt_status
Eq_2 co_list_insert(Eq_2 ra, Eq_2 s0, Eq_2 a1, <anonymous> * a2, Eq_2 dwArg0128, union Eq_2 & s1Out, union Eq_2 & s2Out, union Eq_2 & s3Out)
{
	struct Eq_46744 * sp_26 = fp + -48;
	Eq_2 s2_15 = *s0;
	Eq_2 s1_17 = a1;
	Eq_2 s3_18 = 0x00;
	while (s0 != 0x00)
	{
		sp_26->ptr0084 = a2;
		word32 a0_36;
		word32 a2_38;
		a2();
		if (a0_36 != 0x00)
			goto l2300E398;
		s3_18 = s0;
		a2 = sp_26->ptr0084;
		s0 = *s0;
	}
	*((word32) s2_15 + 4) = s1_17;
l2300E398:
	*s0 = s1_17;
	if (s3_18 != 0x00)
		*s3_18 = s1_17;
	else
		*s2_15 = s1_17;
	0x00 = (uint16) dwArg0128;
	s1Out = s1_17;
	s2Out = s2_15;
	s3Out = s3_18;
	return dwArgE4;
}

// 2300E3B6: Register word32 co_list_insert_after(Register word32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      chan_tbtt_insert
word32 co_list_insert_after(word32 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	if (a1 != 0x00)
	{
		while (a5 != 0x00)
		{
			if (a5 == a1)
			{
				Eq_2 a5_13 = *a3;
				*a3 = a2;
				*a2 = a5_13;
				struct Eq_46814 * a2_17 = *a5_13;
				if (a5_13 == 0x00)
				{
					a2_17->dw0004 = a0;
					a0Out.u0 = <invalid>;
					a1Out = a1;
					a4Out.u0 = <invalid>;
					a5Out = a5_13;
					return s1;
				}
				else
				{
					a0Out.u0 = <invalid>;
					a1Out = a1;
					a4Out.u0 = <invalid>;
					a5Out = a5_13;
					return s1;
				}
			}
			a5 = *a5;
		}
		a0Out.u0 = <invalid>;
		a1Out = a1;
		a4Out.u0 = <invalid>;
		a5Out = a5;
		return s1;
	}
	else
	{
		word32 s1_24 = co_list_push_front(a2, a5);
		a0Out.u0 = <invalid>;
		a1Out = a2;
		a4Out.u0 = <invalid>;
		a5Out = a5;
		return s1_24;
	}
}

// 2300E3DC: Register Eq_2 co_list_remove(Register (ptr32 Eq_44223) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Stack word32 dwArg38, Register out Eq_2 a5Out, Register out (ptr32 Eq_44223) s2Out)
// Called from:
//      apm_tx_int_ps_get_postpone
Eq_2 co_list_remove(struct Eq_44223 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, word32 dwArg38, union Eq_2 & a5Out, struct Eq_44223 & s2Out)
{
	Eq_2 s1_15 = a1;
	if (a0 == null)
		assert_err();
	Eq_2 s0_35;
	if (a1 != 0x00)
	{
		s1_15 = *a5;
		if (a5 != a2)
			assert_err();
		if (a2 != 0x00)
		{
			s0_35 = *a5;
			*a5 = s1_15;
			a5 = a0->t0004;
			if (a5 == s0_35)
				a0->t0004 = s1_15;
l2300E45C:
			*s0_35 = 0x00;
			0x00 = dwArg38;
			a5Out = a5;
			s2Out = a0;
			return s1_15;
		}
	}
	else if (a2 != 0x00)
	{
		s0_35 = *a5;
		a0->dw0000 = (int32) a5;
		goto l2300E45C;
	}
	assert_err();
}

// 2300E46C: Register (ptr32 Eq_11679) co_crc32(Register (ptr32 Eq_11679) a0, Register Eq_11683 a1, Register (ptr32 Eq_11679) a2, Register out Eq_11683 a4Out)
// Called from:
//      mm_check_beacon
struct Eq_11679 * co_crc32(struct Eq_11679 * a0, Eq_11683 a1, struct Eq_11679 * a2, union Eq_11683 & a4Out)
{
	Eq_11683 a4_20 = 0x00;
	while (a4_20 != a1)
	{
		a4_20 = (word32) a4_20.u1 + 1;
		a2 = a2 << 0x08 ^ 587683284[(a2 >>u 24 ^ CONVERT(Mem0[a4_20 + a0:byte], byte, word32)) * 0x04];
	}
	a4Out = a4_20;
	return a2;
}

// 2300E49C: Register Eq_2 ke_evt_set(Register Eq_2 a0, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a5Out)
// Called from:
//      mm_back_to_host_idle
//      rxl_timer_int_handler
//      rxl_cntrl_evt
//      scan_send_cancel_cfm
//      txl_frame_cfm
//      rxu_cntrl_frame_handle
//      rxu_cntrl_evt
//      scanu_start
//      bl60x_fw_dump_statistic
//      ke_timer_set
//      ipc_emb_tx_irq
//      ipc_emb_tx_evt
//      ipc_emb_cfmback_irq
//      ipc_emb_msg_irq
//      bl_irq_handler
//      chan_upd_ctxt_status
//      hal_machw_gen_handler
//      txl_cfm_push
//      my_pbuf_free_custom
Eq_2 ke_evt_set(Eq_2 a0, Eq_2 a4, ptr32 mstatus, ptr32 & a5Out)
{
	__csrrc(mstatus, 0x08);
	ptr32 a5_7 = *a4;
	Eq_2 a4_9 = a4 | a0;
	*a4_9 = a5_7;
	__csrrs(mstatus, 0x08);
	a5Out = a5_7;
	return a4_9;
}

// 2300E4B4: Register word32 ke_evt_clear(Register Eq_2 a0, Register Eq_2 a4, Register ptr32 mstatus)
// Called from:
//      mm_tbtt_evt
//      mm_hw_idle_evt
//      mm_timer_schedule
//      rxl_dma_evt
//      rxl_cntrl_evt
//      txl_reset
//      txl_frame_evt
//      rxu_cntrl_evt
//      rxu_swdesc_upload_evt
//      bl_event_handle
//      bl60x_fw_dump_statistic
//      ke_init
//      ke_task_schedule
//      ke_timer_schedule
//      ipc_emb_tx_evt
//      ipc_emb_msg_evt
//      hal_dma_evt
//      bl_reset_evt
//      txl_cfm_evt
word32 ke_evt_clear(Eq_2 a0, Eq_2 a4, ptr32 mstatus)
{
	__csrrc(mstatus, 0x08);
	word32 a5_7 = *a4;
	*(~a0 & a4) = a5_7;
	__csrrs(mstatus, 0x08);
	return a5_7;
}

// 2300E4D0: void bl_event_handle(Register Eq_2 ra, Register ptr32 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register word32 s4, Register Eq_46927 s6, Register ptr32 mstatus, Stack word32 dwArg08, Stack (ptr32 Eq_46930) dwArg10, Stack ptr32 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack word32 dwArg88, Stack Eq_2 dwArg8C)
void bl_event_handle(Eq_2 ra, ptr32 s0, Eq_2 a3, Eq_2 a4, Eq_2 s2, word32 s4, Eq_46927 s6, ptr32 mstatus, word32 dwArg08, struct Eq_46930 * dwArg10, ptr32 dwArg28, word32 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, word32 dwArg88, Eq_2 dwArg8C)
{
	ke_evt_clear(0x40000000, a4, mstatus);
	bl_main_event_handle(ra, s0, dwArg10, a3, a4, s2, s4, s6, mstatus, dwArg08, dwArg10, dwArg28, dwArg38, dwArg40, dwArg44, dwArg68, dwArg88, dwArg8C);
}

