pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300E4E4: Register Eq_2 bl_fw_statistic_dump(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack word32 dwArg0118)
// Called from:
//      bl60x_fw_dump_statistic
Eq_2 bl_fw_statistic_dump(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, word32 dwArg0118)
{
	Eq_2 a5_10 = ke_evt_clear(32, a4, mstatus);
	__csrrc(mstatus, 0x08);
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg8 = <invalid>;
	Eq_2 stackArg80 = <invalid>;
	Eq_2 stackArg84 = <invalid>;
	Eq_2 stackArg120 = <invalid>;
	Eq_2 stackArg156 = <invalid>;
	bl_utils_dump(ra, a3, s2, stackArg8, stackArg80, stackArg84, stackArg120, stackArg156);
	Eq_2 a5_13 = txl_frame_dump(a5_10);
	ipc_emb_dump();
	txl_cntrl_env_dump(a5_13);
	txl_cfm_dump(a5);
	rxl_cntrl_dump(rxl_hwdesc_dump(ra, a3, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0118));
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg24 = <invalid>;
	Eq_2 stackArg96 = <invalid>;
	Eq_2 stackArg100 = <invalid>;
	Eq_2 stackArg136 = <invalid>;
	Eq_2 stackArg172 = <invalid>;
	word32 s1_76;
	word32 a0_77;
	word32 s10_78;
	hal_mib_dump(ra, a3, stackArg24, stackArg96, stackArg100, stackArg136, stackArg172, out s1_76, out a0_77, out s10_78);
	__csrrs(mstatus, 0x08);
	return a3_30;
}

// 2300E51E: Register Eq_2 bl60x_fw_dump_statistic(Register Eq_2 ra, Register word32 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack word32 dwArg0118)
// Called from:
//      cmd_wifi_dump
Eq_2 bl60x_fw_dump_statistic(Eq_2 ra, word32 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, word32 dwArg0118)
{
	if (a0 != 0x00)
		return bl_fw_statistic_dump(ra, a3, a4, mstatus, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0118);
	word32 a5_89;
	ke_evt_set(32, a4, mstatus, out a5_89);
	return a3;
}

// 2300E52E: Register word32 ke_evt_schedule(Register word32 ra, Register Eq_2 a0, Stack word32 dwArgA8, Register out ptr32 s6Out)
// Called from:
//      wifi_main
word32 ke_evt_schedule(word32 ra, Eq_2 a0, word32 dwArgA8, ptr32 & s6Out)
{
	Eq_2 s0_24 = 1107410008;
	Eq_363020 s1_25[] = g_a230759D4;
	Eq_2 s4_26 = 0x1A;
	word32 s5_27 = 0x23074000;
	ptr32 s6_28 = 587685888;
	while (a0 != 0x00)
	{
		word32 a4_107;
		Eq_2 a0_30 = __clzsi2(a0, out a4_107);
		<anonymous> * s3_37 = s1_25[a0_30].ptr0000;
		if (s4_26 < a0_30 || s3_37 == null)
			assert_err();
		ui32 s2_46 = &(s1_25 + (a0_30 << 0x03) / 8)->ptr0000;
		word32 a1_68;
		s3_37();
		s0_24 = *a0;
	}
	0x00 = dwArgA8;
	s6Out = s6_28;
	return s5_27;
}

// 2300E5AA: void ke_init(Register Eq_2 a4, Register ptr32 mstatus)
// Called from:
//      bl_init
void ke_init(Eq_2 a4, ptr32 mstatus)
{
	ke_mem_init(mstatus)->dw001C = 1107410008;
	g_dw4201BC64 = 0x00;
	g_dw4201BC68 = 0x00;
	g_dw4201BC5C = 0x00;
	g_dw4201BC60 = 0x00;
	g_ptr4201BC6C = null;
	g_dw4201BC70 = 0x00;
	ke_evt_clear(~0x00, a4, mstatus);
}

// 2300E5DC: Register word32 ke_mem_init(Register ptr32 mstatus)
// Called from:
//      ke_init
word32 ke_mem_init(ptr32 mstatus)
{
	__csrrc(mstatus, 0x08);
	*(word32 *) 5252 = 1107410040;
	g_dw4201BC78 = 0x00;
	__csrrs(mstatus, 0x08);
	return 1107410040;
}

// 2300E602: Register uint32 ke_malloc(Register (ptr32 Eq_47150) a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg38, Register out ptr32 a0Out, Register out Eq_2 a5Out, Register out (ptr32 (ptr32 Eq_48289)) s2Out)
// Called from:
//      ke_msg_alloc
//      ke_timer_set
//      GetTxEAPOLBuffer
//      ipc_emb_msg_evt
//      apm_start_req_handler
uint32 ke_malloc(struct Eq_47150 * a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg38, ptr32 & a0Out, union Eq_2 & a5Out, struct Eq_48289 & s2Out)
{
	uint32 s1_8 = (char *) a0 + 3 & -4;
	if (s1_8 > ~0x02)
	{
		Eq_2 a5_23 = g_t4201BC74;
		__csrrc(mstatus, 0x08);
		union Eq_2 * s0_25 = null;
		while (a5_23 != 0x00)
		{
			union Eq_2 * a5_30 = *((word32) a4 + 4);
			if (a4 >= s1_8 + 0x0C)
			{
				if (s0_25 != null)
				{
					s0_25 = (union Eq_2 *) *((word32) a3 + 4);
					if (a4 >= a3)
						goto l2300E68E;
				}
				s0_25 = a5_30;
			}
l2300E68E:
			a5_23 = *a5_30;
		}
		if (s0_25 != null)
		{
			int32 s0_49 = a0->dw0007;
			struct Eq_47188 * a0_53 = (char *) a0 + 3 - (s1_8 + 4);
			a0_53->dw0004 = s0_49;
			uint32 * a0_55 = a0_53 + s0_49 / 8;
			*a0_55 = s1_8 + 4;
			__csrrs(mstatus, 0x08);
			0x00 = (uint16) dwArg38;
			a0Out = a0_55 + 1;
			a5Out = a5_23;
			s2Out = s1_8 + 4;
			return s1_8 + 0x0C;
		}
		else
			assert_err();
	}
	else
		assert_err();
}

// 2300E696: Register word32 ke_free(Register Eq_2 a0, Register ptr32 mstatus, Register out Eq_2 s1Out, Register out ptr32 a2Out, Register out (ptr32 word32) a3Out, Register out Eq_2 a4Out, Register out Eq_45233 a5Out, Register out (ptr32 Eq_45234) s2Out, Register out (ptr32 Eq_45235) s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      apm_bcn_set
//      ke_msg_send
//      ke_msg_free
//      ke_timer_clear
//      ke_timer_schedule
//      UpdateEAPOLWcbLenAndTransmit
word32 ke_free(Eq_2 a0, ptr32 mstatus, union Eq_2 & s1Out, ptr32 & a2Out, word32 & a3Out, union Eq_2 & a4Out, union Eq_45233 & a5Out, struct Eq_45234 & s2Out, struct Eq_45235 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	Eq_45233 a5_118 = 0x4201C000;
	Eq_2 s0_29 = g_t4201BC74;
	struct Eq_45234 * s2_121 = (word32) a0 - 4;
	struct Eq_45235 * s3_21 = *((word32) a0 - 4);
	if (s0_29 < a0)
	{
		__csrrc(mstatus, 0x08);
		Eq_45233 s4_28 = 0x00;
		while (s0_29 != 0x00)
		{
			Eq_45233 s0_32 = g_t4201C004;
			a4 = (word32) s0_32 + 0x4201C000;
			if ((word32) s0_32 + 0x4201C000 == (word32) a0 - 4)
			{
				Eq_2 s0_54 = *((word32) s0_32 + 0x4201C000);
				s3_21->t4201C004 = s0_54;
				a5_118 = (char *) s3_21 + 0x4201C000;
				a3 = s0_54 + (s3_21 + 0x4201C000);
				if ((word32) s0_32 + 0x4201C000 == a3)
				{
					a5_118 = s3_21 + 0x4201C000 + a3;
					*((word32) a5_118 + 4) = s0_54;
					a4 = *a5_118;
					*a5_118 = s0_54;
				}
				goto l2300E706;
			}
			if ((word32) a0 - 4 < s0_32)
			{
				if (s4_28 == 0x00)
					assert_err();
				*s4_28 = (word32) a0 - 4;
				a5_118 = s3_21 + ((word32) a0 - 4) / 0x4201C008;
				if (s0_32 != a5_118)
				{
					*((word32) a0 + 0x0FFC) = s0_32;
					goto l2300E75C;
				}
				else
				{
					*((word32) a0 + 0x0FFC) = a5_118;
					s2_121 = a5_118 - ((word32) a0 - 4);
					Mem53[Mem49[a5_118 + 4:word32] + s2_121:word32] = a0;
					goto l2300E706;
				}
			}
			s4_28 = s0_32;
			s0_29 = *s0_32;
		}
		*s4_28 = (word32) a0 - 4;
		*((word32) a0 + 0x0FFC) = 0x00;
l2300E75C:
		*a0 = s3_21;
l2300E706:
		__csrrs(mstatus, 0x08);
		s1Out = a0;
		a2Out = dwArg48;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_118;
		s2Out = s2_121;
		s3Out = s3_21;
		s4Out = dwArg04;
		s8Out = s4;
		return s1;
	}
	else
		assert_err();
}

// 2300E768: Register Eq_2 ke_msg_alloc(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out (ptr32 Eq_10976) a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_10980 a4Out, Register out (ptr32 Eq_10981) a5Out, Register out ptr32 a6Out, Register out (ptr32 Eq_10983) s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out (ptr32 Eq_10986) s8Out)
// Called from:
//      mm_sta_del
//      mm_send_connection_loss_ind
//      mm_check_rssi
//      mm_send_csa_traffic_ind
//      mm_bcn_transmit
//      mm_ps_change_ind
//      rxl_cntrl_evt
//      scan_send_cancel_cfm
//      vif_mgmt_switch_channel
//      me_beacon_check
//      rxu_mgt_frame_check
//      rxu_cntrl_frame_handle
//      scanu_confirm
//      scanu_raw_send_cfm
//      scanu_scan_next
//      sm_delete_resources
//      sm_scan_bss
//      sm_join_bss
//      sm_set_bss_param
//      sm_disconnect
//      sm_assoc_done
//      apm_start_cfm
//      apm_set_bss_param
//      apm_stop
//      apm_tx_int_ps_postpone
//      apm_tx_int_ps_get_postpone
//      apm_tx_int_ps_clear
//      apm_sta_add
//      apm_bcn_set
//      apm_assoc_req_handler
//      apm_sta_remove
//      ke_msg_send_basic
//      chan_switch_start
//      chan_bcn_detect_start
//      mm_monitor_channel_req_handler
//      mm_monitor_enable_req_handler
//      mm_remain_on_channel_req_handler
//      mm_sta_add_req_handler
//      mm_key_add_req_handler
//      mm_set_power_req_handler
//      mm_version_req_handler
//      mm_hw_config_handler
//      scan_start_req_handler
//      me_rc_stats_req_handler
//      me_traffic_ind_req_handler
//      me_sta_del_req_handler
//      me_set_control_port_req_handler
//      me_config_req_handler
//      me_set_ps_disable_req_handler
//      me_set_active_req_handler
//      me_sta_add_req_handler
//      scanu_join_cfm_handler
//      sm_connect_req_handler
//      mm_set_vif_state_cfm_handler
//      apm_sta_del_req_handler
//      apm_start_cac_req_handler
//      apm_start_req_handler
//      cfg_start_req_handler
//      dbg_get_sys_stat_req_handler
//      dbg_mem_write_req_handler
//      dbg_mem_read_req_handler
Eq_2 ke_msg_alloc(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, ptr32 & s0Out, union Eq_2 & s1Out, struct Eq_10976 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_10980 & a4Out, struct Eq_10981 & a5Out, ptr32 & a6Out, struct Eq_10983 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, struct Eq_10986 & s8Out)
{
	struct Eq_47326 * a0_27;
	struct Eq_10983 * s2_31;
	word32 a5_89;
	Eq_2 s1_30 = ke_malloc((word32) a3 + 0x0C, a3, a4, mstatus, dwArg18, out a0_27, out a5_89, out s2_31);
	if (a0_27 != null)
	{
		a0_27->w0004 = (word16) a0;
		a0_27->w0006 = (word16) a1;
		a0_27->w0008 = (word16) s2_31;
		a0_27->w000A = (word16) s1_30;
		a0_27->dw0000 = 0x00;
		ptr32 a1_49;
		ptr32 a3_51;
		Eq_10980 a4_52;
		struct Eq_10981 * a5_53;
		word32 t1_90;
		word32 a0_91;
		word32 a2_92;
		Eq_2 ra_54 = memset(ra, &a0_27->w000A + 1, 0x00, s1_30, out t1_90, out a0_91, out a1_49, out a2_92, out a3_51, out a4_52, out a5_53);
		s0Out = s1;
		s1Out = s1_30;
		a0Out = (struct Eq_10976 *) (&a0_27->w000A + 1);
		a1Out = a1_49;
		a2Out = dwArg48;
		a3Out = a3_51;
		a4Out = a4_52;
		a5Out = a5_53;
		a6Out = dwArg28;
		s2Out = s2_31;
		s3Out = a1;
		s4Out = dwArg04;
		s8Out = s4;
		return ra_54;
	}
	else
		assert_err();
}

// 2300E7D4: Register Eq_2 ke_msg_send(Register Eq_2 a0, Register ptr32 mstatus, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_11038) a1Out, Register out Eq_11039 a2Out, Register out Eq_11040 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_11042) a5Out, Register out (ptr32 Eq_11043) s2Out, Register out (ptr32 Eq_11044) s3Out, Register out (ptr32 Eq_11045) s4Out, Register out ptr32 s8Out)
// Called from:
//      mm_sta_del
//      mm_send_connection_loss_ind
//      mm_check_rssi
//      mm_send_csa_traffic_ind
//      mm_bcn_transmit
//      mm_ps_change_ind
//      rxl_cntrl_evt
//      scan_send_cancel_cfm
//      vif_mgmt_switch_channel
//      me_beacon_check
//      rxu_mgt_frame_check
//      rxu_cntrl_frame_handle
//      scanu_confirm
//      scanu_raw_send_cfm
//      scanu_scan_next
//      sm_delete_resources
//      sm_scan_bss
//      sm_join_bss
//      sm_send_next_bss_param
//      sm_disconnect
//      sm_connect_ind
//      sm_assoc_done
//      apm_tx_cfm_handler
//      apm_start_cfm
//      apm_send_next_bss_param
//      apm_stop
//      apm_tx_int_ps_postpone
//      apm_tx_int_ps_get_postpone
//      apm_tx_int_ps_clear
//      apm_sta_add
//      apm_bcn_set
//      apm_sta_remove
//      ke_msg_send_basic
//      ke_msg_forward_and_change_id
//      ipc_emb_msg_evt
//      chan_switch_start
//      chan_bcn_detect_start
//      mm_monitor_channel_req_handler
//      mm_monitor_enable_req_handler
//      mm_remain_on_channel_req_handler
//      mm_sta_add_req_handler
//      mm_key_add_req_handler
//      mm_set_power_req_handler
//      mm_version_req_handler
//      mm_hw_config_handler
//      scan_start_req_handler
//      me_rc_stats_req_handler
//      me_traffic_ind_req_handler
//      me_sta_del_req_handler
//      me_set_control_port_req_handler
//      me_config_req_handler
//      me_set_ps_disable_req_handler
//      me_set_active_req_handler
//      me_sta_add_req_handler
//      scanu_join_cfm_handler
//      sm_connect_req_handler
//      mm_set_vif_state_cfm_handler
//      apm_sta_del_req_handler
//      apm_start_cac_req_handler
//      apm_start_req_handler
//      cfg_start_req_handler
//      dbg_get_sys_stat_req_handler
//      dbg_mem_write_req_handler
//      dbg_mem_read_req_handler
Eq_2 ke_msg_send(Eq_2 a0, ptr32 mstatus, union Eq_2 & s1Out, ptr32 & a0Out, struct Eq_11038 & a1Out, union Eq_11039 & a2Out, union Eq_11040 & a3Out, union Eq_2 & a4Out, struct Eq_11042 & a5Out, struct Eq_11043 & s2Out, struct Eq_11044 & s3Out, struct Eq_11045 & s4Out, ptr32 & s8Out)
{
	Eq_2 a5_11 = (word32) *((word32) a0 - 6);
	if (a5_11 <= 0x0E)
	{
		if (a5_11 > 0x0C)
		{
			bl_rx_e2a_handler(a0, a2);
			Eq_11039 a2_41;
			Eq_2 a4_42;
			struct Eq_11042 * a5_43;
			Eq_2 s1_46;
			struct Eq_11043 * s2_47;
			struct Eq_11044 * s3_48;
			struct Eq_11045 * s4_49;
			ptr32 s8_50;
			Eq_11040 a3_52;
			Eq_2 s0_45 = ke_free((word32) a0 - 0x0C, mstatus, out s1_46, out a2_41, out a3_52, out a4_42, out a5_43, out s2_47, out s3_48, out s4_49, out s8_50);
			s1Out = s1_46;
			a0Out = (word32) a0 - 0x0C;
			a1Out = a1;
			a2Out = a2_41;
			a3Out = a3_52;
			a4Out = a4_42;
			a5Out = a5_43;
			s2Out = s2_47;
			s3Out = s3_48;
			s4Out = s4_49;
			s8Out = s8_50;
			return s0_45;
		}
		else
		{
			Eq_2 s1_20 = co_list_push_back((word32) a0 - 0x0C, a5_11);
			struct Eq_11042 * a5_29;
			Eq_2 a4_28 = ke_evt_set(0x01000000, 0x0C, mstatus, out a5_29);
			s1Out = s1_20;
			a0Out = 0x01000000;
			a1Out = (word32) a0 - 0x0C;
			a2Out = dwArg10;
			a3Out = a3;
			a4Out = a4_28;
			a5Out = a5_29;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			s8Out = s8;
			return s0;
		}
	}
	else
		assert_err();
}

