pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300E83E: Register Eq_2 ke_msg_send_basic(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Register out Eq_2 s0Out, Register out (ptr32 Eq_12347) s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out (ptr32 Eq_12352) s4Out, Register out ptr32 s8Out)
// Called from:
//      mm_tim_update
//      mm_bcn_change
//      ps_enable_cfm
//      ps_disable_cfm
//      ke_timer_schedule
//      chan_tx_cfm
//      chan_ctxt_op_evt
//      mm_set_ps_options_req_handler
//      mm_sta_del_req_handler
//      mm_key_del_req_handler
//      mm_set_idle_req_handler
//      mm_reset_req_handler
//      mm_start_req_handler
//      mm_set_ps_mode_req_handler
//      mm_hw_config_handler
//      mm_scan_channel_end_ind_handler
//      me_traffic_ind_req_handler
//      me_sta_del_req_handler
//      me_set_control_port_req_handler
//      me_chan_config_req_handler
//      mm_set_ps_mode_cfm_handler
//      mm_set_idle_cfm_handler
//      me_config_req_handler
//      me_set_ps_disable_req_handler
//      me_set_active_req_handler
//      sm_disconnect_req_handler
//      apm_stop_cac_req_handler
//      apm_conf_max_sta_req_handler
//      apm_stop_req_handler
//      dbg_set_sev_filter_req_handler
//      dbg_set_mod_filter_req_handler
Eq_2 ke_msg_send_basic(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, union Eq_2 & s0Out, struct Eq_12347 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s3Out, struct Eq_12352 & s4Out, ptr32 & s8Out)
{
	Eq_2 a0_11;
	word32 s0_57;
	word32 s1_58;
	word32 a1_59;
	word32 a2_60;
	word32 a3_61;
	word32 a4_62;
	word32 a5_63;
	word32 a6_64;
	word32 s2_65;
	word32 s3_66;
	word32 s4_67;
	word32 s8_68;
	Eq_2 ra_18 = ke_msg_alloc(ra, a0, a1, 0x00, a4, mstatus, dwArg08, out s0_57, out s1_58, out a0_11, out a1_59, out a2_60, out a3_61, out a4_62, out a5_63, out a6_64, out s2_65, out s3_66, out s4_67, out s8_68);
	ptr32 a0_31;
	ptr32 a3_33;
	struct Eq_12347 * s1_38;
	ptr32 s2_39;
	ptr32 s3_40;
	struct Eq_12352 * s4_41;
	ptr32 s8_42;
	word32 a1_69;
	word32 a2_70;
	word32 a4_71;
	word32 a5_72;
	s0Out = ke_msg_send(a0_11, mstatus, out s1_38, out a0_31, out a1_69, out a2_70, out a3_33, out a4_71, out a5_72, out s2_39, out s3_40, out s4_41, out s8_42);
	s1Out = s1_38;
	a0Out = a0_31;
	a3Out = a3_33;
	s2Out = s2_39;
	s3Out = s3_40;
	s4Out = s4_41;
	s8Out = s8_42;
	return ra_18;
}

// 2300E850: void ke_msg_forward_and_change_id(Register Eq_2 a0, Register (ptr32 byte) a1, Register (ptr32 Eq_34770) a2, Register (ptr32 byte) a3, Register ptr32 mstatus)
// Called from:
//      rxu_mgt_ind_handler
void ke_msg_forward_and_change_id(Eq_2 a0, byte * a1, struct Eq_34770 * a2, byte * a3, ptr32 mstatus)
{
	*((word32) a0 + 0x0FF8) = (word16) a1;
	*((word32) a0 + 0x0FFA) = (word16) a2;
	*((word32) a0 + 0x0FFC) = (word16) a3;
	word32 s1_26;
	word32 a0_27;
	word32 a1_28;
	word32 a2_29;
	word32 a3_30;
	word32 a4_31;
	word32 a5_32;
	word32 s2_33;
	word32 s3_34;
	word32 s4_35;
	word32 s8_36;
	ke_msg_send(a0, mstatus, out s1_26, out a0_27, out a1_28, out a2_29, out a3_30, out a4_31, out a5_32, out s2_33, out s3_34, out s4_35, out s8_36);
}

// 2300E860: Register Eq_2 ke_msg_free(Register Eq_2 a0, Register ptr32 mstatus, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s4Out)
// Called from:
//      mm_tim_update
//      mm_bcn_change
//      scanu_confirm
//      sm_connect_ind
//      apm_tx_cfm_handler
//      apm_start_cfm
//      ke_task_schedule
//      mm_scan_channel_end_ind_handler
Eq_2 ke_msg_free(Eq_2 a0, ptr32 mstatus, ptr32 & s1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s4Out)
{
	ptr32 a4_6;
	ptr32 a5_7;
	ptr32 s1_10;
	ptr32 s2_11;
	ptr32 s4_13;
	ptr32 a3_16;
	word32 a2_23;
	word32 s3_24;
	word32 s8_25;
	Eq_2 s0_9 = ke_free(a0, mstatus, out s1_10, out a2_23, out a3_16, out a4_6, out a5_7, out s2_11, out s3_24, out s4_13, out s8_25);
	s1Out = s1_10;
	a3Out = a3_16;
	a4Out = a4_6;
	a5Out = a5_7;
	s2Out = s2_11;
	s4Out = s4_13;
	return s0_9;
}

// 2300E864: void cmp_dest_id()
void cmp_dest_id()
{
}

// 2300E870: Register Eq_2 ke_task_local(Register Eq_2 a0)
// Called from:
//      mm_back_to_host_idle
//      ke_state_get
//      ke_task_schedule
Eq_2 ke_task_local(Eq_2 a0)
{
	if (a0 <= 0x0E)
		return (word32) (a0 < 0x0D);
	assert_err();
}

// 2300E8A2: Register ui32 ke_handler_search(Register ptr32 a0, Register Eq_47572 a1, Register Eq_47572 a4, Register out ptr32 a0Out, Register out Eq_47572 a1Out, Register out Eq_47572 a4Out)
// Called from:
//      ke_task_schedule
ui32 ke_handler_search(ptr32 a0, Eq_47572 a1, Eq_47572 a4, ptr32 & a0Out, union Eq_47572 & a1Out, union Eq_47572 & a4Out)
{
	word32 a5_5 = (word32) *((word32) a1 + 4);
	struct Eq_47582 * a5_18 = a5_5 + ~0x00;
	if (a5_5 != 0x00)
	{
		do
		{
			ui32 s1_19 = a5_18 << 0x03;
			a4 = (word32) a4 + s1_19;
			Eq_47572 a1_17 = *a4;
			if ((word32) *a4 == a0)
			{
				a4 = a5_18[4];
				if (a5_18 != null)
					goto l2300E8F8;
				assert_err();
			}
			a5_18 = (struct Eq_47582 *) ((char *) a5_18 - 1);
		} while (a5_18 != (struct Eq_47582 *) ~0x00);
		a0 = 0x00;
l2300E8F8:
		a0Out = a0;
		a1Out = a1_17;
		a4Out = a4;
		return s1_19;
	}
	else
	{
		a0Out = 0x00;
		a1Out = a1;
		a4Out = a4;
		return s1;
	}
}

// 2300E902: Register Eq_2 ke_state_set(Register Eq_2 a0, Register Eq_2 a1, Register ptr32 mstatus, Register out Eq_2 s1Out, Register out Eq_8713 a0Out, Register out Eq_2 a1Out, Register out Eq_8715 a4Out, Register out Eq_2 a5Out, Register out (ptr32 Eq_8717) s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out)
// Called from:
//      mm_reset
//      mm_hw_idle_evt
//      mm_back_to_host_idle
//      mm_force_idle_req
//      scan_init
//      scan_set_channel_request
//      me_init
//      scanu_confirm
//      scanu_init
//      scanu_start
//      sm_init
//      sm_scan_bss
//      sm_join_bss
//      sm_set_bss_param
//      sm_disconnect
//      sm_connect_ind
//      sm_auth_send
//      sm_assoc_req_send
//      sm_assoc_done
//      apm_init
//      apm_start_cfm
//      apm_set_bss_param
//      apm_bcn_set
//      mm_set_idle_req_handler
//      mm_reset_req_handler
//      mm_start_req_handler
//      mm_force_idle_req_handler
//      mm_hw_config_handler
//      mm_scan_channel_end_ind_handler
//      mm_scan_channel_start_ind_handler
//      bam_init
//      mm_set_ps_mode_cfm_handler
//      mm_set_idle_cfm_handler
//      me_config_req_handler
//      me_set_ps_disable_req_handler
//      me_set_active_req_handler
//      mm_connection_loss_ind_handler
//      scanu_join_cfm_handler
//      sm_connect_req_handler
//      rxu_mgt_ind_handler
//      me_set_active_cfm_handler
Eq_2 ke_state_set(Eq_2 a0, Eq_2 a1, ptr32 mstatus, union Eq_2 & s1Out, union Eq_8713 & a0Out, union Eq_2 & a1Out, union Eq_8715 & a4Out, union Eq_2 & a5Out, struct Eq_8717 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out)
{
	if ((a0 & 0x00FF) <= 0x0D)
	{
		ke_task_local(a0);
		Eq_8713 a0_107 = a0 & 0x00FF;
		if ((a0 & 0x00FF) != 0x00)
		{
			Eq_2 s1_112 = (a0 & 0x00FF) << 4;
			Eq_8715 a4_38 = (word32) *((word32) s1_112 + 587684754);
			if (a0 >> 0x08 < a4_38)
			{
				struct Eq_8717 * s2_113 = a0 >> 0x08 << 1;
				if (s2_113 != &g_t23075B84)
				{
					Eq_2 a5_53 = (word32) s2_113->w23075B84;
					if (a5_53 != a1)
					{
						s2_113->w23075B84 = (word16) a1;
						s1_112.u0 = 0x2300F000;
						s2_113 = &g_t4201C000;
						while (true)
						{
							// Failed to bind call argument.
							// Please report this issue at https://github.com/uxmal/reko
							Eq_2 stackArg296 = <invalid>;
							word32 s0_128;
							word32 s1_129;
							word32 a0_130;
							word32 s2_131;
							ke_queue_extract(ra, s0, a1, a2, stackArg296, out s0_128, out s1_129, out a0_130, out s2_131);
							a0_107.u0 = 1107410020;
							a1.u0 = 1107410020;
							if (false)
								break;
							__csrrc(mstatus, 0x08);
							s1_112 = co_list_push_back(1107410020, a5_53);
							__csrrs(mstatus, 0x08);
							word32 a5_133;
							ke_evt_set(a0, a4, mstatus, out a5_133);
						}
					}
					s1Out = s1_112;
					a0Out = a0_107;
					a1Out = a1;
					a4Out = a4_38;
					a5Out = a5_53;
					s2Out = s2_113;
					s3Out = a0;
					s4Out = dwArg04;
					return s1;
				}
				else
					assert_err();
			}
			else
				assert_err();
		}
		else
			assert_err();
	}
	else
		assert_err();
}

// 2300EA02: Register word32 ke_state_get(Register Eq_2 a0, Stack Eq_2 dwArg38, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out Eq_8743 a4Out, Register out (ptr32 uint16) s2Out)
// Called from:
//      mm_reset
//      mm_back_to_host_idle
//      rxu_mgt_frame_check
//      sm_frame_tx_cfm_handler
//      mm_set_idle_req_handler
//      mm_start_req_handler
//      mm_force_idle_req_handler
//      mm_hw_config_handler
//      bl_sleep
//      scan_cancel_req_handler
//      scan_start_req_handler
//      mm_scan_channel_end_ind_handler
//      mm_scan_channel_start_ind_handler
//      mm_set_ps_mode_cfm_handler
//      mm_set_idle_cfm_handler
//      me_set_ps_disable_req_handler
//      me_set_active_req_handler
//      rxu_mgt_ind_handler
//      me_set_ps_disable_cfm_handler
//      mm_bss_param_setting_handler
//      sm_rsp_timeout_ind_handler
//      scanu_start_cfm_handler
//      mm_connection_loss_ind_handler
//      scanu_join_cfm_handler
//      sm_connect_req_handler
//      rxu_mgt_ind_handler
//      mm_set_vif_state_cfm_handler
//      me_set_active_cfm_handler
//      mm_sta_add_cfm_handler
//      sm_disconnect_req_handler
//      apm_stop_cac_req_handler
//      apm_start_cac_req_handler
//      me_set_ps_disable_cfm_handler
//      mm_bss_param_setting_handler
//      mm_bcn_change_cfm_handler
//      apm_stop_req_handler
//      apm_start_req_handler
//      me_set_active_cfm_handler
//      hostapd_mgt_ind_handler
word32 ke_state_get(Eq_2 a0, Eq_2 dwArg38, ptr32 & a0Out, ptr32 & a2Out, union Eq_8743 & a4Out, uint16 & s2Out)
{
	if ((a0 & 0x00FF) <= 0x0D)
	{
		if (ke_task_local(a0 & 0x00FF) != 0x00)
		{
			Eq_8743 a4_34 = (word32) ((char *) &g_t23075B84 + 0x0E)[(a0 & 0x00FF) * 0x10];
			if (a0 >> 0x08 < a4_34)
			{
				struct Eq_47729 * s2_44 = a0 >> 0x08 << 1;
				ptr32 a0_46 = (word32) s2_44->w23076000;
				0x00 = (uint16) dwArg38;
				a0Out = a0_46;
				a2Out = dwArg10;
				a4Out = a4_34;
				s2Out = &s2_44->w23076000;
				return 587684740;
			}
			else
				assert_err();
		}
		else
			assert_err();
	}
	else
		assert_err();
}

// 2300EA9A: void ke_task_schedule(Register word32 ra, Register Eq_47572 a1, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus)
void ke_task_schedule(word32 ra, Eq_47572 a1, Eq_2 a4, Eq_2 a5, ptr32 mstatus)
{
	__csrrc(mstatus, 0x08);
	word32 a5_245;
	Eq_2 a0_21 = co_list_pop_front(a4, a5, out a5_245);
	__csrrs(mstatus, 0x08);
	if (a0_21 == 0x00)
	{
l2300EB68:
		__csrrc(mstatus, 0x08);
		if (g_dw4201BC5C == 0x00)
			ke_evt_clear(0x01000000, a4, mstatus);
		__csrrs(mstatus, 0x08);
		return;
	}
	uint32 s2_23 = (word32) *((word32) a0_21 + 6);
	Eq_2 s0_116 = a0_21;
	ptr32 s4_27 = (word32) *((word32) a0_21 + 4);
	uint32 s2_104 = s2_23 >> 0x08;
	if ((s2_23 & 0x00FF) > 0x0D)
		assert_err();
	if (ke_task_local(s2_23 & 0x00FF) == 0x00)
		assert_err();
	struct Eq_47800 * s3_45 = (s2_23 & 0x00FF) << 4;
	Eq_47572 a4_111 = (word32) s3_45->w23075B92;
	if (s2_23 >> 0x08 >= a4_111)
		assert_err();
	if (s3_45 == &g_t23075B84)
		assert_err();
	word32 s1_103;
	<anonymous> * a5_100;
	if (a1 != 0x00)
	{
		struct Eq_47823 * s2_63 = s2_23 >> 0x08 << 1;
		s2_104 = &s2_63->w23076000;
		<anonymous> * a0_69;
		s1_103 = ke_handler_search(s4_27, (word32) a1 + ((word32) s2_63->w23076000 << 3), a4_111, out a0_69, out a1, out a4_111);
		a5_100 = a0_69;
		if (a0_69 != null)
			goto l2300EBAA;
	}
	if (a1 == 0x00)
		goto l2300EB62;
	<anonymous> * a0_84;
	word32 a1_246;
	s1_103 = ke_handler_search(s4_27, a1, a4_111, out a0_84, out a1_246, out a4_111);
	a5_100 = a0_84;
	if (a0_84 == null)
	{
l2300EB62:
		word32 s2_250;
		word32 s4_251;
		word32 s1_247;
		word32 a5_249;
		word32 a3_248;
		ke_msg_free(s0_116, mstatus, out s1_247, out a3_248, out a4, out a5_249, out s2_250, out s4_251);
		goto l2300EB68;
	}
l2300EBAA:
	word32 a0_122;
	word32 tp_131;
	a5_100();
	if (a0_122 != 0x01)
	{
		if (a0_122 != 0x02)
		{
			if (a0_122 != 0x00)
				assert_err();
			goto l2300EB62;
		}
		co_list_push_back(s0_116, 0x02);
	}
	goto l2300EB68;
}

// 2300EC00: void ke_msg_discard()
void ke_msg_discard()
{
}

// 2300EC04: void ke_msg_save()
void ke_msg_save()
{
}

// 2300EC08: Register Eq_2 ke_timer_hw_set(Register int32 a0, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a5Out)
// Called from:
//      ke_timer_set
//      ke_timer_clear
//      ke_timer_schedule
Eq_2 ke_timer_hw_set(int32 a0, Eq_2 a4, ptr32 mstatus, union Eq_2 & a5Out)
{
	Eq_2 a5_14;
	__csrrc(mstatus, 0x08);
	if (a0 != 0x00)
	{
		*(union Eq_2 *) 0x44B00148 = a4;
		a5_14 = *(union Eq_2 *) 0x44B0808C;
		if ((a5_14 & 0x0100) != 0x00)
			goto l2300EC36;
		((union Eq_13963 *) 0x44B08088)->u0 = 0x0100;
		a5_14 |= 0x0100;
	}
	else
		a5_14 = *(union Eq_2 *) 0x44B0808C & -0x0101;
	*(union Eq_2 *) 0x44B0808C = a5_14;
l2300EC36:
	__csrrs(mstatus, 0x08);
	a5Out = a5_14;
	return 0x44B08000;
}

// 2300EC4A: void cmp_abs_time()
void cmp_abs_time()
{
}

