pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300EC62: void cmp_timer_id(Register (ptr32 Eq_47914) a0, Register uint32 a1)
void cmp_timer_id(struct Eq_47914 * a0, uint32 a1)
{
	if ((word32) a0->w0004 != a1 >> 0x10)
		;
}

// 2300EC82: Register word32 ke_timer_set(Register Eq_2 ra, Register Eq_2 a0, Register ui32 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArgA8, Stack Eq_2 dwArg0108)
// Called from:
//      sm_auth_send
//      sm_assoc_req_send
//      apm_start_cfm
//      apm_sta_connect_timeout_ind_handler
word32 ke_timer_set(Eq_2 ra, Eq_2 a0, ui32 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArgA8, Eq_2 dwArg0108)
{
	if (a2 != 0x00 && a2 <= 299999999)
	{
		struct Eq_47126 * a5_40 = g_ptr4201BC6C;
		if (a5_40 != null)
			a4 = (word32) a5_40->w0004;
		Eq_2 a0_59;
		word32 s0_61;
		word32 s1_243;
		word32 s2_244;
		Eq_2 ra_69 = ke_queue_extract(ra, a2, 0x2300EC62, a0 << 0x10 | a1, dwArg0108, out s0_61, out s1_243, out a0_59, out s2_244);
		Eq_2 s1_70 = a0_59;
		if (a0_59 == 0x00)
		{
			Eq_2 a0_78;
			word32 s2_246;
			word32 a5_245;
			ke_malloc((struct Eq_47150 *) 0x0C, a3, a4, mstatus, dwArg18, out a0_78, out a5_245, out s2_246);
			s1_70 = a0_78;
			if (a0_78 == 0x00)
				assert_err();
			*((word32) a0_78 + 4) = (word16) a0;
			*((word32) a0_78 + 6) = (word16) a1;
		}
		Eq_2 s0_98 = (word32) *(union Eq_2 *) 0x44B00120 + s0_61;
		*((word32) s0_98 + 8) = s1_70;
		int32 s1_109;
		word32 s2_110;
		struct Eq_47967 * s3_111;
		int32 s0_108 = co_list_insert(ra_69, s0_98, s1_70, &g_t2300EC4A, dwArg0108, out s1_109, out s2_110, out s3_111);
		if (s2_110 != 0x00 || s3_111->dw0014 == s1_109)
		{
			word32 a5_247;
			a4 = ke_timer_hw_set(s3_111->dw0014, a4, mstatus, out a5_247);
		}
		if (s0_108 - *((union Eq_2 *) 0x44B00120) >= 0x00)
		{
			0x00 = (uint16) dwArgA8;
			return;
		}
		else
		{
			0x00 = (uint16) dwArgA8;
			word32 a5_248;
			ke_evt_set(0x04000000, a4, mstatus, out a5_248);
			return;
		}
	}
	else
		assert_err();
}

// 2300EDB6: Register Eq_2 ke_timer_clear(Register Eq_2 ra, Register Eq_2 s0, Register ui32 a0, Register Eq_2 a1, Register ptr32 mstatus, Stack Eq_2 dwArg0118, Register out Eq_2 s0Out, Register out (ptr32 Eq_40094) s1Out, Register out ptr32 a3Out, Register out ptr32 s2Out)
// Called from:
//      sm_auth_handler
//      sm_assoc_rsp_handler
//      apm_stop
Eq_2 ke_timer_clear(Eq_2 ra, Eq_2 s0, ui32 a0, Eq_2 a1, ptr32 mstatus, Eq_2 dwArg0118, union Eq_2 & s0Out, struct Eq_40094 & s1Out, ptr32 & a3Out, ptr32 & s2Out)
{
	struct Eq_40094 * s1_11 = *((word32) s0 + 20);
	if (s0 != 0x00)
	{
		if ((word32) *((word32) s0 + 4) == a0)
		{
			Eq_2 a4_15 = (word32) *((word32) s0 + 6);
			if (a4_15 == a1)
			{
				word32 a5_155;
				co_list_pop_front(a4_15, 0x4201C000, out a5_155);
				int32 s1_50 = s1_11->dw0014;
				word32 a5_156;
				ke_timer_hw_set(s1_50, a4_15, mstatus, out a5_156);
				if (s1_50 != 0x00 && *((union Eq_2 *) 0x44B00120) > 0x44B00000)
					assert_err();
l2300EE18:
				word32 a2_157;
				struct Eq_40094 * s1_81;
				ptr32 s2_82;
				ptr32 a3_87;
				word32 a4_158;
				word32 a5_159;
				word32 s3_160;
				word32 s4_161;
				word32 s8_162;
				s0Out = ke_free(s0, mstatus, out s1_81, out a2_157, out a3_87, out a4_158, out a5_159, out s2_82, out s3_160, out s4_161, out s8_162);
				s1Out = s1_81;
				a3Out = a3_87;
				s2Out = s2_82;
				return ra;
			}
		}
		Eq_2 a0_29;
		word32 s0_154;
		ra = ke_queue_extract(ra, s0, 0x2300EC62, a0 << 0x10 | a1, dwArg0118, out s0_154, out s1_11, out a0_29, out s2);
		s0 = a0_29;
		if (a0_29 != 0x00)
			goto l2300EE18;
	}
	s0Out = s0;
	s1Out = s1_11;
	a3Out = a3;
	s2Out = s2;
	return ra;
}

// 2300EE4A: void ke_timer_schedule(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus)
void ke_timer_schedule(Eq_2 ra, Eq_2 s0, Eq_2 a4, Eq_2 s2, ptr32 mstatus)
{
	struct Eq_48101 * s2_16 = (struct Eq_48101 *) 0x44B00000;
	while (true)
	{
		Eq_2 a5_22 = ke_evt_clear(0x04000000, a4, mstatus);
		if (s0 == 0x00)
			break;
		Eq_2 a4_27 = s2_16->dw0120;
		int32 a5_29 = a5_22 - a4_27;
		int32 s0_28 = *((word32) a5_22 + 8);
		Eq_2 a5_30 = a5_29 + -50;
		if (a5_29 >= ~0x31)
		{
			word32 a5_33;
			ke_timer_hw_set(s0_28, a4_27, mstatus, out a5_33);
			a4_27 = s2_16->dw0120;
			a5_30 = a5_33 - a4_27;
			if (a5_30 >= 0x00)
				return;
		}
		word32 a5_156;
		Eq_2 a0_51 = co_list_pop_front(a4_27, a5_30, out a5_156);
		word32 s3_161;
		Eq_2 s0_70;
		word32 s4_162;
		word32 s2_160;
		word32 a3_159;
		word32 a0_158;
		word32 s1_157;
		word32 s8_163;
		ra = ke_msg_send_basic(ra, (word32) *((word32) a0_51 + 4), (word32) *((word32) a0_51 + 6), a4_27, mstatus, s2, out s0_70, out s1_157, out a0_158, out a3_159, out s2_160, out s3_161, out s4_162, out s8_163);
		word32 s1_164;
		word32 a2_165;
		word32 a3_166;
		word32 a5_167;
		word32 s3_168;
		word32 s4_169;
		word32 s8_170;
		s0 = ke_free(s0_70, mstatus, out s1_164, out a2_165, out a3_166, out a4, out a5_167, out s2_16, out s3_168, out s4_169, out s8_170);
	}
	word32 a5_155;
	ke_timer_hw_set(0x00, a4, mstatus, out a5_155);
}

// 2300EED6: Register Eq_2 bl60x_current_time_us(Register ptr32 a0, Register out (ptr32 Eq_10035) a5Out)
// Called from:
//      mm_check_rssi
Eq_2 bl60x_current_time_us(ptr32 a0, struct Eq_10035 & a5Out)
{
	Eq_2 a4_5 = *(union Eq_2 *) 0x44B080A4;
	struct Eq_10035 * a5_6 = *(struct Eq_10035 **) 0x44B080A8;
	*a4_5 = a0;
	a5_6->ptr0004 = a0;
	a5Out = a5_6;
	return a4_5;
}

// 2300EEE8: Register Eq_2 mac_ie_find(Register Eq_2 a0, Register (ptr32 byte) a1, Register Eq_18220 a2, Register out Eq_18220 a5Out)
// Called from:
//      scan_search_ds
//      me_beacon_check
//      apm_probe_req_handler
//      apm_assoc_req_handler
//      me_extract_rate_set
//      me_extract_power_constraint
//      me_extract_country_reg
//      me_extract_mobility_domain
//      me_extract_csa
//      rxu_mgt_ind_handler
//      bl_rx_scanu_result_ind
Eq_2 mac_ie_find(Eq_2 a0, byte * a1, Eq_18220 a2, union Eq_18220 & a5Out)
{
	word32 a1_5 = a1 + a0;
	while (a0 < a1_5)
	{
		a5 = (word32) *a0;
		if (a5 == a2)
			goto l2300EEF0;
		word32 a5_11 = (word32) *((word16) a0.u0 + 1);
		a5 = a5_11 + 0x02;
		a0 = (word16) a0.u0 + (a5_11 + 0x02);
	}
	a0.u0 = 0x00;
l2300EEF0:
	a5Out = a5;
	return a0;
}

// 2300EF04: Register Eq_2 mac_vsie_find(Register Eq_2 a0, Register (ptr32 byte) a1, Register (ptr32 Eq_34770) a2, Register (ptr32 byte) a3, Register out Eq_2 a0Out, Register out (ptr32 Eq_34770) a2Out, Register out Eq_34834 a4Out, Register out ptr32 s4Out)
// Called from:
//      apm_assoc_req_handler
//      rxu_mgt_ind_handler
//      bl_rx_scanu_result_ind
Eq_2 mac_vsie_find(Eq_2 a0, byte * a1, struct Eq_34770 * a2, byte * a3, union Eq_2 & a0Out, struct Eq_34770 & a2Out, union Eq_34834 & a4Out, ptr32 & s4Out)
{
	word32 a1_5 = a1 + a0;
	while (a0 < a1_5)
	{
		if ((word32) *a0 == 0x00DD)
		{
			ptr32 a6_12 = (word32) a0 + 2;
			byte * a5_13 = null;
			do
			{
				if (a3 == a5_127)
				{
					a0Out = a0;
					a2Out = a2;
					a4Out.u0 = 0x00DD;
					s4Out = s4;
					return s1;
				}
				a5_13 = a5_127 + 1;
				a5_127 = a5_13;
			} while (CONVERT(Mem0[a2 + a5_13 + -1:byte], byte, word32) == CONVERT(Mem0[a6_12 + a5_127:byte], byte, word32));
		}
		a0 = (word32) a0 + ((word32) (*((word32) a0 + 1)) + 0x02);
	}
	if (a0 == a1_5)
	{
		a0Out.u0 = 0x00;
		a2Out = a2;
		a4Out.u0 = 0x00DD;
		s4Out = s4;
		return s1;
	}
	else
	{
		Eq_34834 a4_47;
		ptr32 s4_49;
		word32 a2_124;
		word32 s8_126;
		word32 a5_125;
		word32 a1_123;
		word32 a0_122;
		Eq_2 s1_48 = puts(587685196, out a0_122, out a1_123, out a2_124, out a4_47, out a5_125, out s4_49, out s8_126);
		a0Out.u0 = 0x00;
		a2Out = dwArg10;
		a4Out = a4_47;
		s4Out = s4_49;
		return s1_48;
	}
}

