pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300EF62: Register Eq_2 GetTxEAPOLBuffer(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg0158, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_48289) a5Out, Register out ptr32 s5Out)
// Called from:
//      GeneratePWKMsg2
//      GenerateGrpMsg2
//      GeneratePWKMsg4
//      PrepDefaultEapolMsg
Eq_2 GetTxEAPOLBuffer(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg0158, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a4Out, struct Eq_48289 & a5Out, ptr32 & s5Out)
{
	Eq_2 s1_156;
	Eq_2 s0_102;
	word32 s3_38;
	word32 s1_183;
	word32 a2_184;
	word32 a6_185;
	word32 s4_186;
	word32 s6_187;
	word32 s7_188;
	word32 s8_189;
	struct Eq_48289 ** s2_37;
	struct Eq_48289 * a5_151;
	ptr32 s5_162;
	if (dbg_test_print(&g_b23075D64, dwArg0158, out s1_183, out a2_184, out a5_151, out a6_185, out s2_37, out s3_38, out s4_186, out s5_162, out s6_187, out s7_188, out s8_189) == 0x00)
	{
		Eq_2 a0_46;
		word32 s2_198;
		s1_156 = ke_malloc((struct Eq_47150 *) 0x0C, a3, a4, mstatus, dwArg18, out a0_46, out a5_151, out s2_198);
		if (a0_46 == 0x00)
		{
l2300EFA4:
			s0_102.u0 = 0x00;
l2300EFA6:
			s1Out = s1_156;
			a0Out = s0_102;
			a4Out = a4;
			a5Out = a5_151;
			s5Out = s5_162;
			return ra;
		}
		Eq_2 a3_58;
		word32 t1_199;
		word32 a0_200;
		word32 a1_201;
		word32 a2_202;
		word32 a5_203;
		ra = memset(ra, a0_46, 0x00, 0x0C, out t1_199, out a0_200, out a1_201, out a2_202, out a3_58, out a4, out a5_203);
		struct Eq_48392 * a0_65;
		s1_156 = ke_malloc((struct Eq_47150 *) 0x0200, a3_58, a4, mstatus, dwArg18, out a0_65, out a5_151, out s2_37);
		a0_65->t0008 = a0_46;
		if (a0_65 == null)
			goto l2300EFA4;
	}
	*a5_151->ptr0008 = s3_38;
	*s2_37 = (struct Eq_48289 **) a5_151;
	word32 a2_190;
	word32 a6_191;
	word32 s2_192;
	word32 s3_193;
	word32 s4_194;
	word32 s6_195;
	word32 s7_196;
	word32 s8_197;
	s0_102 = dbg_test_print(&g_b23075D78, dwArg0158, out s1_156, out a2_190, out a5_151, out a6_191, out s2_192, out s3_193, out s4_194, out s5_162, out s6_195, out s7_196, out s8_197);
	goto l2300EFA6;
}

// 2300EFF6: Register Eq_2 UpdateEAPOLWcbLenAndTransmit(Register Eq_2 ra, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg54, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out ptr32 a4Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s7Out, Register out ptr32 s10Out)
// Called from:
//      GeneratePWKMsg2
//      GenerateGrpMsg2
//      GeneratePWKMsg4
//      GeneratePWKMsg1
//      GeneratePWKMsg3
Eq_2 UpdateEAPOLWcbLenAndTransmit(Eq_2 ra, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg54, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s1Out, ptr32 & a4Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s7Out, ptr32 & s10Out)
{
	struct Eq_48423 * a5_29;
	word32 s4_33;
	word32 s1_156;
	word32 a2_157;
	word32 a6_158;
	word32 s2_159;
	word32 s3_160;
	word32 s5_161;
	word32 s6_162;
	word32 s7_163;
	word32 s8_164;
	dbg_test_print(&g_b23075D64, dwArg0158, out s1_156, out a2_157, out a5_29, out a6_158, out s2_159, out s3_160, out s4_33, out s5_161, out s6_162, out s7_163, out s8_164);
	Eq_2 a0_53;
	ptr32 s10_79;
	Eq_2 ra_61 = txl_frame_send_eapol_frame(ra, (word32) a5_29->b0001, null, s4_33 + 4, fflags, frm, mstatus, dwLoc08, dwArg28, dwArg54, dwArg5C, dwArg78, dwArg98, dwArgB8, out a0_53, out s10_79);
	ptr32 a4_95;
	word32 s1_165;
	word32 a2_166;
	word32 a3_167;
	word32 a4_168;
	word32 a5_169;
	word32 s2_170;
	word32 s3_171;
	word32 s4_172;
	word32 s8_173;
	word32 s1_174;
	word32 a2_175;
	word32 a3_176;
	word32 a5_177;
	word32 s2_178;
	word32 s3_179;
	word32 s4_180;
	word32 s8_181;
	ke_free(ke_free(a0_53, mstatus, out s1_165, out a2_166, out a3_167, out a4_168, out a5_169, out s2_170, out s3_171, out s4_172, out s8_173), mstatus, out s1_174, out a2_175, out a3_176, out a4_95, out a5_177, out s2_178, out s3_179, out s4_180, out s8_181);
	ptr32 s1_122;
	ptr32 s3_128;
	ptr32 s5_129;
	ptr32 s7_131;
	word32 a2_182;
	word32 a5_183;
	word32 a6_184;
	word32 s2_185;
	word32 s4_186;
	word32 s6_187;
	word32 s8_188;
	dbg_test_print(&g_b23075D78, dwArg0178, out s1_122, out a2_182, out a5_183, out a6_184, out s2_185, out s3_128, out s4_186, out s5_129, out s6_187, out s7_131, out s8_188);
	s1Out = s1_122;
	a4Out = a4_95;
	s3Out = s3_128;
	s5Out = s5_129;
	s7Out = s7_131;
	s10Out = s10_79;
	return ra_61;
}

// 2300F074: Register word32 keyMgmtProcessMsgExt(Stack Eq_2 dwArg38, Stack Eq_2 dwArg0168, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out ptr32 s7Out)
// Called from:
//      ProcessRxEAPOL_PwkMsg3
//      ProcessRxEAPOL_GrpMsg1
word32 keyMgmtProcessMsgExt(Eq_2 dwArg38, Eq_2 dwArg0168, ptr32 & a0Out, ptr32 & s2Out, ptr32 & s7Out)
{
	word32 s1_69;
	word32 a2_70;
	word32 a5_71;
	word32 a6_72;
	word32 s2_73;
	word32 s3_74;
	word32 s4_75;
	word32 s5_76;
	word32 s6_77;
	word32 s7_78;
	word32 s8_79;
	dbg_test_print(&g_b23075D64, dwArg0168, out s1_69, out a2_70, out a5_71, out a6_72, out s2_73, out s3_74, out s4_75, out s5_76, out s6_77, out s7_78, out s8_79);
	word32 s1_43;
	ptr32 s2_48;
	ptr32 s7_52;
	word32 a2_80;
	word32 a5_81;
	word32 a6_82;
	word32 s3_83;
	word32 s4_84;
	word32 s5_85;
	word32 s6_86;
	word32 s8_87;
	dbg_test_print(&g_b23075D78, dwArg0168, out s1_43, out a2_80, out a5_81, out a6_82, out s2_48, out s3_83, out s4_84, out s5_85, out s6_86, out s7_52, out s8_87);
	0x00 = (uint16) dwArg38;
	a0Out = 0x01;
	s2Out = s2_48;
	s7Out = s7_52;
	return s1_43;
}

// 2300F0C8: Register word32 KeyMgmtInitSta(Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s2Out, Register out ptr32 s5Out)
// Called from:
//      supplicantInitSession
word32 KeyMgmtInitSta(Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s2Out, ptr32 & s5Out)
{
	word32 s1_96;
	word32 a2_97;
	word32 a5_98;
	word32 a6_99;
	word32 s2_100;
	word32 s3_101;
	word32 s4_102;
	word32 s5_103;
	word32 s6_104;
	word32 s7_105;
	word32 s8_106;
	dbg_test_print(&g_b23075D64, dwArg0158, out s1_96, out a2_97, out a5_98, out a6_99, out s2_100, out s3_101, out s4_102, out s5_103, out s6_104, out s7_105, out s8_106);
	word32 s2_107;
	KeyMgmtSta_InitSession(dwArg0138, dwArg0158, out s2_107);
	ptr32 s2_76;
	ptr32 s5_78;
	word32 s1_108;
	word32 a2_109;
	word32 a5_110;
	word32 a6_111;
	word32 s3_112;
	word32 s4_113;
	word32 s6_114;
	word32 s7_115;
	word32 s8_116;
	dbg_test_print(&g_b23075D78, dwArg0178, out s1_108, out a2_109, out a5_110, out a6_111, out s2_76, out s3_112, out s4_113, out s5_78, out s6_114, out s7_115, out s8_116);
	s2Out = s2_76;
	s5Out = s5_78;
	return 587685240;
}

