pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300F12A: void keyMgmtSta_StartSession(Register ptr32 mstatus, Stack word32 dwArgA8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178)
// Called from:
//      supplicantInitSession
void keyMgmtSta_StartSession(ptr32 mstatus, word32 dwArgA8, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178)
{
	Eq_2 s5_45;
	Eq_2 s6_46;
	word32 s1_148;
	word32 a2_149;
	word32 a5_150;
	word32 a6_151;
	word32 s2_152;
	word32 s3_153;
	word32 s4_154;
	word32 s7_155;
	word32 s8_156;
	Eq_2 s0_37 = dbg_test_print(&g_b23075D64, dwArg0158, out s1_148, out a2_149, out a5_150, out a6_151, out s2_152, out s3_153, out s4_154, out s5_45, out s6_46, out s7_155, out s8_156);
	*((word32) *((word32) s0_37 + 8) + 364) = s0_37;
	word32 a1_157;
	word32 a2_158;
	word32 a3_159;
	word32 a4_160;
	word32 a5_161;
	word32 a6_162;
	word32 a7_163;
	memcpy(587685264, s6_46, 0x06, out a1_157, out a2_158, out a3_159, out a4_160, out a5_161, out a6_162, out a7_163);
	Eq_2 a4_71;
	word32 a1_164;
	word32 a2_165;
	word32 a3_166;
	word32 a5_167;
	word32 a6_168;
	word32 a7_169;
	memcpy(587685302, s5_45, 0x06, out a1_164, out a2_165, out a3_166, out a4_71, out a5_167, out a6_168, out a7_169);
	word32 s3_170;
	keyMgmtSta_StartSession_internal(a4_71, mstatus, dwArg0138, dwArg0158, out s3_170);
	0x00 = dwArgA8;
	word32 s1_171;
	word32 a2_172;
	word32 a5_173;
	word32 a6_174;
	word32 s2_175;
	word32 s3_176;
	word32 s4_177;
	word32 s5_178;
	word32 s6_179;
	word32 s7_180;
	word32 s8_181;
	dbg_test_print(&g_b23075D78, dwArg0178, out s1_171, out a2_172, out a5_173, out a6_174, out s2_175, out s3_176, out s4_177, out s5_178, out s6_179, out s7_180, out s8_181);
}

// 2300F1C4: Register Eq_2 init_customApp_mibs(Register Eq_2 ra, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      supplicantDisable
//      supplicantInit
Eq_2 init_customApp_mibs(Eq_2 ra, Eq_2 dwArg0158, Eq_2 dwArg0178, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & s3Out, ptr32 & s4Out)
{
	word32 s1_105;
	word32 a2_106;
	word32 a5_107;
	word32 a6_108;
	word32 s2_109;
	word32 s3_110;
	word32 s4_111;
	word32 s5_112;
	word32 s6_113;
	word32 s7_114;
	word32 s8_115;
	Eq_2 s0_27 = dbg_test_print(&g_b23075D64, dwArg0158, out s1_105, out a2_106, out a5_107, out a6_108, out s2_109, out s3_110, out s4_111, out s5_112, out s6_113, out s7_114, out s8_115);
	word32 t1_116;
	word32 a0_117;
	word32 a1_118;
	word32 a2_119;
	word32 a3_120;
	word32 a4_121;
	word32 a5_122;
	word32 t1_123;
	word32 a0_124;
	word32 a1_125;
	word32 a2_126;
	word32 a3_127;
	word32 a4_128;
	word32 a5_129;
	Eq_2 ra_59 = memset(memset(ra, (word32) s0_27 + 50, 0x00, 0x03, out t1_116, out a0_117, out a1_118, out a2_119, out a3_120, out a4_121, out a5_122), (word32) s0_27 + 53, 0x00, 0x1C, out t1_123, out a0_124, out a1_125, out a2_126, out a3_127, out a4_128, out a5_129);
	*((word32) s0_27 + 54) = (word16) ((word32) *((word32) s0_27 + 54) | 1);
	ptr32 s1_79;
	ptr32 s4_80;
	ptr32 s3_85;
	word32 a2_130;
	word32 a5_131;
	word32 a6_132;
	word32 s2_133;
	word32 s5_134;
	word32 s6_135;
	word32 s7_136;
	word32 s8_137;
	s0Out = dbg_test_print(&g_b23075D78, dwArg0178, out s1_79, out a2_130, out a5_131, out a6_132, out s2_133, out s3_85, out s4_80, out s5_134, out s6_135, out s7_136, out s8_137);
	s1Out = s1_79;
	s3Out = s3_85;
	s4Out = s4_80;
	return ra_59;
}

// 2300F23E: Register word32 supplicantIsEnabled(Stack Eq_2 dwArg0158, Register out ptr32 s2Out)
// Called from:
//      supplicantInitSession
//      supplicantDisable
word32 supplicantIsEnabled(Eq_2 dwArg0158, ptr32 & s2Out)
{
	word32 a5_25;
	word32 s1_99;
	word32 a2_100;
	word32 a6_101;
	word32 s3_102;
	word32 s4_103;
	word32 s5_104;
	word32 s6_105;
	word32 s7_106;
	word32 s8_107;
	ptr32 s2_33;
	dbg_test_print(&g_b23075D64, dwArg0158, out s1_99, out a2_100, out a5_25, out a6_101, out s2_33, out s3_102, out s4_103, out s5_104, out s6_105, out s7_106, out s8_107);
	word32 a0_39 = 0x00;
	if (a5_25 != 0x00)
	{
		word32 s1_108;
		word32 a2_109;
		word32 a5_110;
		word32 a6_111;
		word32 s3_112;
		word32 s4_113;
		word32 s5_114;
		word32 s6_115;
		word32 s7_116;
		word32 s8_117;
		dbg_test_print(&g_b23075D78, dwArg0158, out s1_108, out a2_109, out a5_110, out a6_111, out s2_33, out s3_112, out s4_113, out s5_114, out s6_115, out s7_116, out s8_117);
		a0_39 = 0x01;
	}
	s2Out = s2_33;
	return a0_39;
}

// 2300F2A4: void supplicantInitSession(Register ptr32 mstatus, Stack word32 dwArg88, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178)
// Called from:
//      sm_assoc_rsp_handler
void supplicantInitSession(ptr32 mstatus, word32 dwArg88, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178)
{
	word32 s1_201;
	word32 a2_202;
	word32 a5_203;
	word32 a6_204;
	word32 s2_205;
	word32 s3_206;
	word32 s4_207;
	word32 s5_208;
	word32 s6_209;
	word32 s7_210;
	word32 s8_211;
	dbg_test_print(&g_b23075D64, dwArg0158, out s1_201, out a2_202, out a5_203, out a6_204, out s2_205, out s3_206, out s4_207, out s5_208, out s6_209, out s7_210, out s8_211);
	word32 s2_212;
	if (supplicantIsEnabled(dwArg0138, out s2_212) != 0x00)
	{
		Eq_2 s2_75;
		Eq_2 s5_78;
		struct Eq_48961 * a5_89;
		word32 a1_213;
		word32 a2_214;
		word32 a3_215;
		word32 a4_216;
		word32 a6_217;
		word32 a7_218;
		memcpy(KeyMgmtInitSta(dwArg0118, dwArg0138, dwArg0158, out s2_75, out s5_78) + 0x06, s5_78, s2_75, out a1_213, out a2_214, out a3_215, out a4_216, out a5_89, out a6_217, out a7_218);
		a5_89->b0005 = (byte) s2_75;
		keyMgmtSta_StartSession(mstatus, dwArg88, dwArg0118, dwArg0138, dwArg0158);
	}
	word32 s1_219;
	word32 a2_220;
	word32 a5_221;
	word32 a6_222;
	word32 s2_223;
	word32 s3_224;
	word32 s4_225;
	word32 s5_226;
	word32 s6_227;
	word32 s7_228;
	word32 s8_229;
	dbg_test_print(&g_b23075D78, dwArg0178, out s1_219, out a2_220, out a5_221, out a6_222, out s2_223, out s3_224, out s4_225, out s5_226, out s6_227, out s7_228, out s8_229);
}

// 2300F33C: Register Eq_2 supplicantDisable(Register Eq_2 ra, Register Eq_2 a4, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s2Out)
// Called from:
//      mm_sta_del
Eq_2 supplicantDisable(Eq_2 ra, Eq_2 a4, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s2Out)
{
	word32 s1_158;
	word32 a2_159;
	word32 a5_160;
	word32 a6_161;
	word32 s2_162;
	word32 s3_163;
	word32 s4_164;
	word32 s5_165;
	word32 s6_166;
	word32 s7_167;
	word32 s8_168;
	dbg_test_print(&g_b23075D64, dwArg0158, out s1_158, out a2_159, out a5_160, out a6_161, out s2_162, out s3_163, out s4_164, out s5_165, out s6_166, out s7_167, out s8_168);
	ptr32 s2_46;
	word32 a0_39 = supplicantIsEnabled(dwArg0138, out s2_46);
	if (a0_39 == 0x00)
	{
		s2Out = s2_46;
		return ra;
	}
	else
	{
		word32 a2_169;
		word32 a5_170;
		mm_timer_clear(a0_39 + 348, a4, out a2_169, out a5_170);
		((word32) a4 + 53)->u1 = (byte) ((word32) *((word32) a4 + 53) & ~0x01);
		word32 s0_171;
		word32 s1_172;
		word32 s3_173;
		word32 s4_174;
		Eq_2 ra_80 = init_customApp_mibs(ra, dwArg0138, dwArg0158, out s0_171, out s1_172, out s3_173, out s4_174);
		ptr32 s2_114;
		word32 s1_175;
		word32 a2_176;
		word32 a5_177;
		word32 a6_178;
		word32 s3_179;
		word32 s4_180;
		word32 s5_181;
		word32 s6_182;
		word32 s7_183;
		word32 s8_184;
		dbg_test_print(&g_b23075D78, dwArg0178, out s1_175, out a2_176, out a5_177, out a6_178, out s2_114, out s3_179, out s4_180, out s5_181, out s6_182, out s7_183, out s8_184);
		s2Out = s2_114;
		return ra_80;
	}
}

// 2300F3C4: Register Eq_2 supplicantEnable(Register (ptr32 Eq_10425) a4, Stack (ptr32 Eq_10270) dwArgA8, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out (ptr32 Eq_10446) s1Out, Register out ptr32 s2Out, Register out (ptr32 byte) s3Out, Register out ptr32 s4Out)
// Called from:
//      mm_sta_add
Eq_2 supplicantEnable(struct Eq_10425 * a4, struct Eq_10270 * dwArgA8, Eq_2 dwArg0158, Eq_2 dwArg0178, struct Eq_8990 & s1Out, ptr32 & s2Out, byte & s3Out, ptr32 & s4Out)
{
	Eq_2 a1_102;
	word32 s4_44;
	up32 s2_48;
	Eq_2 s3_49;
	Eq_2 s5_50;
	up32 s6_51;
	word32 a6_277;
	word32 s7_278;
	word32 s8_279;
	word32 s1_274;
	word32 a2_275;
	word32 a5_276;
	dbg_test_print(&g_b23075D64, dwArg0158, out s1_274, out a2_275, out a5_276, out a6_277, out s2_48, out s3_49, out s4_44, out s5_50, out s6_51, out s7_278, out s8_279);
	a4->b0035 = (byte) ((word32) a4->b0035 | 1);
	if (s2_48 >= s6_51 + -4)
	{
		a4->w0036 = (word16) ((word32) a4->w0036 | 32);
		a4->b0035 = (byte) ((word32) a4->b0035 | 4);
		a4->w004E = (word16) ((word32) a4->w004E | 1);
		word32 a1_280;
		word32 a2_281;
		word32 a3_282;
		word32 a4_283;
		word32 a5_284;
		word32 a6_285;
		word32 a7_286;
		memcpy(587685276, s5_50, 0x01, out a1_280, out a2_281, out a3_282, out a4_283, out a5_284, out a6_285, out a7_286);
		struct Eq_49193 * a5_137;
		word32 a1_287;
		word32 a2_288;
		word32 a3_289;
		word32 a4_290;
		word32 a6_291;
		word32 a7_292;
		memcpy(587685333, s3_49, 0x01, out a1_287, out a2_288, out a3_289, out a4_290, out a5_137, out a6_291, out a7_292);
		if (s4_44 != 0x00)
			a5_137->b003D = 0x06;
		else
			a5_137->b003D = (byte) s2_48;
		a1_102.u0 = 587783572;
	}
	else
	{
		if (s6_51 != 0x03)
			goto l2300F482;
		a4->w0036 = (word16) ((word32) a4->w0036 | 8);
		word32 a1_300;
		word32 a2_301;
		word32 a3_302;
		word32 a4_303;
		word32 a5_304;
		word32 a6_305;
		word32 a7_306;
		memcpy(587685276, s5_50, 0x01, out a1_300, out a2_301, out a3_302, out a4_303, out a5_304, out a6_305, out a7_306);
		struct Eq_49276 * a5_85;
		word32 a1_307;
		word32 a2_308;
		word32 a3_309;
		word32 a4_310;
		word32 a6_311;
		word32 a7_312;
		memcpy(587685333, s3_49, 0x01, out a1_307, out a2_308, out a3_309, out a4_310, out a5_85, out a6_311, out a7_312);
		a5_85->b003D = (byte) s2_48;
		a1_102.u0 = 0x2308DDB0;
	}
	word32 a1_313;
	word32 a2_314;
	word32 a3_315;
	word32 a4_316;
	word32 a5_317;
	word32 a6_318;
	word32 a7_319;
	memcpy(0x23075E0F, a1_102, 0x03, out a1_313, out a2_314, out a3_315, out a4_316, out a5_317, out a6_318, out a7_319);
l2300F482:
	null = dwArgA8;
	struct Eq_8990 * s1_203;
	ptr32 s4_204;
	ptr32 s2_208;
	byte * s3_209;
	word32 a2_293;
	word32 a5_294;
	word32 a6_295;
	word32 s5_296;
	word32 s6_297;
	word32 s7_298;
	word32 s8_299;
	Eq_2 s0_202 = dbg_test_print(&g_b23075D78, dwArg0178, out s1_203, out a2_293, out a5_294, out a6_295, out s2_208, out s3_209, out s4_204, out s5_296, out s6_297, out s7_298, out s8_299);
	s1Out = s1_203;
	s2Out = s2_208;
	s3Out = s3_209;
	s4Out = s4_204;
	return s0_202;
}

// 2300F4FE: Register word32 keyMgmtFormatWpaRsnIe(Stack Eq_2 dwArg04, Stack Eq_2 dwArg0158, Register out ptr32 a0Out, Register out ptr32 a4Out)
// Called from:
//      GeneratePWKMsg2
word32 keyMgmtFormatWpaRsnIe(Eq_2 dwArg04, Eq_2 dwArg0158, ptr32 & a0Out, ptr32 & a4Out)
{
	word32 s1_97;
	word32 a2_98;
	word32 a5_99;
	word32 a6_100;
	word32 s2_101;
	word32 s3_102;
	word32 s4_103;
	word32 s5_104;
	word32 s6_105;
	word32 s7_106;
	word32 s8_107;
	dbg_test_print(&g_b23075D64, dwArg0158, out s1_97, out a2_98, out a5_99, out a6_100, out s2_101, out s3_102, out s4_103, out s5_104, out s6_105, out s7_106, out s8_107);
	struct Eq_49348 * s3_57;
	word32 s1_108;
	word32 a2_109;
	word32 a5_110;
	word32 a6_111;
	word32 s2_112;
	word32 s4_113;
	word32 s5_114;
	word32 s6_115;
	word32 s7_116;
	word32 s8_117;
	dbg_test_print(&g_b23075D78, dwArg0158, out s1_108, out a2_109, out a5_110, out a6_111, out s2_112, out s3_57, out s4_113, out s5_114, out s6_115, out s7_116, out s8_117);
	struct Eq_12262 * a0_62 = (word32) s3_57->b0001;
	ptr32 a4_74;
	a0Out = mm_get_rsn_wpa_ie(a0_62, dwArg04, out a4_74);
	a4Out = a4_74;
	return s1;
}

// 2300F564: Register Eq_2 GeneratePWKMsg2(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0198, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out ptr32 s10Out)
// Called from:
//      KeyMgmtStaHsk_Recvd_PWKMsg1
Eq_2 GeneratePWKMsg2(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg78, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0198, ptr32 & a0Out, ptr32 & a4Out, ptr32 & s10Out)
{
	ptr32 a0_242;
	word32 s1_339;
	word32 a2_340;
	word32 a5_341;
	word32 a6_342;
	word32 s2_343;
	word32 s3_344;
	word32 s4_345;
	word32 s5_346;
	word32 s6_347;
	word32 s7_348;
	word32 s8_349;
	dbg_test_print(&g_b23075D64, dwArg0138, out s1_339, out a2_340, out a5_341, out a6_342, out s2_343, out s3_344, out s4_345, out s5_346, out s6_347, out s7_348, out s8_349);
	word32 a0_57;
	word32 a5_350;
	word32 s5_351;
	Eq_2 s1_232;
	ptr32 a4_197;
	Eq_2 ra_75 = GetTxEAPOLBuffer(ra, a3, a4, mstatus, s2, dwArg0118, out s1_232, out a0_57, out a4_197, out a5_350, out s5_351);
	if (a0_57 != 0x00)
	{
		struct Eq_49448 * s0_91;
		word32 a4_352;
		Eq_2 ra_105 = KeyMgmtSta_PrepareEAPOLFrame(ra_75, dwArgF8, dwArg0118, dwArg0138, out s0_91, out a4_352);
		ui32 a4_113 = (word32) s0_91->b0012;
		if (a4_113 != 0x01)
		{
			uint32 a0_121;
			struct Eq_49517 * s0_129 = keyMgmtFormatWpaRsnIe(dwLoc3C, dwArg0118, out a0_121, out a4_113);
			s0_129->b006F = (byte) a0_121;
			s0_129->b0070 = (byte) (a0_121 >> 8);
		}
		word32 s1_353;
		word32 s3_354;
		word32 s5_355;
		word32 s7_356;
		UpdateEAPOLWcbLenAndTransmit(KeyMgmtSta_PopulateEAPOLLengthMic(ra_105, a4_113, dwArgE8, dwArg0108), fflags, frm, mstatus, dwLoc18, dwArg14, dwArg1C, dwArg38, s1, dwArg78, dwArg0118, dwArg0138, out s1_353, out a4_197, out s3_354, out s5_355, out s7_356, out s10);
		word32 a2_357;
		word32 a5_358;
		word32 a6_359;
		word32 s2_360;
		word32 s3_361;
		word32 s4_362;
		word32 s5_363;
		word32 s6_364;
		word32 s7_365;
		word32 s8_366;
		dbg_test_print(&g_b23075D78, dwArg0138, out s1_232, out a2_357, out a5_358, out a6_359, out s2_360, out s3_361, out s4_362, out s5_363, out s6_364, out s7_365, out s8_366);
		a0_242 = 0x00;
	}
	else
		a0_242 = 0x01;
	0x00 = (uint16) dwArg0198;
	a0Out = a0_242;
	a4Out = a4_197;
	s10Out = s10;
	return s1_232;
}

// 2300F648: Register word32 KeyMgmtStaHsk_Recvd_PWKMsg1(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out ptr32 s10Out)
// Called from:
//      ProcessKeyMgmtDataSta
word32 KeyMgmtStaHsk_Recvd_PWKMsg1(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s4, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0198, ptr32 & s10Out)
{
	word32 s1_449;
	word32 a2_450;
	word32 a5_451;
	word32 a6_452;
	word32 s2_453;
	word32 s3_454;
	word32 s4_455;
	word32 s5_456;
	word32 s7_458;
	word32 s6_457;
	word32 s8_459;
	dbg_test_print(&g_b23075D64, dwArg0138, out s1_449, out a2_450, out a5_451, out a6_452, out s2_453, out s3_454, out s4_455, out s5_456, out s6_457, out s7_458, out s8_459);
	word32 a0_57;
	word32 a3_461;
	word32 s1_460;
	word32 s7_463;
	word32 s2_462;
	word32 s9_464;
	ptr32 s10_234;
	word32 a4_113;
	Eq_2 ra_65 = GetKeyMsgNonceFromEAPOL(ra, dwLoc40, dwLoc3C, dwLoc18, dwLoc08, dwArg0C, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s1_460, out a0_57, out a3_461, out a4_113, out s2_462, out s7_463, out s9_464, out s10_234);
	if (a0_57 != 0x00)
	{
		Eq_2 a0_88;
		word32 s3_465;
		word32 s4_466;
		Eq_2 s2_160;
		Eq_2 a4_186;
		supplicantAkmIsWpaWpa2(dwArg0118, out a0_88, out a4_186, out s2_160, out s3_465, out s4_466);
		Eq_2 s1_106 = a0_88;
		if (a0_88 != 0x00)
		{
			if (supplicantAkmIsWpaWpa2Psk(dwArgF8, dwArg0118, out a4_113) == 0x00 || pmkCacheFindPSK(ra_65, mstatus, s2, dwArg18, s1, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, out a4_113) == 0x00)
				goto l2300F69E;
			s2_160 = supplicantAkmUsesKdf(dwArg0108, dwArg0128);
			a4_186 = KeyMgmtSta_DeriveKeys(ra_65);
			s1_106.u0 = 0x01;
		}
		word32 a0_212;
		word32 s1_221 = GeneratePWKMsg2(ra_65, s1_106, 0x00, a4_186, s2_160, fflags, frm, mstatus, s4, s0, dwLoc08, dwArg38, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0158, out a0_212, out a4_113, out s10_234);
		if (a0_212 == 0x00 && s1_221 == 0x01)
		{
			word32 s3_478;
			word32 s5_479;
			updateApReplayCounter(dwArg44, dwArg0118, out a4_113, out s3_478, out s5_479)->dw00CC = 0x00;
		}
		word32 s1_467;
		word32 a2_468;
		word32 a5_469;
		word32 a6_470;
		word32 s2_471;
		word32 s3_472;
		word32 s4_473;
		word32 s5_474;
		word32 s6_475;
		word32 s7_476;
		word32 s8_477;
		dbg_test_print(&g_b23075D78, dwArg0138, out s1_467, out a2_468, out a5_469, out a6_470, out s2_471, out s3_472, out s4_473, out s5_474, out s6_475, out s7_476, out s8_477);
l2300F6A0:
		0x00 = (uint16) dwArg0198;
		s10Out = s10_234;
		return a4_113;
	}
	else
	{
l2300F69E:
		goto l2300F6A0;
	}
}

// 2300F764: Register word32 supplicantInit(Register Eq_2 ra, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s2Out)
// Called from:
//      bl_init
word32 supplicantInit(Eq_2 ra, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s2Out)
{
	word32 s1_149;
	word32 a2_150;
	word32 a5_151;
	word32 a6_152;
	word32 s2_153;
	word32 s3_154;
	word32 s4_155;
	word32 s5_156;
	word32 s6_157;
	word32 s7_158;
	word32 s8_159;
	dbg_test_print(&g_b23075D64, dwArg0158, out s1_149, out a2_150, out a5_151, out a6_152, out s2_153, out s3_154, out s4_155, out s5_156, out s6_157, out s7_158, out s8_159);
	struct Eq_49781 * s0_50;
	Eq_2 s4_54;
	word32 s1_160;
	word32 s3_161;
	word32 t1_162;
	word32 a0_163;
	word32 a1_164;
	word32 a2_165;
	word32 a3_166;
	word32 a4_167;
	word32 a5_168;
	word32 t1_169;
	word32 a0_170;
	word32 a1_171;
	word32 a2_172;
	word32 a3_173;
	word32 a4_174;
	word32 a5_175;
	memset(memset(init_customApp_mibs(ra, dwArg0138, dwArg0158, out s0_50, out s1_160, out s3_161, out s4_54), &s0_50->dw0158 + 16, 0x00FF, 0x04, out t1_162, out a0_163, out a1_164, out a2_165, out a3_166, out a4_167, out a5_168), s4_54, 0x00, 0x0144, out t1_169, out a0_170, out a1_171, out a2_172, out a3_173, out a4_174, out a5_175);
	s0_50->dw0158 = 0x00;
	s0_50->dw0154 = 0x01;
	s0_50->b0150 = 0x00;
	word32 s3_176;
	KeyMgmtResetCounter(dwArg0148, dwArg0158, out s3_176);
	word32 s1_124;
	ptr32 s2_129;
	word32 a2_177;
	word32 a5_178;
	word32 a6_179;
	word32 s3_180;
	word32 s4_181;
	word32 s5_182;
	word32 s6_183;
	word32 s7_184;
	word32 s8_185;
	dbg_test_print(&g_b23075D78, dwArg0178, out s1_124, out a2_177, out a5_178, out a6_179, out s2_129, out s3_180, out s4_181, out s5_182, out s6_183, out s7_184, out s8_185);
	s2Out = s2_129;
	return s1_124;
}

// 2300F7F6: Register Eq_2 allocSupplicantData(Register Eq_2 ra, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_49885) s2Out, Register out ptr32 s3Out)
// Called from:
//      bl_init
Eq_2 allocSupplicantData(Eq_2 ra, Eq_2 dwArg38, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0178, union Eq_2 & s0Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, struct Eq_49885 & s2Out, ptr32 & s3Out)
{
	struct Eq_49885 * s2_31;
	ptr32 s3_32;
	word32 s1_149;
	word32 a2_150;
	word32 a5_151;
	word32 a6_152;
	word32 s4_153;
	word32 s5_154;
	word32 s6_155;
	word32 s7_156;
	word32 s8_157;
	dbg_test_print(&g_b23075D64, dwArg0168, out s1_149, out a2_150, out a5_151, out a6_152, out s2_31, out s3_32, out s4_153, out s5_154, out s6_155, out s7_156, out s8_157);
	if (s2_31->dw0008 != 0x00)
	{
		0x00 = (uint16) dwArg38;
		s0Out = s0;
		a0Out = 587685220;
		a2Out = dwArg10;
		a3Out = a3;
		s2Out = s2_31;
		s3Out = s3_32;
		return ra;
	}
	else
	{
		union Eq_2 * a5_41 = (word32) s2_31->b0000;
		if (a5_41 == null)
		{
			Eq_2 s1_43 = *a5_41;
			if (a5_41 == null)
			{
				*(union Eq_2 *) 0x01 = s1_43;
				struct Eq_49960 * s2_57;
				s2_57->dw0008 = supplicantInit(ra, dwArg0128, dwArg0138, dwArg0148, dwArg0168, out s2_57);
			}
		}
		0x00 = (uint16) dwArg38;
		ptr32 a2_81;
		struct Eq_49885 * s2_90;
		ptr32 s3_91;
		word32 s1_158;
		word32 a5_159;
		word32 a6_160;
		word32 s4_161;
		word32 s5_162;
		word32 s6_163;
		word32 s7_164;
		word32 s8_165;
		s0Out = dbg_test_print(&g_b23075D78, dwArg0178, out s1_158, out a2_81, out a5_159, out a6_160, out s2_90, out s3_91, out s4_161, out s5_162, out s6_163, out s7_164, out s8_165);
		a0Out = 587685240;
		a2Out = a2_81;
		a3Out = a3;
		s2Out = s2_90;
		s3Out = s3_91;
		return ra;
	}
}

