pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300F886: Register word32 keyMgmtGetKeySize(Stack word32 dwArg38, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out (ptr32 byte) s1Out, Register out ptr32 a0Out, Register out ptr32 s2Out)
// Called from:
//      add_key_to_mac
//      add_mfp_key_to_mac
word32 keyMgmtGetKeySize(word32 dwArg38, Eq_2 dwArg0158, Eq_2 dwArg0168, byte & s1Out, ptr32 & a0Out, ptr32 & s2Out)
{
	word32 s1_103;
	word32 a2_104;
	word32 a5_105;
	word32 a6_106;
	word32 s2_107;
	word32 s3_108;
	word32 s4_109;
	word32 s5_110;
	word32 s6_111;
	word32 s7_112;
	word32 s8_113;
	dbg_test_print(&g_b23075D64, dwArg0158, out s1_103, out a2_104, out a5_105, out a6_106, out s2_107, out s3_108, out s4_109, out s5_110, out s6_111, out s7_112, out s8_113);
	word32 s1_114;
	word32 a2_115;
	word32 a5_116;
	word32 a6_117;
	word32 s2_118;
	word32 s3_119;
	word32 s4_120;
	word32 s5_121;
	word32 s6_122;
	word32 s7_123;
	word32 s8_124;
	dbg_test_print(&g_b23075D78, dwArg0158, out s1_114, out a2_115, out a5_116, out a6_117, out s2_118, out s3_119, out s4_120, out s5_121, out s6_122, out s7_123, out s8_124);
	ptr32 a0_71;
	ptr32 s2_78;
	s1Out = keyMgmtGetKeySize_internal(dwArg38, dwArg0168, out a0_71, out s2_78);
	a0Out = a0_71;
	s2Out = s2_78;
	return s1;
}

// 2300F8F0: Register Eq_2 add_key_to_mac(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a1, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg01B4, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s5Out, Register out ptr32 s10Out)
// Called from:
//      keyMgmtKeyGroupTxDone.isra.1
//      keyMgmtPlumbPairwiseKey
//      ProcessPWKMsg4
//      InitGroupKey
Eq_2 add_key_to_mac(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a1, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg01B4, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s5Out, ptr32 & s10Out)
{
	Eq_2 s1_14 = a0;
	word32 s2_16 = a1;
	Eq_2 s0_17 = 0x10;
	if ((word32) *a0 == 0x00)
	{
		ui32 a0_18;
		keyMgmtGetKeySize(dwLoc08, dwArg0118, dwArg0128, out s1_14, out a0_18, out s2_16);
		s0_17 = a0_18 & 0x00FF;
	}
	Eq_2 a1_66;
	struct Eq_50071 * a1_42;
	word32 a4_302;
	word32 a5_303;
	word32 t1_298;
	word32 a2_300;
	word32 a3_301;
	word32 a0_299;
	Eq_2 ra_47 = memset(ra, fp + -60, 0x00, 44, out t1_298, out a0_299, out a1_42, out a2_300, out a3_301, out a4_302, out a5_303);
	word32 a5_55 = (word32) *s1_14;
	if (s2_16 != 0x00)
	{
		if (a5_55 == 0x00)
			a1_66 = (char *) a1_42 + 0x00D8;
		else
			a1_66 = (word32) s1_14 + 0x00C4;
	}
	else if (a5_55 == 0x00)
	{
		a1_66 = (char *) a1_42 + 0x0100;
		bLoc3C = (byte) (word32) a1_42->w0126;
	}
	else
	{
		word32 a5_326;
		word32 a4_325;
		struct Eq_50194 * a0_60 = cm_GetApInfo(s1_14, out a4_325, out a5_326);
		a1_66 = &a0_60->dw00B8 + 5;
		bLoc3C = (byte) (word32) a0_60->w00F2;
	}
	word32 a4_330;
	word32 a6_332;
	word32 a7_333;
	word32 a5_331;
	word32 a2_328;
	word32 a3_329;
	word32 a1_327;
	memcpy(fp + -52, a1_66, s0_17, out a1_327, out a2_328, out a3_329, out a4_330, out a5_331, out a6_332, out a7_333);
	byte bLoc38_201 = (byte) s0_17;
	if (s0_17 != 0x10)
	{
		if (s0_17 == 32)
		{
			if (s2_16 != 0x00)
				0x00 = (uint16) dwArg01B4;
			goto l2300F9BA;
		}
		if (s0_17 != 0x0D)
		{
			if (s0_17 != 0x05)
				assert_err();
			goto l2300F9BA;
		}
	}
l2300F9BA:
	ptr32 s10_147;
	ptr32 a0_160;
	ptr32 a3_163;
	ptr32 a4_164;
	ptr32 a5_165;
	ptr32 s1_170;
	ptr32 s2_171;
	ptr32 s5_174;
	word32 s0_322;
	word32 s4_324;
	word32 s3_323;
	word32 s8_318;
	word32 s11_320;
	word32 t4_321;
	word32 s9_319;
	word32 s4_314;
	word32 s6_316;
	word32 s7_317;
	word32 s5_315;
	word32 a5_310;
	word32 s2_312;
	word32 s3_313;
	word32 a7_311;
	word32 a1_306;
	word32 a3_308;
	word32 a4_309;
	word32 a2_307;
	word32 s1_304;
	word32 a0_305;
	Eq_2 ra_168 = mm_sec_machwkey_wr(printf(ra_47, &g_t23075FE4, (word32) bLoc3C, SEQ(nLoc37, bLoc38_201), dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_304, out a0_305, out a1_306, out a2_307, out a3_308, out a4_309, out a5_310, out a7_311, out s2_312, out s3_313, out s4_314, out s5_315, out s6_316, out s7_317, out s8_318, out s9_319, out s10_147, out s11_320, out t4_321), fp + -60, dwArgC8, out s0_322, out s1_170, out a0_160, out a3_163, out a4_164, out a5_165, out s2_171, out s3_323, out s4_324, out s5_174);
	s1Out = s1_170;
	a0Out = a0_160;
	a3Out = a3_163;
	a4Out = a4_164;
	a5Out = a5_165;
	s2Out = s2_171;
	s5Out = s5_174;
	s10Out = s10_147;
	return ra_168;
}

// 2300FA1C: Register Eq_2 keyMgmtKeyGroupTxDone.isra.1(Register Eq_2 ra, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg01A4, Register out ptr32 a4Out, Register out ptr32 s3Out, Register out ptr32 s10Out)
// Called from:
//      GenerateGrpMsg2
//      GeneratePWKMsg4
Eq_2 keyMgmtKeyGroupTxDone.isra.1(Eq_2 ra, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0168, Eq_2 dwArg01A4, ptr32 & a4Out, ptr32 & s3Out, ptr32 & s10Out)
{
	word32 s8_242;
	word32 s7_241;
	word32 s6_240;
	word32 s5_239;
	word32 s4_238;
	word32 s3_237;
	word32 s2_236;
	word32 a6_235;
	word32 a5_234;
	word32 a2_233;
	Eq_2 s1_24;
	Eq_2 s0_34 = *dbg_test_print(&g_b23075D64, dwArg0168, out s1_24, out a2_233, out a5_234, out a6_235, out s2_236, out s3_237, out s4_238, out s5_239, out s6_240, out s7_241, out s8_242);
	struct Eq_8261 * a0_36 = (word32) *((word32) s0_34 + 3);
	if (a0_36 != (struct Eq_8261 *) 0x00FF)
	{
		word32 a2_245;
		word32 a4_246;
		word32 s2_247;
		word32 s3_248;
		word32 s6_249;
		s1_24 = mm_sec_machwkey_del(a0_36, dwArg0108, out a2_245, out a4_246, out s2_247, out s3_248, out s6_249);
	}
	word32 a0_62;
	struct Eq_50312 * a5_67;
	Eq_2 s1_72;
	Eq_2 s2_75;
	Eq_2 s5_78;
	word32 a4_244;
	word32 a3_243;
	ptr32 s10_116;
	Eq_2 ra_113 = add_key_to_mac(ra, s1_24, s0_34, 0x00, dwArg20, dwArg24, dwArg6C, dwArgB8, dwArg0108, dwArg0118, dwArg01A4, out s1_72, out a0_62, out a3_243, out a4_244, out a5_67, out s2_75, out s5_78, out s10_116);
	a5_67->ptr0008->b0003 = (byte) a0_62;
	a5_67->dw00C8 = 0x01;
	ptr32 a4_109 = 0x01;
	struct Eq_50335 * s0_94 = a5_67->ptr0008;
	Eq_2 a3_95 = a5_67->t00CC;
	if (a3_95 == 0x00)
	{
		a5_67->t00CC.u0 = 0x01;
		ra_113 = sm_handle_supplicant_result(ra_113, s1_72, (word32) s0_94->b0001, 0x00, a3_95, s2_75, s5_78, fflags, frm, mstatus, dwLoc08, dwArg08, dwArg30, dwArg34, dwArg40, dwArg44, dwArg68, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgB8, dwArgBC, dwArgD8, dwArgF8, dwArg0118, out a4_109, out s10_116);
	}
	ptr32 s3_153;
	word32 s1_250;
	word32 a2_251;
	word32 a5_252;
	word32 a6_253;
	word32 s2_254;
	word32 s4_255;
	word32 s5_256;
	word32 s6_257;
	word32 s7_258;
	word32 s8_259;
	dbg_test_print(&g_b23075D78, dwArg0168, out s1_250, out a2_251, out a5_252, out a6_253, out s2_254, out s3_153, out s4_255, out s5_256, out s6_257, out s7_258, out s8_259);
	a4Out = a4_109;
	s3Out = s3_153;
	s10Out = s10_116;
	return ra_113;
}

