pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300FAB2: Register word32 GenerateGrpMsg2(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg14, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0164, Stack Eq_2 dwArg0198, Register out ptr32 a4Out, Register out ptr32 s10Out)
// Called from:
//      KeyMgmtStaHsk_Recvd_GrpMsg1
word32 GenerateGrpMsg2(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg14, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0164, Eq_2 dwArg0198, ptr32 & a4Out, ptr32 & s10Out)
{
	word32 a0_220;
	word32 s1_316;
	word32 a2_317;
	word32 a5_318;
	word32 a6_319;
	word32 s2_320;
	word32 s3_321;
	word32 s4_322;
	word32 s5_323;
	word32 s6_324;
	word32 s7_325;
	word32 s8_326;
	dbg_test_print(&g_b23075D64, dwArg0138, out s1_316, out a2_317, out a5_318, out a6_319, out s2_320, out s3_321, out s4_322, out s5_323, out s6_324, out s7_325, out s8_326);
	word32 a0_54;
	word32 s1_327;
	word32 a5_328;
	word32 s5_329;
	ptr32 a4_177;
	Eq_2 ra_72 = GetTxEAPOLBuffer(ra, a3, a4, mstatus, s2, dwArg0118, out s1_327, out a0_54, out a4_177, out a5_328, out s5_329);
	if (a0_54 != 0x00)
	{
		ui32 a4_100;
		word32 s0_330;
		word32 a4_331;
		word32 s3_332;
		word32 s10_333;
		word32 s1_334;
		word32 s3_335;
		word32 s5_336;
		word32 s7_337;
		UpdateEAPOLWcbLenAndTransmit(keyMgmtKeyGroupTxDone.isra.1(KeyMgmtSta_PopulateEAPOLLengthMic(KeyMgmtSta_PrepareEAPOLFrame(ra_72, dwArgF8, dwArg0118, dwArg0138, out s0_330, out a4_100), a4_100, dwArgE8, dwArg0108), fflags, frm, mstatus, dwLoc38, dwLoc20, dwLoc1C, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg28, dwArg2C, dwArg3C, dwArg48, dwArg4C, s1, dwArg78, dwArg7C, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArg0128, dwArg0164, out a4_331, out s3_332, out s10_333), fflags, frm, mstatus, dwLoc18, dwArg14, dwArg1C, dwArg38, s1, dwArg78, dwArg0118, dwArg0138, out s1_334, out a4_177, out s3_335, out s5_336, out s7_337, out s10);
		word32 s1_338;
		word32 a2_339;
		word32 a5_340;
		word32 a6_341;
		word32 s2_342;
		word32 s3_343;
		word32 s4_344;
		word32 s5_345;
		word32 s6_346;
		word32 s7_347;
		word32 s8_348;
		dbg_test_print(&g_b23075D78, dwArg0138, out s1_338, out a2_339, out a5_340, out a6_341, out s2_342, out s3_343, out s4_344, out s5_345, out s6_346, out s7_347, out s8_348);
		a0_220 = 0x00;
	}
	else
		a0_220 = 0x01;
	0x00 = (uint16) dwArg0198;
	a4Out = a4_177;
	s10Out = s10;
	return a0_220;
}

// 2300FB68: Register Eq_2 KeyMgmtStaHsk_Recvd_GrpMsg1(Register Eq_2 ra, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0144, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s10Out)
// Called from:
//      ProcessKeyMgmtDataSta
Eq_2 KeyMgmtStaHsk_Recvd_GrpMsg1(Eq_2 ra, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0144, Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s10Out)
{
	word32 s1_263;
	word32 a2_264;
	word32 a5_265;
	word32 a6_266;
	word32 s2_267;
	word32 s3_268;
	word32 s4_269;
	word32 s5_270;
	word32 s6_271;
	word32 s7_272;
	word32 s8_273;
	dbg_test_print(&g_b23075D64, dwArg0158, out s1_263, out a2_264, out a5_265, out a6_266, out s2_267, out s3_268, out s4_269, out s5_270, out s6_271, out s7_272, out s8_273);
	Eq_2 a0_47;
	Eq_2 a3_50;
	Eq_2 s2_60;
	ptr32 s10_104;
	Eq_2 a4_117;
	Eq_2 ra_55 = ProcessRxEAPOL_GrpMsg1(ra, s2, dwLoc04, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out a0_47, out a3_50, out a4_117, out s2_60, out s10_104);
	if (a0_47 != 0x00 && GenerateGrpMsg2(ra_55, a0_47, a3_50, a4_117, s2_60, fflags, frm, mstatus, dwLoc20, s4, dwLoc0C, dwLoc04, dwArg08, dwArg0C, dwArg18, dwArg1C, dwArg28, dwArg2C, dwArg58, dwArg5C, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0144, dwArg0178, out a4_117, out s10_104) == 0x00)
	{
		word32 s3_274;
		word32 s5_275;
		updateApReplayCounter(s3, dwArg0138, out a4_117, out s3_274, out s5_275);
		word32 s1_276;
		word32 a2_277;
		word32 a5_278;
		word32 a6_279;
		word32 s2_280;
		word32 s3_281;
		word32 s4_282;
		word32 s5_283;
		word32 s6_284;
		word32 s7_285;
		word32 s8_286;
		dbg_test_print(&g_b23075D78, dwArg0158, out s1_276, out a2_277, out a5_278, out a6_279, out s2_280, out s3_281, out s4_282, out s5_283, out s6_284, out s7_285, out s8_286);
	}
	s10Out = s10_104;
	return a4_117;
}

// 2300FBF6: Register Eq_2 add_mfp_key_to_mac(Register Eq_2 ra, Register Eq_2 s1, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s10Out)
// Called from:
//      keyMgmtPlumbPairwiseKey
Eq_2 add_mfp_key_to_mac(Eq_2 ra, Eq_2 s1, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & s10Out)
{
	Eq_2 a1_56;
	ui32 a0_16;
	word32 s2_24;
	word32 s1_227;
	byte * s0_22 = keyMgmtGetKeySize(dwLoc08, dwArg0118, dwArg0128, out s1_227, out a0_16, out s2_24);
	word32 a1_38;
	word32 a5_233;
	word32 a3_231;
	word32 a4_232;
	word32 a0_229;
	word32 a2_230;
	word32 t1_228;
	Eq_2 ra_43 = memset(ra, fp + -60, 0x00, 44, out t1_228, out a0_229, out a1_38, out a2_230, out a3_231, out a4_232, out a5_233);
	byte bLoc38_173 = (byte) (a0_16 & 0x00FF);
	word32 a5_53 = (word32) *s0_22;
	if (s2_24 != 0x00)
	{
		if (a5_53 != 0x00)
			goto l2300FC4A;
		a1_56 = a1_38 + 0x00D8;
	}
	else
	{
		if (a5_53 != 0x00)
			goto l2300FC4A;
		a1_56 = a1_38 + 0x0100;
	}
	word32 a1_279;
	word32 a2_280;
	word32 a3_281;
	word32 a4_282;
	word32 a5_283;
	word32 a6_284;
	word32 a7_285;
	memcpy(fp + -52, a1_56, a0_16 & 0x00FF, out a1_279, out a2_280, out a3_281, out a4_282, out a5_283, out a6_284, out a7_285);
l2300FC4A:
	Eq_2 dwLoc38_200 = SEQ(nLoc37, bLoc38_173);
	ptr32 a0_112;
	Eq_2 a3_115;
	ptr32 s10_148;
	word32 s11_251;
	word32 t4_252;
	word32 s9_249;
	word32 s10_250;
	word32 s7_247;
	word32 s8_248;
	word32 s5_245;
	word32 s6_246;
	word32 s3_243;
	word32 s4_244;
	word32 a7_241;
	word32 s2_242;
	word32 a4_239;
	word32 a5_240;
	word32 a2_237;
	word32 a3_238;
	word32 a0_235;
	word32 a1_236;
	word32 s1_234;
	word32 s0_253;
	word32 s1_254;
	word32 a4_255;
	word32 a5_256;
	word32 s2_257;
	word32 s3_258;
	word32 s4_259;
	word32 s5_260;
	word32 s1_261;
	word32 a0_262;
	word32 a1_263;
	word32 a2_264;
	word32 a3_265;
	word32 a4_266;
	word32 a5_267;
	word32 a7_268;
	word32 s2_269;
	word32 s3_270;
	word32 s4_271;
	word32 s5_272;
	word32 s6_273;
	word32 s7_274;
	word32 s8_275;
	word32 s9_276;
	word32 s11_277;
	word32 t4_278;
	Eq_2 ra_146 = printf(mm_sec_machwkey_wr(printf(ra_43, &g_t23076030, 0x04, dwLoc38_200, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_234, out a0_235, out a1_236, out a2_237, out a3_238, out a4_239, out a5_240, out a7_241, out s2_242, out s3_243, out s4_244, out s5_245, out s6_246, out s7_247, out s8_248, out s9_249, out s10_250, out s11_251, out t4_252), fp + -60, dwArgC8, out s0_253, out s1_254, out a0_112, out a3_115, out a4_255, out a5_256, out s2_257, out s3_258, out s4_259, out s5_260), &g_t23076080, a3_115, dwLoc38_200, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_261, out a0_262, out a1_263, out a2_264, out a3_265, out a4_266, out a5_267, out a7_268, out s2_269, out s3_270, out s4_271, out s5_272, out s6_273, out s7_274, out s8_275, out s9_276, out s10_148, out s11_277, out t4_278);
	s0Out = a0_112;
	s10Out = s10_148;
	return ra_146;
}

