pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300FC9A: Register Eq_2 keyMgmtPlumbPairwiseKey(Register Eq_2 ra, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg6C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg01A4, Register out Eq_2 s0Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s10Out)
// Called from:
//      keyMgmtKeyPairwiseTxDone.isra.2
Eq_2 keyMgmtPlumbPairwiseKey(Eq_2 ra, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg6C, Eq_2 dwArgB8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0168, Eq_2 dwArg0178, Eq_2 dwArg01A4, union Eq_2 & s0Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s10Out)
{
	Eq_2 s1_24;
	word32 a2_177;
	word32 a5_178;
	word32 a6_179;
	word32 s2_180;
	word32 s3_181;
	word32 s4_182;
	word32 s5_183;
	word32 s6_184;
	word32 s7_185;
	word32 s8_186;
	dbg_test_print(&g_b23075D64, dwArg0168, out s1_24, out a2_177, out a5_178, out a6_179, out s2_180, out s3_181, out s4_182, out s5_183, out s6_184, out s7_185, out s8_186);
	Eq_2 s0_34 = g_t23075D6C;
	word32 a1_187;
	word32 a2_188;
	word32 a3_189;
	word32 a4_190;
	word32 a5_191;
	word32 a6_192;
	word32 a7_193;
	memcpy(587685436, 587685516, 40, out a1_187, out a2_188, out a3_189, out a4_190, out a5_191, out a6_192, out a7_193);
	word32 a0_53;
	struct Eq_50934 * a5_58;
	Eq_2 s1_63;
	word32 a3_194;
	word32 a4_195;
	word32 s2_196;
	word32 s5_197;
	ptr32 s10_165;
	Eq_2 ra_164 = add_key_to_mac(ra, s1_24, s0_34, 0x01, dwArg20, dwArg24, dwArg6C, dwArgB8, dwArg0108, dwArg0118, dwArg01A4, out s1_63, out a0_53, out a3_194, out a4_195, out a5_58, out s2_196, out s5_197, out s10_165);
	struct Eq_50953 * s0_81 = a5_58->ptr0008;
	s0_81->b0004 = (byte) a0_53;
	if ((word32) a5_58->b003D == 0x06)
	{
		struct Eq_50967 * s0_95;
		ra_164 = add_mfp_key_to_mac(ra_164, s1_63, dwArg20, dwArg24, dwArg6C, dwArgB8, dwArg0108, dwArg0118, out s0_95, out s10_165);
		s0_95->b0005 = (byte) s0_81;
	}
	ptr32 s2_138;
	ptr32 s3_139;
	word32 s1_198;
	word32 a2_199;
	word32 a5_200;
	word32 a6_201;
	word32 s4_202;
	word32 s5_203;
	word32 s6_204;
	word32 s7_205;
	word32 s8_206;
	s0Out = dbg_test_print(&g_b23075D78, dwArg0178, out s1_198, out a2_199, out a5_200, out a6_201, out s2_138, out s3_139, out s4_202, out s5_203, out s6_204, out s7_205, out s8_206);
	s2Out = s2_138;
	s3Out = s3_139;
	s10Out = s10_165;
	return ra_164;
}

// 2300FD26: Register Eq_2 keyMgmtKeyPairwiseTxDone.isra.2(Register Eq_2 ra, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0184, Register out ptr32 a4Out, Register out ptr32 s3Out, Register out ptr32 s10Out)
// Called from:
//      GeneratePWKMsg4
Eq_2 keyMgmtKeyPairwiseTxDone.isra.2(Eq_2 ra, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg4C, Eq_2 dwArg98, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0184, ptr32 & a4Out, ptr32 & s3Out, ptr32 & s10Out)
{
	word32 s1_117;
	word32 a2_118;
	word32 a5_119;
	word32 a6_120;
	word32 s2_121;
	word32 s3_122;
	word32 s4_123;
	word32 s5_124;
	word32 s6_125;
	word32 s7_126;
	word32 s8_127;
	dbg_test_print(&g_b23075D64, dwArg0158, out s1_117, out a2_118, out a5_119, out a6_120, out s2_121, out s3_122, out s4_123, out s5_124, out s6_125, out s7_126, out s8_127);
	ptr32 s10_51;
	struct Eq_51041 * s3_54;
	word32 s0_128;
	word32 s2_129;
	Eq_2 ra_48 = keyMgmtPlumbPairwiseKey(ra, dwArg00, dwArg04, dwArg4C, dwArg98, dwArgE8, dwArgF8, dwArg0148, dwArg0158, dwArg0184, out s0_128, out s2_129, out s3_54, out s10_51);
	s3_54->ptr0008->dw00D0 = 0x01;
	ptr32 s3_86;
	word32 s1_130;
	word32 a2_131;
	word32 a5_132;
	word32 a6_133;
	word32 s2_134;
	word32 s4_135;
	word32 s5_136;
	word32 s6_137;
	word32 s7_138;
	word32 s8_139;
	dbg_test_print(&g_b23075D78, dwArg0158, out s1_130, out a2_131, out a5_132, out a6_133, out s2_134, out s3_86, out s4_135, out s5_136, out s6_137, out s7_138, out s8_139);
	a4Out = 0x01;
	s3Out = s3_86;
	s10Out = s10_51;
	return ra_48;
}

// 2300FD94: Register word32 GeneratePWKMsg4(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s7, Register Eq_2 s9, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0144, Stack Eq_2 dwArg0164, Stack Eq_2 dwArg0198, Register out ptr32 a4Out, Register out ptr32 s10Out)
// Called from:
//      KeyMgmtStaHsk_Recvd_PWKMsg3
word32 GeneratePWKMsg4(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s7, Eq_2 s9, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0144, Eq_2 dwArg0164, Eq_2 dwArg0198, ptr32 & a4Out, ptr32 & s10Out)
{
	word32 a0_328;
	word32 s1_458;
	word32 a2_459;
	word32 a5_460;
	word32 a6_461;
	word32 s2_462;
	word32 s3_463;
	word32 s4_464;
	word32 s5_465;
	word32 s6_466;
	word32 s7_467;
	word32 s8_468;
	dbg_test_print(&g_b23075D64, dwArg0138, out s1_458, out a2_459, out a5_460, out a6_461, out s2_462, out s3_463, out s4_464, out s5_465, out s6_466, out s7_467, out s8_468);
	word32 a0_62;
	word32 s1_469;
	word32 a5_470;
	word32 s5_471;
	ptr32 a4_186;
	Eq_2 ra_80 = GetTxEAPOLBuffer(ra, a3, a4, mstatus, s2, dwArg0118, out s1_469, out a0_62, out a4_186, out a5_470, out s5_471);
	if (a0_62 != 0x00)
	{
		word32 s3_196;
		ui32 a4_108;
		word32 s5_168;
		word32 s7_170;
		word32 s0_472;
		word32 s1_473;
		word32 a4_474;
		word32 s3_475;
		word32 s10_476;
		Eq_2 ra_160 = UpdateEAPOLWcbLenAndTransmit(KeyMgmtSta_PopulateEAPOLLengthMic(KeyMgmtSta_PrepareEAPOLFrame(ra_80, dwArgF8, dwArg0118, dwArg0138, out s0_472, out a4_108), a4_108, dwArgE8, dwArg0108), fflags, frm, mstatus, dwLoc18, dwArg14, dwArg1C, dwArg38, s1, dwArg78, dwArg0118, dwArg0138, out s1_473, out a4_474, out s3_475, out s5_168, out s7_170, out s10_476);
		if (s7_170 != 0x00)
		{
			word32 s1_477;
			word32 a2_478;
			word32 a5_479;
			word32 a6_480;
			word32 s2_481;
			word32 s3_482;
			word32 s4_483;
			word32 s5_484;
			word32 s6_485;
			word32 s7_486;
			word32 s8_487;
			dbg_test_print(s5_168 + -668, dwArg0138, out s1_477, out a2_478, out a5_479, out a6_480, out s2_481, out s3_482, out s4_483, out s5_484, out s6_485, out s7_486, out s8_487);
			word32 s3_272;
			word32 a4_488;
			word32 s3_489;
			word32 s10_490;
			keyMgmtKeyGroupTxDone.isra.1(keyMgmtKeyPairwiseTxDone.isra.2(ra_160, dwLoc40, dwLoc3C, dwArg0C, s1, dwArgA8, dwArgB8, dwArg0108, dwArg0118, dwArg0144, out a4_488, out s3_489, out s10_490), fflags, frm, mstatus, dwLoc38, dwLoc20, dwLoc1C, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg28, dwArg2C, dwArg3C, s9, s7, s1, dwArg78, dwArg7C, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArg0128, dwArg0164, out a4_186, out s3_272, out s10);
			word32 s1_491;
			word32 a2_492;
			word32 a5_493;
			word32 a6_494;
			word32 s2_495;
			word32 s4_496;
			word32 s5_497;
			word32 s6_498;
			word32 s7_499;
			word32 s8_500;
			dbg_test_print(s3_272 + -0x0288, dwArg0138, out s1_491, out a2_492, out a5_493, out a6_494, out s2_495, out s3_196, out s4_496, out s5_497, out s6_498, out s7_499, out s8_500);
		}
		else
			keyMgmtKeyPairwiseTxDone.isra.2(ra_160, dwLoc40, dwLoc3C, dwArg0C, s1, dwArgA8, dwArgB8, dwArg0108, dwArg0118, dwArg0144, out a4_186, out s3_196, out s10);
		word32 s1_501;
		word32 a2_502;
		word32 a5_503;
		word32 a6_504;
		word32 s2_505;
		word32 s3_506;
		word32 s4_507;
		word32 s5_508;
		word32 s6_509;
		word32 s7_510;
		word32 s8_511;
		dbg_test_print(s3_196 + -0x0288, dwArg0138, out s1_501, out a2_502, out a5_503, out a6_504, out s2_505, out s3_506, out s4_507, out s5_508, out s6_509, out s7_510, out s8_511);
		a0_328 = 0x00;
	}
	else
		a0_328 = 0x01;
	0x00 = (uint16) dwArg0198;
	a4Out = a4_186;
	s10Out = s10;
	return a0_328;
}

