pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0000.c
// 2300FE9C: Register Eq_2 KeyMgmtStaHsk_Recvd_PWKMsg3(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0124, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0144, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s10Out)
// Called from:
//      ProcessKeyMgmtDataSta
Eq_2 KeyMgmtStaHsk_Recvd_PWKMsg3(Eq_2 ra, Eq_2 s0, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0124, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0144, Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s10Out)
{
	word32 s1_237;
	word32 a2_238;
	word32 a5_239;
	word32 a6_240;
	word32 s2_241;
	word32 s3_242;
	word32 s4_243;
	word32 s5_244;
	word32 s6_245;
	word32 s7_246;
	word32 s8_247;
	dbg_test_print(&g_b23075D64, dwArg0158, out s1_237, out a2_238, out a5_239, out a6_240, out s2_241, out s3_242, out s4_243, out s5_244, out s6_245, out s7_246, out s8_247);
	word32 a0_46;
	Eq_2 a3_49;
	Eq_2 s1_56;
	Eq_2 s2_59;
	Eq_2 s7_64;
	Eq_2 s9_66;
	Eq_2 a4_118;
	ptr32 s10_106;
	Eq_2 ra_54 = ProcessRxEAPOL_PwkMsg3(ra, s2, dwLoc08, dwArg0C, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s1_56, out a0_46, out a3_49, out a4_118, out s2_59, out s7_64, out s9_66, out s10_106);
	if (a0_46 != 0x00 && GeneratePWKMsg4(ra_54, s1_56, a3_49, a4_118, s2_59, s7_64, s9_66, fflags, frm, mstatus, dwLoc20, s4, s0, dwLoc0C, dwLoc04, dwArg08, dwArg0C, dwArg18, dwArg1C, dwArg58, dwArg5C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0124, dwArg0144, dwArg0178, out a4_118, out s10_106) == 0x00)
	{
		word32 s3_248;
		word32 s5_249;
		updateApReplayCounter(s3, dwArg0138, out a4_118, out s3_248, out s5_249);
		word32 s1_250;
		word32 a2_251;
		word32 a5_252;
		word32 a6_253;
		word32 s2_254;
		word32 s3_255;
		word32 s4_256;
		word32 s5_257;
		word32 s6_258;
		word32 s7_259;
		word32 s8_260;
		dbg_test_print(&g_b23075D78, dwArg0158, out s1_250, out a2_251, out a5_252, out a6_253, out s2_254, out s3_255, out s4_256, out s5_257, out s6_258, out s7_259, out s8_260);
	}
	s10Out = s10_106;
	return a4_118;
}

// 2300FF32: Register word32 ProcessKeyMgmtDataSta(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0124, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s5Out, Register out ptr32 s10Out)
// Called from:
//      ProcessEAPoLPkt
word32 ProcessKeyMgmtDataSta(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0124, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s5Out, ptr32 & s10Out)
{
	word32 a4_117;
	ptr32 s10_124;
	Eq_2 s1_35;
	Eq_2 s4_36;
	Eq_2 s2_40;
	Eq_2 s3_41;
	word32 a2_229;
	word32 a5_230;
	word32 a6_231;
	word32 s5_232;
	word32 s6_233;
	word32 s7_234;
	word32 s8_235;
	Eq_2 s0_34 = dbg_test_print(&g_b23075D64, dwArg0158, out s1_35, out a2_229, out a5_230, out a6_231, out s2_40, out s3_41, out s4_36, out s5_232, out s6_233, out s7_234, out s8_235);
	if (((word32) *((word32) s2_40 + 6) & 0x08) != 0x00)
	{
		if (((word32) *((word32) s2_40 + 5) & 0x01) != 0x00)
			a4_117 = KeyMgmtStaHsk_Recvd_PWKMsg3(ra, s0_34, s2_40, s3_41, s4_36, fflags, frm, mstatus, s2, s0, dwLoc08, dwLoc04, dwArg38, dwArg3C, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0108, dwArg0118, dwArg0124, dwArg0138, dwArg0158, out s10_124);
		else
			a4_117 = KeyMgmtStaHsk_Recvd_PWKMsg1(ra, s0_34, s1_35, s2_40, s4_36, fflags, frm, mstatus, s0, dwLoc08, dwArg18, dwArg24, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0178, out s10_124);
	}
	else
		a4_117 = KeyMgmtStaHsk_Recvd_GrpMsg1(ra, s2_40, s3_41, s4_36, fflags, frm, mstatus, s2, s0, dwLoc08, dwLoc04, dwArg08, dwArg0C, dwArg38, dwArg3C, dwArg58, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0124, dwArg0138, dwArg0158, out s10_124);
	ptr32 s5_169;
	word32 s1_236;
	word32 a2_237;
	word32 a5_238;
	word32 a6_239;
	word32 s2_240;
	word32 s3_241;
	word32 s4_242;
	word32 s6_243;
	word32 s7_244;
	word32 s8_245;
	dbg_test_print(&g_b23075D78, dwArg0178, out s1_236, out a2_237, out a5_238, out a6_239, out s2_240, out s3_241, out s4_242, out s5_169, out s6_243, out s7_244, out s8_245);
	s5Out = s5_169;
	s10Out = s10_124;
	return a4_117;
}

// 2300FFC6: Register word32 ProcessEAPoLPkt(Register Eq_2 ra, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0154, Register out (ptr32 Eq_32850) a1Out, Register out (ptr32 Eq_32851) a4Out, Register out (ptr32 Eq_32852) s5Out, Register out (ptr32 Eq_32853) s6Out, Register out (ptr32 Eq_32854) s7Out, Register out ptr32 s10Out)
// Called from:
//      rxu_cntrl_frame_handle
word32 ProcessEAPoLPkt(Eq_2 ra, Eq_2 s4, Eq_2 s5, Eq_2 s6, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF4, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0154, struct Eq_32850 & a1Out, struct Eq_32851 & a4Out, struct Eq_31105 & s5Out, struct Eq_32853 & s6Out, struct Eq_32854 & s7Out, ptr32 & s10Out)
{
	struct Eq_51560 * a5_38;
	word32 s2_46;
	word32 s1_304;
	word32 a2_305;
	word32 a6_306;
	word32 s3_307;
	word32 s4_308;
	word32 s6_309;
	word32 s7_310;
	word32 s8_311;
	word32 s5_164;
	dbg_test_print(&g_b23075D64, dwArg0148, out s1_304, out a2_305, out a5_38, out a6_306, out s2_46, out s3_307, out s4_308, out s5_164, out s6_309, out s7_310, out s8_311);
	struct Eq_32851 * a4_117 = (word32) a5_38->b0001;
	if (a4_117 == (struct Eq_32851 *) 0x03)
	{
		word32 s5_129;
		union Eq_2 * a5_61;
		Eq_2 s2_69;
		word32 s1_312;
		word32 a2_313;
		word32 a6_314;
		word32 s3_315;
		word32 s4_316;
		word32 s5_317;
		word32 s6_318;
		word32 s7_319;
		word32 s8_320;
		Eq_2 s0_63 = dbg_test_print(s2_46 + -668, dwArg0148, out s1_312, out a2_313, out a5_61, out a6_314, out s2_69, out s3_315, out s4_316, out s5_317, out s6_318, out s7_319, out s8_320);
		Eq_2 s1_74 = *a5_61;
		if ((word32) *a5_61 == 0x02)
			a4_117 = ProcessKeyMgmtDataAp(ra, s0_63, s1_74, fflags, frm, mstatus, dwLoc30, dwLoc2C, s6, dwLoc18, dwLoc0C, dwLoc08, dwArg1C, dwArg68, dwArg78, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0128, dwArg0154, out s5_129, out s10);
		else
			a4_117 = ProcessKeyMgmtDataSta(ra, s0_63, s1_74, s2_69, fflags, frm, mstatus, s6, s4, dwLoc18, dwLoc0C, dwArg08, dwArg0C, dwArg28, dwArg48, s5, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD4, dwArgD8, dwArgE8, dwArgF4, dwArg0108, dwArg0128, dwArg0148, out s5_129, out s10);
		word32 s1_328;
		word32 a2_329;
		word32 a5_330;
		word32 a6_331;
		word32 s2_332;
		word32 s3_333;
		word32 s4_334;
		word32 s6_335;
		word32 s7_336;
		word32 s8_337;
		dbg_test_print(s5_129 + -0x0288, dwArg0148, out s1_328, out a2_329, out a5_330, out a6_331, out s2_332, out s3_333, out s4_334, out s5_164, out s6_335, out s7_336, out s8_337);
	}
	struct Eq_32850 * a1_173 = *(union Eq_2 *) 0x44B00120 >> 1000;
	word32 s1_181;
	struct Eq_31105 * s5_188;
	struct Eq_32853 * s6_189;
	struct Eq_32854 * s7_190;
	word32 a2_321;
	word32 a5_322;
	word32 a6_323;
	word32 s2_324;
	word32 s3_325;
	word32 s4_326;
	word32 s8_327;
	dbg_test_print(s5_164 + -0x0288, dwArg0148, out s1_181, out a2_321, out a5_322, out a6_323, out s2_324, out s3_325, out s4_326, out s5_188, out s6_189, out s7_190, out s8_327);
	0x00 = (uint16) dwArg0128;
	a1Out = a1_173;
	a4Out = a4_117;
	s5Out = s5_188;
	s6Out = s6_189;
	s7Out = s7_190;
	s10Out = s10;
	return s1_181;
}

// 230100A0: Register word32 process_rsn_ie(Register Eq_2 a0, Register (ptr32 byte) a1, Register (ptr32 Eq_34770) a2, Register (ptr32 byte) a3, Register (ptr32 Eq_35374) a4, Register word32 a5, Stack Eq_2 dwArg010C, Register out ptr32 s0Out, Register out Eq_35378 s1Out, Register out Eq_35379 a0Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      rxu_mgt_ind_handler
//      bl_rx_scanu_result_ind
word32 process_rsn_ie(Eq_2 a0, byte * a1, struct Eq_34770 * a2, byte * a3, struct Eq_35374 * a4, word32 a5, Eq_2 dwArg010C, ptr32 & s0Out, union Eq_35378 & s1Out, union Eq_35379 & a0Out, ptr32 & s3Out, ptr32 & s4Out)
{
	if (((word32) *((word32) a0 + 9) << 8 | (word32) (*((word32) a0 + 8))) == 0x02)
	{
		word32 a5_49 = (word32) *((word32) a0 + 1);
		((word32) a0 + 9)->u1 = 0x00;
		*((word32) a0 + 1) = (byte) (a5_49 + ~0x03);
		((word32) a0 + 8)->u1 = 0x01;
		word32 a1_746;
		word32 a2_747;
		word32 a3_748;
		word32 a4_749;
		word32 a5_750;
		if (memcmp((word32) a0 + 0x0E, 587783584, 0x04, out a1_746, out a2_747, out a3_748, out a4_749, out a5_750) == 0x00)
		{
			word32 a7_764;
			word32 a4_761;
			word32 a6_763;
			word32 a1_758;
			word32 a3_760;
			word32 a5_762;
			word32 a2_759;
			memcpy((word32) a0 + 0x0A, (word32) a0 + 0x0E, 0x04, out a1_758, out a2_759, out a3_760, out a4_761, out a5_762, out a6_763, out a7_764);
		}
		word32 a1_751;
		word32 a3_753;
		word32 a7_757;
		word32 a5_755;
		word32 a6_756;
		word32 a4_754;
		word32 a2_752;
		memcpy((word32) a0 + 0x0E, (word32) a0 + 18, 0x0C, out a1_751, out a2_752, out a3_753, out a4_754, out a5_755, out a6_756, out a7_757);
	}
	word32 a6_744;
	word32 a7_745;
	word32 a5_743;
	word32 a1_739;
	word32 a3_741;
	word32 a4_742;
	word32 a2_740;
	memcpy(fp + -66, (word32) a0 + 0x0E, 0x02, out a1_739, out a2_740, out a3_741, out a4_742, out a5_743, out a6_744, out a7_745);
	uint32 a5_118 = 0x00;
	while (true)
	{
		uint32 a4_123 = (word32) wLoc42;
		if (a5_118 >= a4_123)
			break;
		ui32 s3_125 = a5_118 + 1;
		Eq_2 s11_129 = (s3_125 << 0x02) + 0x02 + ((word32) a0 + 0x0A);
		word32 a1_765;
		word32 a2_766;
		word32 a4_768;
		word32 a5_769;
		word32 a3_767;
		if (memcmp(s11_129, 587783580, 0x04, out a1_765, out a2_766, out a3_767, out a4_768, out a5_769) == 0x00)
			a4->b0000 = (byte) ((word32) a4->b0000 | 32);
		else
		{
			word32 a3_793;
			word32 a1_791;
			word32 a2_792;
			word32 a4_794;
			word32 a5_795;
			if (memcmp(s11_129, 587783596, 0x04, out a1_791, out a2_792, out a3_793, out a4_794, out a5_795) == 0x00)
				a4->b0001 = (byte) ((word32) a4->b0001 | 1);
		}
		a5_118 = s3_125 & 0x00FF;
	}
	if (a4_123 == 0x02)
	{
		Eq_2 a1_192;
		((word32) a0 + 1)->u1 = 0x14;
		word32 a5_774;
		word32 a6_775;
		word32 a7_776;
		word32 a2_771;
		word32 a3_772;
		word32 a1_770;
		word32 a4_773;
		memcpy((word32) a0 + 0x0E, fp + -66, 0x02, out a1_770, out a2_771, out a3_772, out a4_773, out a5_774, out a6_775, out a7_776);
		if (a5 != 0x00)
			a1_192.u0 = 587783580;
		else
			a1_192.u0 = 587783596;
		word32 a4_799;
		word32 a1_796;
		word32 a3_798;
		word32 a5_800;
		word32 a2_797;
		if (memcmp((word32) a0 + 20, a1_192, 0x04, out a1_796, out a2_797, out a3_798, out a4_799, out a5_800) == 0x00)
		{
			word32 a4_787;
			word32 a6_789;
			word32 a2_785;
			word32 a7_790;
			word32 a3_786;
			word32 a5_788;
			word32 a1_784;
			memcpy((word32) a0 + 16, (word32) a0 + 20, 0x06, out a1_784, out a2_785, out a3_786, out a4_787, out a5_788, out a6_789, out a7_790);
		}
		word32 a7_783;
		word32 a1_777;
		word32 a3_779;
		word32 a2_778;
		word32 a4_780;
		word32 a5_781;
		word32 a6_782;
		memcpy((word32) a0 + 20, (word32) a0 + 24, 0x02, out a1_777, out a2_778, out a3_779, out a4_780, out a5_781, out a6_782, out a7_783);
	}
	if (((word32) a4->b0001 & 0x01) != 0x00 && (((word32) a4->b0000 & 32) == 0x00 || a5 == 0x00))
	{
		*a3 = 0x01;
		((word32) a0 + 20)->u1 = 0xC0;
		word32 a5_267 = (word32) *((word32) a0 + 1);
		((word32) a0 + 22)->u1 = 0x00;
		*((word32) a0 + 1) = (byte) (a5_267 + 0x02);
		*((word32) a0 + 23) = 0x00;
		word32 a6_811;
		word32 a7_812;
		word32 a1_806;
		word32 a4_809;
		word32 a5_810;
		word32 a3_808;
		word32 a2_807;
		memcpy((word32) a0 + 24, 0x2308DDA8, 0x04, out a1_806, out a2_807, out a3_808, out a4_809, out a5_810, out a6_811, out a7_812);
		*((word32) a0 + 1) = (byte) ((word32) *((word32) a0 + 1) + 0x04);
	}
	ui32 a5_328;
	word32 a2_802;
	word32 a3_803;
	word32 a4_804;
	word32 a1_801;
	word32 a5_805;
	if (memcmp((word32) a0 + 0x0A, 587783584, 0x04, out a1_801, out a2_802, out a3_803, out a4_804, out a5_805) == 0x00)
		a5_328 = (word32) a2->b0000 | 8;
	else
	{
		word32 a3_815;
		word32 a5_817;
		word32 a1_813;
		word32 a2_814;
		word32 a4_816;
		if (memcmp((word32) a0 + 0x0A, 587783580, 0x04, out a1_813, out a2_814, out a3_815, out a4_816, out a5_817) != 0x00)
			goto l230101FC;
		a5_328 = (word32) a2->b0000 | 4;
	}
	a2->b0000 = (byte) a5_328;
l230101FC:
	ui32 a5_392;
	word32 a3_825;
	word32 a1_823;
	word32 a2_824;
	word32 a4_826;
	word32 a5_827;
	if (memcmp((word32) a0 + 4, 587783584, 0x04, out a1_823, out a2_824, out a3_825, out a4_826, out a5_827) == 0x00)
		a5_392 = (word32) *a1 | 8;
	else
	{
		word32 a1_818;
		word32 a4_821;
		word32 a3_820;
		word32 a2_819;
		word32 a5_822;
		if (memcmp((word32) a0 + 4, 587783580, 0x04, out a1_818, out a2_819, out a3_820, out a4_821, out a5_822) == 0x00)
			a5_392 = (word32) *a1 | 4;
		else
		{
			word32 a4_831;
			word32 a2_829;
			word32 a5_832;
			word32 a1_828;
			word32 a3_830;
			if (memcmp((word32) a0 + 4, 587783588, 0x04, out a1_828, out a2_829, out a3_830, out a4_831, out a5_832) == 0x00)
				a5_392 = (word32) *a1 | 2;
			else
			{
				word32 a2_834;
				word32 a1_833;
				word32 a4_836;
				word32 a3_835;
				word32 a5_837;
				if (memcmp((word32) a0 + 4, 587783576, 0x04, out a1_833, out a2_834, out a3_835, out a4_836, out a5_837) != 0x00)
				{
l2301021A:
					word32 a0_405 = (word32) *((word32) a0 + 1);
					0x00 = (uint16) dwArg010C;
					s0Out = dwArgCC;
					s1Out = dwLoc4C;
					a0Out = a0_405 + 0x02 & 0x00FF;
					s3Out = 0x2308E000;
					s4Out = dwArg0168;
					return dwLoc08;
				}
				a5_392 = (word32) *a1 | 1;
			}
		}
	}
	*a1 = (byte) a5_392;
	goto l2301021A;
}

